
GatherItems = {
	[1] = {
		[1] = {
			["del deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 62.26,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 48.48,
				},
			},
			["corrupted whipper root"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.04,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 20.98,
				},
			},
			["corrupted night dragon"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.62,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 14.04,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 80.54000000000001,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 62.89,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 89.36,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 34.51,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 56.11,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 28.44,
				},
			},
			[" silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.65,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 62.62,
				},
			},
			["银矿脉 [稀有] [75]"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.76,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 49.71,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.44,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 66.06,
				},
			},
			["mossy footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 83.3,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 98.09,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.98,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 83.20999999999999,
				},
			},
			["barrel of melon juice"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.27,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 45.01,
				},
			},
			["fleur de peste"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.92,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 5.34,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.66,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 62.65,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.12000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 94.09,
				},
			},
			["larmes d'arthas"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.42,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 16.05,
				},
			},
			["robuste truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.15,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 69.79000000000001,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 74.81,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 74.45,
				},
			},
			["玛雷姆的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.84,
				},
			},
			["vietérule"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 78.63,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 54.01,
				},
			},
			["rusty chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 72.38,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 76.45,
				},
			},
			["ooze covered gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.71,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 74.11,
				},
			},
			["patch of elemental water"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 80.83,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 95.15000000000001,
				},
			},
			["幽灵菇"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.73,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 8.060000000000001,
				},
			},
			["Плавающие обломки"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.97,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 55.44,
				},
			},
			["coffre de troll"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 33.15,
				},
			},
			["冰盖草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 28.82,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 40.17,
				},
			},
			["eglantine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 69.86,
				},
			},
			[" 富瑟银矿 "] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.7,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 38.61,
				},
			},
			["coffre endommagé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.45,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.64,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 97.31999999999999,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 52.02,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.61,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 58.92,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 60.46,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 45.03,
				},
			},
			["waterlogged footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 13.63,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 30.95,
				},
			},
			["coffre rouillé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 75.98,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 73.23,
				},
			},
			["riche filon de thorium"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 40.9,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 46.07,
				},
			},
			["Тролльский сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 34.38,
				},
			},
			["mountain delsage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.62,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 30.07,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.51,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 55.79,
				},
			},
			["瑟银矿脉"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.22,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 18.55,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 55.89,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 15.81,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 99.34999999999999,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 48.7,
				},
			},
			["maguskönigskraut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.37,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 35.58,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 66.29000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 83.20999999999999,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 74.16,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 52.47,
				},
			},
			["weapon crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 75.19,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 73.06,
				},
			},
			["坚固的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.51,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 42.56,
				},
			},
			["wilddornrose"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.8,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 30.56,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 71.92,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 79.73,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.41,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 16.17,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 51.16,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 21.19,
				},
			},
			["filon d'étain"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 47.07,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 48.86,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 41.93,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 11.07,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.95,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 19.64,
				},
			},
			["富瑟银矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.64,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 38.65,
				},
			},
			["königsblut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.17,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 67.28,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 63.8,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 54.34,
				},
			},
			["silbervorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 75.26000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 69.59,
				},
			},
			["ramponierte truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 7.01,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 12.32,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 18.46,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.56,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 99.78,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 96.65000000000001,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 93.51000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 97.01000000000001,
				},
			},
			["金矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 37.06,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 38.88,
				},
			},
			["mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 99.52,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 46.59,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.2,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 31.44,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.59,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 72.16,
				},
			},
			["阿尔萨斯之泪"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.51,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 62.14,
				},
			},
			["lila lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.22,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 13.17,
				},
			},
		},
		[2] = {
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 0.62,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 98.39,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 82.65000000000001,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 52.74,
				},
			},
			[" tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.93,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 61.47,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.62,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 90.68000000000001,
				},
			},
			["bergsilberweisling"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 25.2,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 54.43,
				},
			},
			["银矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 80.68000000000001,
				},
			},
			["银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.18,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 71.63,
				},
			},
			["corrupted songflower"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.82,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 20.98,
				},
			},
			["barrel of melon juice"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.77,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 75.52,
				},
			},
			["mossy footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.38,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 58.24,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.03,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 41.37,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 15.72,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 70.22,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.84,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 50.57,
				},
			},
			["etouffante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.22,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 31.13,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 36.02,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.4,
				},
			},
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.02,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 45.89,
				},
			},
			["Тролльский сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.97,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.7,
				},
			},
			["贝壳陷阱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 24.3,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 77.45,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.03,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 72.16,
				},
			},
			["秘银矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.19,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 78.61,
				},
			},
			["Поврежденный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.45,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.65,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.94,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 72.91,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 68.06,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 22.52,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 80.48,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 18.53,
				},
			},
			[" Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.04,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 30.72,
				},
			},
			["Горный серебряный шалфей"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.25,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 54.46,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 8.35,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 77.23,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.44,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 59.38,
				},
			},
			["银矿脉 [稀有] [75]"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.76,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 49.71,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 61.72,
				},
			},
			["Ящик с провизией"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.56,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 36.58,
				},
			},
			["crate of elunite"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.56,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.4,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 2.33,
				},
			},
			["coffre d'hydraxis"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 79.23,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 74.77,
				},
			},
			["野钢花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.13,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 13.4,
				},
			},
			["lila lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.89,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 50.41,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.48,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 25.44,
				},
			},
			["patch of elemental water"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.8,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 38.79,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.71,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 64.40000000000001,
				},
			},
			["皇血草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.22,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 35.03,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 2.74,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 57.58,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.46,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 61.15,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 57.41,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 27.13,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 84.45,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 72.59,
				},
			},
			[" Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.15,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 18.3,
				},
			},
			["riche filon de thorium"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 40.9,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 46.07,
				},
			},
			[" 瑟银矿脉 "] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.33,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 72.42,
				},
			},
			["玛雷姆的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.45,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.86,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.7,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 97.44,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 17.55,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 51.96,
				},
			},
			["坚固的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 78.81,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 23.25,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.98,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 70.14,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.88,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 78.64,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.38,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 67.06,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.45,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 19.13,
				},
			},
			["秘银矿床"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.3,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 73.43000000000001,
				},
			},
			["铜矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 72.55,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 24.36,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.44,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 97.52,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 31.73,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 70.31,
				},
			},
			["school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.76,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 70.45,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.4,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 52.03,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.62,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 90.68000000000001,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 18.21,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 76.89,
				},
			},
			[" copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.27,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 22.48,
				},
			},
			["coffre solide"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 32.38,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 45.26,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.19,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 89.06,
				},
			},
			["mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.4,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 28.68,
				},
			},
			["锡矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.48,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 79.73,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 18.55,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 55.48,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 13.26,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 72.26000000000001,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.19,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 92.67,
				},
			},
		},
		[3] = {
			["lebenswurz"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.29000000000001,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 77.36,
				},
			},
			["kiste mit löchern"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.32,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 37.61,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.86,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 91.61,
				},
			},
			["school of deviate fish"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 4.26,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 82.94,
				},
			},
			["软泥覆盖的金矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.72,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 86.5,
				},
			},
			["Оловянная жила [65]"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.92,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.38,
				},
			},
			["山鼠草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 24.44,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 38.31,
				},
			},
			["beulengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.58,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 5.25,
				},
			},
			["mossy footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 93.91,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 96.64,
				},
			},
			["Оскверненный Ночной дракон"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.67,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 79.2,
				},
			},
			["erdwurzel"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.08,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 37.08,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.9,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 89.59999999999999,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 58.33,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 14.4,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 0.18,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 64.63,
				},
			},
			["  Сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 26.92,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 73.91,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 46.96,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.75,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 49.36,
				},
			},
			["filon d'étain"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.57,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 20.21,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.39,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 36.65,
				},
			},
			["  Ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 75.22,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 73.08,
				},
			},
			["黑莲花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.22,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 60.55,
				},
			},
			["食人妖的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 35.27,
				},
			},
			["Гигантский моллюск в мягком панцире"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 32.69,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 25.26,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.55,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 21.66,
				},
			},
			["软泥覆盖的秘银矿脉"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.72,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 86.42,
				},
			},
			["Оскверненный песнецвет"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 75.95,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 32.82,
				},
			},
			["del"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.42,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 54.4,
				},
			},
			["terrestrine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 10.9,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 23.81,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 77.52,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 61.78,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 91.43000000000001,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 43.53,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.07,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 53.94,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 39.9,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 52.02,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 56.81,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 27.03,
				},
			},
			["oil spill"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 72.91,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 55.06,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.86,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 91.61,
				},
			},
			["lotus noir"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.97,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 45.63,
				},
			},
			["Удавник "] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.76,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 74.76000000000001,
				},
			},
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 5.66,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 87.45999999999999,
				},
			},
			["ghost mushroom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.92,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 65.69,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.95,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 4.17,
				},
			},
			["cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.91,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 35.79,
				},
			},
			["floating debris"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 32.36,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 42.28,
				},
			},
			["ramponierte truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.83,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 43.52,
				},
			},
			["corrupted windblossom"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.74,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 97.70999999999999,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.81999999999999,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 76.33,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.24,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 62.08,
				},
			},
			["vorratskiste des wegekreuzes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.41,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 24.75,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.29,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 62.89,
				},
			},
			["lotus pourpre"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.54000000000001,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 85.45,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.88,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 35.11,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.03,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 31.67,
				},
			},
			["破损的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.43,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.71,
				},
			},
			["filon d'or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 41,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 35.18,
				},
			},
			["blue power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 17.42,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 80.84,
				},
			},
			["caisse endommagée"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.83,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.75,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 51.15,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 69.48,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 47.42,
				},
			},
			["迷雾之纱号的保险箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.61,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 27.44,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.74,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 67.23,
				},
			},
			["coffre solide"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.08,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 36.64,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.83,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 44.27,
				},
			},
			["野钢花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.9,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 29.67,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.78,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 33.78,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.8,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 20.37,
				},
			},
			["瘟疫花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.4,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 88.34999999999999,
				},
			},
			["eiskappe"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.96,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 54.91,
				},
			},
			["文件箱#1"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.8,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.6,
				},
			},
		},
		[4] = {
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.74,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.01,
				},
			},
			["秘银矿床"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 61.78,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 38.95,
				},
			},
			["würgetang"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.36,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 73.15000000000001,
				},
			},
			["captain's footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 71.56,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 51.3,
				},
			},
			["Косяк загадочной рыбы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.42,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 49.11,
				},
			},
			["Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.79,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 66.95,
				},
			},
			["火焰花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.75,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 24.1,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 3.03,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 9.470000000000001,
				},
			},
			["crate of elunite"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.56,
				},
			},
			["gallywix's lockbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.22,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 16.2,
				},
			},
			["Покрытые слизью залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 47.93,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 81.04000000000001,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 1.72,
				},
			},
			["Желтый кристалл силы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.17,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 20.34,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.71,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 41.59,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.39,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 41.48,
				},
			},
			["  Ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.21,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 46.19,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 41.91,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 15.4,
				},
			},
			["Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.24,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 62.08,
				},
			},
			["doulourante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.48,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 19.98,
				},
			},
			["Сейф буканьера"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.9,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 92.53,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 22.4,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 97.51000000000001,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.01,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 44.41,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.42,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 68.47,
				},
			},
			["Удавник "] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.18,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 94.01000000000001,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 36.76,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 74.76000000000001,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 9.220000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 5.64,
				},
			},
			["del of foodstuffs"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.61,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 36.63,
				},
			},
			["Оскверненный песнецвет"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 24.18,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 34.51,
				},
			},
			["Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 99.59,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 90.78,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 84.31999999999999,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 84.26000000000001,
				},
			},
			["gromsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.86,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 73.8,
				},
			},
			["malem chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.52,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.75,
				},
			},
			["sang-royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 1.91,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 67.48,
				},
			},
			["lotus pourpre"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.59999999999999,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 35.44,
				},
			},
			["安戈洛的泥土"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 72.02,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 32.57,
				},
			},
			["sansam doré"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.68,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 91.29000000000001,
				},
			},
			[" Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.23,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.77,
				},
			},
			["damaged crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.01,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.82,
				},
			},
			["瑟银矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 64.03,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 30.21,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 30.88,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 43.9,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 86.55,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.01,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 74.95,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 73.39,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 85.69,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 52.69,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 27.56,
				},
			},
			["filon d'or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.06,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 15.42,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.87,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 21.25,
				},
			},
			["Ящик с гномскими инструментами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.76,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 45.86,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 62.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 41.78,
				},
			},
			["Поврежденный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.46,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.65,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.31,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 58.64,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.03,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 90.54000000000001,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.92,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 67.72,
				},
			},
			["lebenswurz"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.29000000000001,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 77.36,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.56,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 75.3,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.96,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 87.43000000000001,
				},
			},
			[" Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.55,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 10.19,
				},
			},
			["瑟银矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.77,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 27.38,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 79.88,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 18.73,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.5,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 83.44,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 40.35,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 28.07,
				},
			},
		},
		[5] = {
			["sonnengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.59,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 12.48,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.94,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 57.69,
				},
			},
			["corrupted night dragon"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 13.38,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 54.23,
				},
			},
			["gromsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.65,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 82.56,
				},
			},
			["Ящик c пометкой \"Лавка Дриззлика\""] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.64,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 49.66,
				},
			},
			[" truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 78.7,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 28.3,
				},
			},
			["grave moss"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.28,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 48.91,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.82,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 38.63,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.46,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 72.26000000000001,
				},
			},
			["冰盖草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.56,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 66.81,
				},
			},
			["Обломки в воде"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.13,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 74.22,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 66.67,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 28.15,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.73,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 58.74,
				},
			},
			["chest of nesting"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.39,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 60.53,
				},
			},
			["山鼠草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.72,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 70.56,
				},
			},
			["Побитый сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.55,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 86.74,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 78.05,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.17,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 88.23,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.56,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 41.48,
				},
			},
			["stonescale eel swarm"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 77.18000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 98.40000000000001,
				},
			},
			["ooze covered truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.04,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 80.94,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 96.15000000000001,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 88.56,
				},
			},
			["Ящик с блеснами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.15,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.65,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 87.84999999999999,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 72.34,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 9,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 16.57,
				},
			},
			["caisse endommagée"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.89,
				},
			},
			["giant softshell clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.11,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 30.7,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.09,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 75.26000000000001,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 22.33,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 71.23,
				},
			},
			["vietérule"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 78.63,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 54.01,
				},
			},
			[" iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 55.06,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 46.01,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.01,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 60.72,
				},
			},
			["riche filon de thorium"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.44,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 77.62000000000001,
				},
			},
			[" chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 78.86,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 23.34,
				},
			},
			[" liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.57,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 76.78,
				},
			},
			["Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 88.15000000000001,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 78.03,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.62,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 40.94,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.92,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 24.28,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.32,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 32.72,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 77.76000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 19.43,
				},
			},
			["maguskönigskraut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.23,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 49.61,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.94,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 58.21,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.67,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 81.99,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.5,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 12.47,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 3.85,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 79.86,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.42,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 73.98,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 26.06,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 79.15000000000001,
				},
				[3] = {
					["gtype"] = 0,
					["x"] = 12.31,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 55.17,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.22,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 40.01,
				},
			},
			["Ржавый сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 73.56,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 72.87000000000001,
				},
			},
			["shellfish trap"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 22.4,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 75.08,
				},
			},
			["Гнилой кнутокорень"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 13.38,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 44.37,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.94,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 21.8,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 72.56,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 24.36,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.85,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 24.09,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 8.810000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 22.34,
				},
			},
			["梦叶草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.81,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 65.09,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.11,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 52.94,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.24,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 0.48,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 10.77,
				},
			},
			["Черный лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.17,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 15.43,
				},
			},
			["box of assorted parts"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.77,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 84.93000000000001,
				},
			},
		},
		[6] = {
			["Поврежденный ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.02,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.89,
				},
			},
			["bloodpetal sprout"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 83.14,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 57.48,
				},
			},
			["ooze covered mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 77.12000000000001,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 65.27,
				},
			},
			["gromsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.43,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 4.13,
				},
			},
			["buccaneer's strongbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.95,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 92.66,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.46,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 25.31,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.4,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 60.64,
				},
			},
			["terrestrine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.01,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 27.91,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 58.72,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 34.56,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.41,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 37.78,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.78,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 37.69,
				},
			},
			["robuste truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 28.36,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 64.11,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 37.84,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 69.28,
				},
			},
			["pacifique"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.08,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 35.92,
				},
			},
			["filon de cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 53.09,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 45.72,
				},
			},
			["ooze covered gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.7,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 74.11,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.7,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 49.82,
				},
			},
			["金矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 58.99,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 15.43,
				},
			},
			["ooze covered truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 74.59,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 62.14,
				},
			},
			["Замшелый сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.5,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 88.53,
				},
			},
			["gallywix's lockbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.22,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 16.2,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.62,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 60.29,
				},
			},
			["etouffante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.35,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 85.97,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 60.47,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 67.84,
				},
			},
			["eisenvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.22,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 16.51,
				},
			},
			[" Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 76.72,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 52.78,
				},
			},
			["ornate chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.93,
				},
			},
			["红色能量水晶"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.64,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 50.1,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.03,
					["count"] = 2,
					["icon"] = 2,
					["y"] = 48.61,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 43.29,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 39.36,
				},
			},
			[" silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.33,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 58.04,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 49.47,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 51.11,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.72,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 77.16,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.06,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 23.18,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 32.21,
				},
			},
			["华丽的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.18,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 50,
				},
			},
			["crate with holes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.3,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 37.61,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.03,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 49.99,
				},
			},
			["ooze covered rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 63.03,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 91.08,
				},
			},
			[" Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 81.18000000000001,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 90.45999999999999,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.98,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 40.96,
				},
			},
			["梦叶草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.35,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 79.56,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.86,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 66.7,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 35.4,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 46.79,
				},
			},
			["feuillargent"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.66,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 12.33,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 21.27,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 98.45,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.67,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 40.32,
				},
			},
			["Нефтяное пятно"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.22,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 41.23,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 62.64,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 45.53,
				},
			},
			["navetille purifiée"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.18,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 85.25,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 15.82,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 95.91,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.15,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 49.44,
				},
			},
			["fleur de chant"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.89,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 6.12,
				},
			},
			["Косяк огнеперого луциана"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 14.63,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 97.87000000000001,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.01,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 16.35,
				},
			},
			[" ooze covered gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.72,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 74.11,
				},
			},
			[" 绿色能量水晶 "] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.6,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 12.35,
				},
			},
			["coffre endommagé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.15,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 18.96,
				},
			},
			["fass mit milch"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.86,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 76.19,
				},
			},
		},
		[7] = {
			["sonnengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.59,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 12.48,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.2,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 26.21,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 3.59,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 89.55,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 4.05,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 81.25,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.58,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 50.41,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 9.109999999999999,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 17.17,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 7.31,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 19.16,
				},
			},
			["Росток кровоцвета"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 48.01,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 14.16,
				},
			},
			["Стайка каменного угря"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 73.01000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 44.15,
				},
			},
			["Ящик с провизией"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.56,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 36.44,
				},
			},
			["Побег кровоцвета"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.15,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 16.76,
				},
			},
			["wintersbite"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.3,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 66.43000000000001,
				},
			},
			["软泥覆盖的金矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 73.98,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 64.59,
				},
			},
			["pacifique"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.14,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 95.64,
				},
			},
			["Побитый сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.71,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.66,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.11,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 37.01,
				},
			},
			["coffre de malem"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.56,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.88,
				},
			},
			["un'goro soil"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.18,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 44.06,
				},
			},
			["ornate chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.93,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.33,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 69.48,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.86,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 15.82,
				},
			},
			["生锈的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 73.97,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 73.41,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.83,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 68.61,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.3,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 51.45,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.5,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 24.58,
				},
			},
			["bergsilberweisling"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.51,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 54.04,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 61.95,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 11.15,
				},
			},
			["Зеленый кристалл силы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.67,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 26.88,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 5.79,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 83.99,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 23.66,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 83.25,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.6,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 18.6,
				},
			},
			[" Огнецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.78,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 27.05,
				},
			},
			["Кровь грома"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.43,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 4.13,
				},
			},
			["ooze covered rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.33,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 49.24,
				},
			},
			["purple lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 14.45,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 90.17,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 79.23,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 82.19,
				},
			},
			["Украшенный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.96,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 0.38,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 67.05,
				},
			},
			["filon d'argent couvert de limon"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.12000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.16,
				},
			},
			["武器箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 77.81,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 74.40000000000001,
				},
			},
			["tattered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.21,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 55.66,
				},
			},
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.56,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 39.03,
				},
			},
			["chest of the black feather"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.7,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 61.16,
				},
			},
			["fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 74.79000000000001,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.97,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.65,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 95.95999999999999,
				},
			},
			["mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.75,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 51.87,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.06,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 20.77,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.66,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 22.55,
				},
			},
			[" Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.59,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 56.93,
				},
			},
			["gromsang"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.72,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 73.93000000000001,
				},
			},
		},
		[8] = {
			["sonnengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.77,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 48.53,
				},
			},
			["corrupted night dragon"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.72,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 78.26000000000001,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 42.46,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 13.91,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.45,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 95.45,
				},
			},
			["buccaneer's strongbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.95,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 92.65000000000001,
				},
			},
			["del"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.78,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 76.7,
				},
			},
			["Косяк загадочной рыбы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 80.15000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 24.26,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 24.57,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 13.7,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.39,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 17.57,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 49.96,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 31.86,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.48,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 22.53,
				},
			},
			["Ящик с оружием"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.33,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.18,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 24.35,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 83.18000000000001,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.46,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 22.7,
				},
			},
			["山鼠草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.31,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 8.58,
				},
			},
			["Побитый сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.55,
				},
			},
			["lila lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.7,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 68.92,
				},
			},
			[" sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.52,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 44.97,
				},
			},
			["corrupted songflower"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.14,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 44.35,
				},
			},
			["stonescale eel swarm"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.89,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 53.07,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.55,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 21.03,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.69,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 85.74,
				},
			},
			["cleansed songflower"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.29,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 22.56,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 40.15,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 56.58,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.14,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 3.87,
				},
			},
			["Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.35,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 92.68000000000001,
				},
			},
			["Удавник "] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.76,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 74.76000000000001,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 31,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 7.69,
				},
			},
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 28.47,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 33.25,
				},
			},
			["vietérule"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.07,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 23.18,
				},
			},
			["Ящики с припасами для Перекрестка"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.33,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 24.82,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 97.05,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 19.89,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 74.92,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 8.77,
				},
			},
			["Гигантский моллюск"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 17.01,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 12.18,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.58,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.02,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.44,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 80.17,
				},
			},
			["yellow power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 98.06,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 84.91,
				},
			},
			["khadgars schnurrbart"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 25.73,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 47.84,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.78,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 33.78,
				},
			},
			["gromsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.08,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 11.95,
				},
			},
			["瑟银矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 49,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 29.59,
				},
			},
			["eisenvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.13,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.68,
				},
			},
			["floadelg wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.29,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 51.05,
				},
			},
			["Поврежденный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.46,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.65,
				},
			},
			["goldener sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.36,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 63.49,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 40.26,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 9.01,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 31.11,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 85.69,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 30.27,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 10,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 25.91,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 37.61,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 19.03,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 45.44,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 18.27,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 53.09,
				},
			},
			["whipper root"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.35,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 12.21,
				},
			},
			["武器箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 75.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 73.04000000000001,
				},
			},
			["fleur de vent"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.99,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 79.94,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 14.79,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 8.52,
				},
			},
			["Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.43,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 87.20999999999999,
				},
			},
			["fleur de chant"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 48.24,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 75.58,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 12.27,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 92.55,
				},
			},
			["waterlogged footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.41,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 91.34,
				},
			},
			["school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 42.66,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 63.14,
				},
			},
			["chest of the sky"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.61,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 62.38,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 84.90000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 99.55,
				},
			},
			["金棘草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 21.53,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 59.6,
				},
			},
		},
		[9] = {
			["corrupted whipper root"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.42,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 12.17,
				},
			},
			["gromsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.19,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 72.66,
				},
			},
			["软泥覆盖的富瑟银矿脉\nfreefly\n未知目标"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 45.33,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 15.77,
				},
			},
			["un'Goro erde"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.57,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 83.34,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 73.3,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 26.31,
				},
			},
			["Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.74,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 88.38,
				},
			},
			["school of deviate fish"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 98.88,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 28.7,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26.54,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 26.36,
				},
			},
			["dorépine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 80.72,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 46.52,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.92,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 52.78,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.15000000000001,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 3.89,
				},
			},
			["machtkristall"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.73,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 92.48,
				},
			},
			["vietérule"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.23,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 46.29,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 90.95999999999999,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 73.38,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 96.28,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 47.77,
				},
			},
			["Ледяной зев"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.04,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 41.92,
				},
			},
			[" ooze covered truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 72.02,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 64.01000000000001,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 74.59,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 62.17,
				},
			},
			["damaged crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.01,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.82,
				},
			},
			["Кровь Грома"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.41,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 38.63,
				},
			},
			["  Ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.75,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 48.3,
				},
			},
			["Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 15.47,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 19.97,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 22.91,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 18.19,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 7.49,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 49.49,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 6.86,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 71.34,
				},
			},
			["kerlonian's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.33,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 76.31,
				},
			},
			["mage royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 25.57,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 18.52,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.98,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 50.85,
				},
			},
			["ooze covered mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 78.05,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 64.7,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 74.55,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 65.03,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.72,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 48.12,
				},
			},
			["feuillerêve"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.26,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 42.41,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.81,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 51.87,
				},
			},
			["Побег кровоцвета"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.79,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 15.32,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 93.74,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 0.22,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 74.37000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 0.92,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 82.98,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 90.75,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 79.69,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 43.13,
				},
			},
			["Побитый сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.31,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 73.03,
				},
			},
			["lila lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.7,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 68.92,
				},
			},
			["ooze covered gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 73.52,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 62.33,
				},
			},
			["黄金参"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.06,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 73.42,
				},
			},
			["秘银矿脉"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.44,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 10.16,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 65.39,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 26.89,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 22.4,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 97.51000000000001,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 33.97,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 51.54,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 47.84,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 37.63,
				},
			},
			["Ящик с гномскими инструментами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.76,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 45.88,
				},
			},
			["ooze covered thorium (riche)"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 63.92,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 85.45,
				},
			},
			["Ящики с припасами для Перекрестка"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.33,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 24.82,
				},
			},
			["Гигантский моллюск"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 17.01,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 12.18,
				},
			},
			["Синий кристалл силы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.28,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 25.29,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.26,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 67.25,
				},
			},
			["食品箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.89,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 61.1,
				},
			},
			[" ooze covered mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 72.58,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 64.5,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 99.58,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 48.59,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.65,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 0.59,
				},
			},
			["sonnengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 62.65,
				},
			},
			["Очищенный песнецвет"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.29,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 52.2,
				},
			},
			["海达克西斯的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 79.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 74.81,
				},
			},
			["cleansed songflower"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.57,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 13.92,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 83.64,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 98.08,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.59,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 29.35,
				},
			},
			[" Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.26,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 57.87,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26.45,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 4.15,
				},
			},
			[" sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.52,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 44.97,
				},
			},
			["khadgars schnurrbart"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.36,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 51.43,
				},
			},
			[" mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.22,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 25.54,
				},
			},
			["mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.78,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 39.77,
				},
			},
			["school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.78,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 37.17,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 45.85,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 52.7,
				},
			},
			["gisement de mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 58.35,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 87.91,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.63,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 36.63,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.97,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 63.2,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 24.78,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 62.8,
				},
			},
		},
		[10] = {
			["del deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26.86,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 72.26000000000001,
				},
			},
			["bloodpetal sprout"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 93.15000000000001,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 45.67,
				},
			},
			["corrupted whipper root"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.14,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 85.22,
				},
			},
			["ooze covered mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 69.25,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 82.83,
				},
			},
			["Черный лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.22,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 79.27,
				},
			},
			["swiftthistle"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.04,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 14.08,
				},
			},
			["echtsilberablagerung"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.96,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.91,
				},
			},
			["Огнецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 71.59,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 47.52,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.09,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 59.71,
				},
			},
			["stolen iron chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 26.59,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.75,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 52.8,
				},
			},
			["goldvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 22.12,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 24.29,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.77,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 73.3,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.17,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 32.18,
				},
			},
			["oil spill"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.73,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 0.5600000000000001,
				},
			},
			["filon de cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.88,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 19.35,
				},
			},
			["firebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.22,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 96.59,
				},
			},
			["tombeline"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.06,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 29.81,
				},
			},
			["mossy footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 11.73,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 87.29000000000001,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.42,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 51,
				},
			},
			["紫莲花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 19.13,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 63.21,
				},
			},
			["eglantine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.02,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 47.5,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 76.17,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 82.95,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 73.48,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 91.56,
				},
			},
			["软泥覆盖的金矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 73.98,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 64.59,
				},
			},
			["giant softshell clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 11.38,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 96.98,
				},
			},
			["malem chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.54,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.8,
				},
			},
			["ornate chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.93,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.79,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 73.94,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 77.25,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 98.65000000000001,
				},
			},
			["sauge-argent des montagnes"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.67,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 85.75,
				},
			},
			[" Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.93,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 52.63,
				},
			},
			["gromsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.9,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 73.83,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.84,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 79.55,
				},
			},
			["Синий кристалл силы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.86,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 15.6,
				},
			},
			["document chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 41.46,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.62000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 96,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 57.06,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.48,
				},
			},
			["filon d'étain"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 72.25,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 51.8,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.33,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 91.28,
				},
			},
			["weapon crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.34,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.21,
				},
			},
			["Малая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 55.76,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 49,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.34,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 54.25,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.59,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 49.16,
				},
			},
			["gisement de mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.82,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 66.76000000000001,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.61,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 61.37,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 81.19,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 88.8,
				},
			},
			["aciérite sauvage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.44,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 19.67,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 43.08,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 22.21,
				},
			},
			["侏儒工具箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.08,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 41.75,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 39.45,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 96.53,
				},
			},
			["silbervorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 20.79,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 37.9,
				},
			},
			["ooze covered rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 6.41,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 68.63,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.59,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 70.25,
				},
			},
			["Могильный мох"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.03,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 81.26000000000001,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 18.82,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 10.63,
				},
			},
			["Стая рыбы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 22.08,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 72.98,
				},
			},
			["wintersbite"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.3,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 66.43000000000001,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.28,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 50.32,
				},
			},
			["Затопленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.46,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.95,
				},
			},
		},
		[11] = {
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 82.26000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 23.77,
				},
			},
			["corrupted whipper root"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.72,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 19.13,
				},
			},
			["gromsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.41,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 38.63,
				},
			},
			["Ящик c пометкой \"Лавка Дриззлика\""] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.64,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 49.66,
				},
			},
			["swiftthistle"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.33,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 60.19,
				},
			},
			["巢穴之箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.39,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 60.55,
				},
			},
			["terrestrine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.61,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 27.39,
				},
			},
			["grave moss"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 0.31,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 31.71,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.24,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 66.2,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.68,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 92.15000000000001,
				},
			},
			[" mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.22,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 21.45,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 21.66,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 99.65000000000001,
				},
			},
			["petit coffre de bons"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.95,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 33.07,
				},
			},
			["filon de cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.22,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 23.62,
				},
			},
			[" Чумоцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.21,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 37.58,
				},
			},
			["sealed supply crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.76,
					["count"] = 1,
					["icon"] = 4,
					["y"] = 48.22,
				},
			},
			["Оскверненный Ночной дракон"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.72,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 78.26000000000001,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 42.46,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 13.91,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.28,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 70.68000000000001,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.34,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 40.15,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.53,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 68.53,
				},
			},
			["荆棘藻"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.18,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 60.16,
				},
			},
			["银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.38,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 51.09,
				},
			},
			["Ящик с гномскими инструментами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.76,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 45.88,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 17.39,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 72.13,
				},
			},
			["feuillargent"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 19,
				},
			},
			["waterlogged footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 6.15,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 78.41,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 28.52,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 37.46,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 15.16,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.51,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 90.95999999999999,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 73.38,
				},
			},
			["ooze covered mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 74.41,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 62.25,
				},
			},
			["crate with holes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.3,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 37.61,
				},
			},
			["calot de glace"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.3,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 44.4,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 23.09,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 38.04,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.35,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 92.68000000000001,
				},
			},
			["  Сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.41,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 60.59,
				},
			},
			["Ящики с припасами для Перекрестка"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.33,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 24.82,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.73,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 51.86,
				},
			},
			["filon d'argent couvert de limon"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.12000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.16,
				},
			},
			["wilddornrose"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.94,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 47.58,
				},
			},
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 91.33,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 98.75,
				},
			},
			["gisement de mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 68.81,
				},
			},
			["filon d'étain"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 64.14,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.46,
				},
			},
			["Поврежденный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.46,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.65,
				},
			},
			["crate of foodstuffs"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.47,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 36.45,
				},
			},
			["Чумоцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.55,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 41.23,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.21,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 5.75,
				},
			},
			["软泥覆盖的富瑟银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.03,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 11.27,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 13.74,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 62.51,
				},
			},
			["Побег кровоцвета"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.84,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 27.64,
				},
			},
			["Кровь Грома"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.33,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 21.39,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 40.04,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 58.72,
				},
			},
			["sauge-argent des montagnes"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 91.81999999999999,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 89.59999999999999,
				},
			},
			["Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.02,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 14.2,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 48.52,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 72.05,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 60.28,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 48.32,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26.39,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 3.59,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 53.69,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 21.65,
				},
			},
			["fass mit milch"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 78.38,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 85.31,
				},
			},
		},
		[12] = {
			["del deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38.22,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 77.44,
				},
			},
			["mage royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.83,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 15.08,
				},
			},
			["cleansed songflower"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.65,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 86.92,
				},
			},
			["chest of the sky"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.63,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 62.44,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.34,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 70.43000000000001,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.72,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 79.7,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 70.76000000000001,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 34.15,
				},
			},
			["stolen iron chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 26.67,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 39.43,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 74.69,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 77.76000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 19.43,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.62000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 96,
				},
			},
			[" khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.59,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 18.92,
				},
			},
			["Замшелый сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.36,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 16.95,
				},
			},
			["corrupted songflower"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.15,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 44.46,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.49,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 74.39,
				},
			},
			["mossy footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.54,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 13.94,
				},
			},
			["Покрытая слизью богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 64.11,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 83.79000000000001,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 77.25,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 98.65000000000001,
				},
			},
			["金矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 77.15000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 52.21,
				},
			},
			["damaged chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.45,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.61,
				},
			},
			["malem chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.53,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.79,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 39.9,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 27.25,
				},
			},
			["un'goro soil"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 30.67,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 56.79,
				},
			},
			["crate of foodstuffs"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.47,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 36.43,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.15,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 61.44,
				},
			},
			["königsblut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.07,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 75.45,
				},
			},
			["Косяк шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.87000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 47.51,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.02,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 14.7,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.83,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 44.27,
				},
			},
			["Обломки в воде"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.13,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 74.22,
				},
			},
			["kiste mit lebensmitteln"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.51000000000001,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 36.52,
				},
			},
			["traumblatt"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.5,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 68.05,
				},
			},
			["ooze covered rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 23.29,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 51.74,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.84,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 79.55,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 86.8,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 5.92,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 86.8,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 5.92,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.61,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 45.73,
				},
			},
			["argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.19,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 50.88,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.56,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 32.49,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 47.21,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.54,
				},
			},
			["giant softshell clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.93,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 30.58,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 49.16,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 73.22,
				},
			},
			["un'Goro erde"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.47,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 26.76,
				},
			},
			["Могильный мох"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.38,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 56.52,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.43,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 21.27,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.07,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 77.98,
				},
			},
			["Сундук Карнитола"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.1,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 30.44,
				},
			},
			["  Гигантский моллюск"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.63,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 54.16,
				},
			},
			["铜矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.49,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 16.76,
				},
			},
		},
		[13] = {
			["Поврежденный ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.04,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.79,
				},
			},
			["bloodpetal sprout"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 88.08,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 63.18,
				},
			},
			["corrupted night dragon"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 42.46,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 13.91,
				},
			},
			["秘银矿床"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.79,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 66.62000000000001,
				},
			},
			["地根草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.03,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 14.07,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 7.06,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 86.93000000000001,
				},
			},
			["chest of the black feather"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.71,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 61.17,
				},
			},
			["chest of nesting"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.39,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 60.53,
				},
			},
			[" Огнецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.26000000000001,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 32.22,
				},
			},
			["银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.24,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 15.12,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.57,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 31.11,
				},
			},
			["red power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 90.76000000000001,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 20.02,
				},
			},
			["giant softshell clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.93,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 30.58,
				},
			},
			["Сундук Небес"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.61,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 62.45,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 7.24,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 19,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 84.09999999999999,
				},
			},
			["pâlerette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.63,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 7.98,
				},
			},
			["wilddornrose"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.92,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 44.93,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.3,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 79.02,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.35,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 77.17,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.48,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 29.8,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 95.64,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 32.06,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 30.57,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 48.37,
				},
			},
			["Покрытая слизью серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.09,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.09999999999999,
				},
			},
			["del deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26.86,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 72.26000000000001,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.22,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 89.45,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 13.14,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 28.33,
				},
			},
			["联盟宝箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 28.31,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 12.25,
				},
			},
			["ooze covered argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.13,
					["count"] = 0,
					["icon"] = 0,
					["y"] = 85.09999999999999,
				},
			},
			["del"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.65,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 55.18,
				},
			},
			["green power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 84.18000000000001,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 71.52,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 97.98,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 44.81,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 3.9,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 3.9,
				},
			},
			["blue power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 89.14,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 84.34,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 16.57,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 78.09,
				},
			},
			["Покрытая слизью богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 4.61,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 75.31,
				},
			},
			["cleansed windblossom"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.16,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 23.43,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.75,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 73.98,
				},
			},
			["Гигантский моллюск в мягком панцире"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 32.79,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 35.29,
				},
			},
			["Обломки в воде"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.11,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 38.22,
				},
			},
			["coffre de documents n°1"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.81,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.63,
				},
			},
			["mage royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.22,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 17.39,
				},
			},
			["Упаковочный ящик Гизмориума"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.02,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.4,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.99,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 29.16,
				},
			},
			["真银矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.13,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 59.81,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 15.59,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 44.08,
				},
			},
			["lotus pourpre"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.57,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 49.33,
				},
			},
			["ooze covered thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 99.14,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 16.77,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 6.27,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 7.7,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.11,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 94.61,
				},
			},
			["troll chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.79,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.82,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.84,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 6.9,
				},
			},
			["filon d'argent couvert de limon"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.06,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.14,
				},
			},
			["aveuglette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 28.13,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 88.72,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.95,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 39.06,
				},
			},
			["goldener sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.36,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 27.73,
				},
			},
			["kleines thoriumvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 40.33,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 90.67,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 9.32,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 9.720000000000001,
				},
			},
			["塔文布莱德将军的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.13,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 84.24,
				},
			},
			["caisse du bidulium"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.06,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.46,
				},
			},
			["barrel of melon juice"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.75,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 75.5,
				},
			},
			["Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 4.41,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 36.29,
				},
			},
			["robuste truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 28.36,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 64.11,
				},
			},
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.02,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 45.89,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 30.47,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 20.27,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.7,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 32.9,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.04,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 41.28,
				},
			},
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 96.2,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 81.40000000000001,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 80.81,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 41.33,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 19.03,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 40.93,
				},
			},
			["fass mit milch"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 78.38,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 85.31,
				},
			},
		},
		[14] = {
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.6,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 80.95,
				},
			},
			["feuillargent"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 37.64,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 36.69,
				},
			},
			["chest of the sky"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.63,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 62.44,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.96,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 39.08,
				},
			},
			["Оружейный ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.39,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.21,
				},
			},
			["Косяк загадочной рыбы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.48,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 40.36,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.90000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.7,
				},
			},
			["school of fish"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.3,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 43.99,
				},
			},
			["green power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 97.66,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 70.95,
				},
			},
			["fleur de peste"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.47,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 52.75,
				},
			},
			["Ящик с оружием"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.75,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 19.66,
				},
			},
			["goldvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.29,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 64.79000000000001,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 37.36,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 61.28,
				},
			},
			["Желтый кристалл силы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 73.83,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 53.35,
				},
			},
			["lotus noir"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 96.39,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 41.93,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.12,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 62.82,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 26.67,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 64.40000000000001,
				},
			},
			["mossy footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 11.73,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 87.29000000000001,
				},
			},
			["Покрытые слизью залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 47.93,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 81.04000000000001,
				},
			},
			["Затопленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.66,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.77,
				},
			},
			["荆棘藻"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.88,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 78.75,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.19,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 50.88,
				},
			},
			["humus d'Un'Goro"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 71.56,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 75.98,
				},
			},
			["beulengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.72,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 84.54000000000001,
				},
			},
			["mithrilablagerung"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 30.91,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 63.51,
				},
			},
			[" silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 73.31,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 61.32,
				},
			},
			["school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.33,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 71.26000000000001,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 50.63,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 36.6,
				},
			},
			["sansam doré"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.25,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 92.73,
				},
			},
			["or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 8.380000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 44.12,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 90.81,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 70.84,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 99.68000000000001,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 88.2,
				},
			},
			["Малая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.77,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 21.77,
				},
			},
			["ooze covered rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 19.68,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 65.52,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 73.39,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 85.7,
				},
			},
			["gisement de mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.82,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 66.76000000000001,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.2,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 48.7,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 84.5,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 29.05,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 73.45,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 10.22,
				},
				[3] = {
					["gtype"] = 0,
					["x"] = 87.22,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 27.88,
				},
			},
			["Побитый сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 84.23,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 84.14,
				},
			},
			["冰盖草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.15,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 78,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.73,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 47.98,
				},
			},
			["weapon crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.46,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 30.95,
				},
			},
			["gizmorium shipping crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.06,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.38,
				},
			},
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 90.05,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 60.53,
				},
			},
			["Могильный мох"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.03,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 81.26000000000001,
				},
			},
			["aciérite sauvage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.7,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 57.3,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 25.78,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 81.19,
				},
			},
			["cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.47,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 38.25,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 58.72,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 34.56,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.65,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 67.51000000000001,
				},
			},
		},
		[15] = {
			["del deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38.22,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 77.44,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.66,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 16.05,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.93,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 38.59,
				},
			},
			["ooze covered mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.63,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 10.91,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 53.28,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 16.04,
				},
			},
			["Оскверненный песнецвет"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 75.95,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 32.82,
				},
			},
			["Оружейный ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.42,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.17,
				},
			},
			["Косяк загадочной рыбы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.48,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 40.36,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 46.31,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 40.21,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 13.6,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 3.99,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 20.61,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 90.68000000000001,
				},
			},
			["Ящик с отверстиями"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.31,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 37.61,
				},
			},
			["green power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 6.61,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 41.42,
				},
			},
			["Косяк шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.47,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 38.84,
				},
			},
			["echtsilbervorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 37.69,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.96,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.37,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 12.67,
				},
			},
			["Побитый сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 27.68,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 4.19,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.82,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 12.57,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 19.23,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 49.61,
				},
			},
			["密封的补给箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.71,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 48.15,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 17.89,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 39.43,
				},
			},
			["mossy footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.54,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 13.95,
				},
			},
			["gallywix's lockbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 80.2,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 89.39,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 18.22,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 29.24,
				},
			},
			[" Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.54,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 53.63,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.07,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 33.92,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 54.51,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 47.12,
				},
			},
			["Ящик c пометкой \"Лавка Дриззлика\""] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.61,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 49.64,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.28,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 50.48,
				},
			},
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 8.33,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 26.78,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 62.03,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 39,
				},
			},
			["Ящики с припасами для Перекрестка"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.32,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 24.83,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.38,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 10.18,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 45.41,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 51.6,
				},
			},
			["Ящик с документами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.78,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 39.9,
				},
			},
			["Зеленый кристалл силы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 66.06,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 21.1,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.61,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 78.67,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 58.35,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 87.61,
				},
			},
			[" 食人妖的箱子 "] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.48,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 34.7,
				},
			},
			["ooze covered thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 15.77,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 46.33,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.14,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 45.78,
				},
			},
			["食品箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.71,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 48.06,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.64,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 95.06,
				},
			},
			["瑟银矿脉"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 37.76,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 31.9,
				},
			},
			["pétale de sang sprout"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.93,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 31.26,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.7,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 44.2,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 52.61,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 78.91,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.56,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 90.77,
				},
			},
			["floadelg wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 72.89,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 44.43,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.17,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 0.3,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.99,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 53.21,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 12.83,
				},
			},
			["Странный денежный ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.63,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 8.26,
				},
			},
			["grave moss"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.98,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 58.23,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 48.79,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 58.01,
				},
			},
			["wildstahlblume"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.16,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 57.41,
				},
			},
			["Сейф Галливикса"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.76,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 5.56,
				},
			},
			["Могильный мох"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 7.85,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 44.71,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 24.17,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 6.33,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.61,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 54.21,
				},
			},
			["Краденый железный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.04,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 26.6,
				},
			},
			[" small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.23,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 23.34,
				},
			},
			["Затопленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.64,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.77,
				},
			},
		},
		[16] = {
			["软泥覆盖的真银矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 72.97,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 65.09,
				},
			},
			["karnitol's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.07,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 30.5,
				},
			},
			["秘银矿床"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 51.56,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 24.84,
				},
			},
			["chest of the sky"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.74,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 62.4,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.2,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 58.4,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 55.53,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 56.73,
				},
			},
			["un'Goro erde"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.88,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 53.18,
				},
			},
			["echtsilberablagerung"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.96,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.91,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.81,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 59.39,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 47.73,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 33.43,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 44.69,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 39.3,
				},
				[4] = {
					["gtype"] = 1,
					["x"] = 47.03,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 41.38,
				},
				[5] = {
					["gtype"] = 1,
					["x"] = 48.03,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 45.19,
				},
				[6] = {
					["gtype"] = 1,
					["x"] = 44.33,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 48.68,
				},
				[7] = {
					["gtype"] = 1,
					["x"] = 45.07,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 53.78,
				},
				[8] = {
					["gtype"] = 1,
					["x"] = 41.08,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 56.28,
				},
				[9] = {
					["gtype"] = 1,
					["x"] = 38.32,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 79.45999999999999,
				},
				[10] = {
					["gtype"] = 1,
					["x"] = 51.08,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 67.06,
				},
				[11] = {
					["gtype"] = 1,
					["x"] = 50.28,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 73.8,
				},
				[12] = {
					["gtype"] = 1,
					["x"] = 51.7,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 73.02,
				},
				[13] = {
					["gtype"] = 1,
					["x"] = 58.77,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 74.31999999999999,
				},
				[14] = {
					["gtype"] = 1,
					["x"] = 40.35,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 63.27,
				},
				[15] = {
					["gtype"] = 1,
					["x"] = 37.1,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 66.01000000000001,
				},
				[16] = {
					["gtype"] = 1,
					["x"] = 38.67,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 68.95999999999999,
				},
			},
			["goldvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.64,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 14.81,
				},
			},
			["chest of nesting"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.4,
					["count"] = 3,
					["icon"] = 2,
					["y"] = 60.57,
				},
			},
			[" Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.71,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 63.76,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.53,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 24.55,
				},
			},
			["银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.93,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 58.17,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 81.56,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 44.76,
				},
			},
			["Плавающие обломки"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 67.47,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 20.78,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.71,
					["count"] = 2,
					["icon"] = 1,
					["y"] = 61.29,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 63.66,
					["count"] = 3,
					["icon"] = 1,
					["y"] = 63.63,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 67.03,
					["count"] = 2,
					["icon"] = 1,
					["y"] = 59.67,
				},
				[4] = {
					["gtype"] = 1,
					["x"] = 60.59,
					["count"] = 2,
					["icon"] = 1,
					["y"] = 54.02,
				},
				[5] = {
					["gtype"] = 1,
					["x"] = 57.51,
					["count"] = 5,
					["icon"] = 1,
					["y"] = 64.86,
				},
				[6] = {
					["gtype"] = 1,
					["x"] = 52.53,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 73.77,
				},
				[7] = {
					["gtype"] = 1,
					["x"] = 45.19,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 75.91,
				},
				[8] = {
					["gtype"] = 1,
					["x"] = 41.16,
					["count"] = 2,
					["icon"] = 1,
					["y"] = 48.44,
				},
				[9] = {
					["gtype"] = 1,
					["x"] = 41.72,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 44.65,
				},
				[10] = {
					["gtype"] = 1,
					["x"] = 43.76,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 45.87,
				},
				[11] = {
					["gtype"] = 1,
					["x"] = 57.59,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 70.55,
				},
				[12] = {
					["gtype"] = 1,
					["x"] = 65.52,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 51.83,
				},
				[13] = {
					["gtype"] = 1,
					["x"] = 44.98,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 31.51,
				},
				[14] = {
					["gtype"] = 1,
					["x"] = 46.03,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 41,
				},
				[15] = {
					["gtype"] = 1,
					["x"] = 44.21,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 39.39,
				},
				[16] = {
					["gtype"] = 1,
					["x"] = 46.49,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 45.84,
				},
				[17] = {
					["gtype"] = 1,
					["x"] = 40.08,
					["count"] = 3,
					["icon"] = 1,
					["y"] = 69.11,
				},
				[18] = {
					["gtype"] = 1,
					["x"] = 41.19,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 78.91,
				},
				[19] = {
					["gtype"] = 1,
					["x"] = 49.65,
					["count"] = 3,
					["icon"] = 1,
					["y"] = 68.18000000000001,
				},
				[20] = {
					["gtype"] = 1,
					["x"] = 69.56999999999999,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 58.76,
				},
				[21] = {
					["gtype"] = 1,
					["x"] = 67.66,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 61.79,
				},
				[22] = {
					["gtype"] = 1,
					["x"] = 61.78,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 61.26,
				},
				[23] = {
					["gtype"] = 1,
					["x"] = 60.14,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 61.29,
				},
				[24] = {
					["gtype"] = 1,
					["x"] = 61.01,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 58.15,
				},
				[25] = {
					["gtype"] = 1,
					["x"] = 60.84,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 55.12,
				},
				[26] = {
					["gtype"] = 1,
					["x"] = 55.3,
					["count"] = 2,
					["icon"] = 1,
					["y"] = 66.76000000000001,
				},
				[27] = {
					["gtype"] = 1,
					["x"] = 56.01,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 71.94,
				},
				[28] = {
					["gtype"] = 1,
					["x"] = 63.14,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 71.51000000000001,
				},
				[29] = {
					["gtype"] = 1,
					["x"] = 40.54,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 60.33,
				},
				[30] = {
					["gtype"] = 1,
					["x"] = 38.64,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 67.12000000000001,
				},
			},
			[" crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.64,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 36.47,
				},
			},
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.48,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 81.08,
				},
			},
			["Сундук Небес"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.61,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 62.45,
				},
			},
			["Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.82,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 12.57,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 58.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 27.05,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.66,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 30.55,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 75.33,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 46.08,
				},
			},
			["yellow power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 94.78,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 98.29000000000001,
				},
			},
			["brühschlammbedecktes silbervorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.2,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.19,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.62000000000001,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 49.16,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.6,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 10.43,
				},
			},
			["Косяк огнеперого луциана"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.58,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 23,
				},
			},
			[" Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.62000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 42.15,
				},
			},
			["食人妖的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.84,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 33.54,
				},
			},
			["Горный серебряный шалфей"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 18.35,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 30.91,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.53,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 16.32,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 67.37000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 19.35,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 5.55,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 42.07,
				},
			},
			["wildstahlblume"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 80.66,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 90.56,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 18.55,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 31.6,
				},
			},
			["Росток кровоцвета"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 28.75,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 25.75,
				},
			},
			["Ящик с оружием"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.33,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.18,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.06,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 64.98,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 52.04,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 69.26000000000001,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 39.61,
					["count"] = 2,
					["icon"] = 2,
					["y"] = 61.93,
				},
				[4] = {
					["gtype"] = 1,
					["x"] = 40.8,
					["count"] = 2,
					["icon"] = 2,
					["y"] = 46.48,
				},
				[5] = {
					["gtype"] = 1,
					["x"] = 35.28,
					["count"] = 2,
					["icon"] = 2,
					["y"] = 31.67,
				},
				[6] = {
					["gtype"] = 1,
					["x"] = 62.78,
					["count"] = 4,
					["icon"] = 2,
					["y"] = 67.84,
				},
				[7] = {
					["gtype"] = 1,
					["x"] = 55.33,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 72.56,
				},
				[8] = {
					["gtype"] = 1,
					["x"] = 54.63,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 72.7,
				},
				[9] = {
					["gtype"] = 1,
					["x"] = 46.53,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 39.69,
				},
				[10] = {
					["gtype"] = 1,
					["x"] = 43.46,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 39.01,
				},
				[11] = {
					["gtype"] = 1,
					["x"] = 39.09,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 80.34999999999999,
				},
				[12] = {
					["gtype"] = 1,
					["x"] = 56.49,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 54.69,
				},
				[13] = {
					["gtype"] = 1,
					["x"] = 62.61,
					["count"] = 2,
					["icon"] = 2,
					["y"] = 64.29000000000001,
				},
				[14] = {
					["gtype"] = 1,
					["x"] = 65.49,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 61.39,
				},
				[15] = {
					["gtype"] = 1,
					["x"] = 67.55,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 58.12,
				},
				[16] = {
					["gtype"] = 1,
					["x"] = 68.8,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 61.63,
				},
				[17] = {
					["gtype"] = 1,
					["x"] = 61.13,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 62.26,
				},
				[18] = {
					["gtype"] = 1,
					["x"] = 49.39,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 73,
				},
				[19] = {
					["gtype"] = 1,
					["x"] = 56.39,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 74.14,
				},
				[20] = {
					["gtype"] = 1,
					["x"] = 56.04,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 76.92,
				},
				[21] = {
					["gtype"] = 1,
					["x"] = 57.79,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 77.23,
				},
				[22] = {
					["gtype"] = 1,
					["x"] = 62.64,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 73.7,
				},
				[23] = {
					["gtype"] = 1,
					["x"] = 38.57,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 65.01000000000001,
				},
				[24] = {
					["gtype"] = 1,
					["x"] = 43.44,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 71.08,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.87,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 90.87000000000001,
				},
			},
			["blutblütensprössling"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.58,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 35.04,
				},
			},
			["紫莲花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.92,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 14.06,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 88.83,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 9.74,
				},
			},
			["黄金参"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.40000000000001,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 37.84,
				},
			},
			["秘银矿脉"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.36,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 59.85,
				},
			},
			["blindkraut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.08,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 18.72,
				},
			},
			["Затопленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.46,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.94,
				},
			},
			["软泥覆盖的瑟银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 71.81,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 63.74,
				},
			},
			["ghost mushroom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.4,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 57.9,
				},
			},
			["kupfervorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 19.25,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 32.19,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 30.42,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 74.15000000000001,
				},
			},
			["dokumententruhe #1"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.27,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 41.51,
				},
			},
			["卡德加的胡须"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.48,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 21.41,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 31.63,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 51.46,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.54,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 66.23,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 38.77,
					["count"] = 1,
					["icon"] = 4,
					["y"] = 61.5,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 65.28,
					["count"] = 1,
					["icon"] = 4,
					["y"] = 63.99,
				},
			},
			["ooze covered silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.55,
					["count"] = 0,
					["icon"] = 0,
					["y"] = 12.78,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.43,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 21.27,
				},
			},
			["bloodpetal sprout"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.6,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 17.01,
				},
			},
			["blue power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 5.8,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 45.57,
				},
			},
			["活根草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.04,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 23.15,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.06,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 1.58,
				},
			},
			["chest of the black feather"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.73,
					["count"] = 4,
					["icon"] = 2,
					["y"] = 61.21,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.99,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 5.93,
				},
			},
			["del deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.67,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 21.01,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 61.31,
				},
			},
			["Ящик c пометкой \"Лавка Дриззлика\""] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.61,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 49.64,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.63,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 76.7,
				},
			},
			["chest of the raven claw"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.6,
					["count"] = 2,
					["icon"] = 2,
					["y"] = 57.37,
				},
			},
			["un'goro soil"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.18,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 44.06,
				},
			},
			["silberblatt"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.12,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 9.220000000000001,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 42.3,
				},
			},
			["eiskappe"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.54,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 30.17,
				},
			},
			["marvons truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.5,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 38.49,
				},
			},
		},
		[17] = {
			["cristal de puissance vert"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 97.66,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 70.95,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 10.29,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 36.64,
				},
			},
			[" tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.89,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 25.04,
				},
			},
			["school of fish"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.61,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 54.25,
				},
			},
			["stolen iron chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.04,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 26.58,
				},
			},
			["铜矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.5,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 19.6,
				},
			},
			["doulourante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.93,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 15.21,
				},
			},
			["Сейф буканьера"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 65.03,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 45.48,
				},
			},
			[" Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.54,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 53.63,
				},
			},
			["coffre endommagé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.24,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 11.84,
				},
			},
			["damaged chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.45,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.61,
				},
			},
			["ornate chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.93,
				},
			},
			["十字路口的补给箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.36,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 24.73,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.75,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.68,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 52.47,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 11.57,
				},
				[3] = {
					["gtype"] = 0,
					["x"] = 43.7,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 21.19,
				},
			},
			[" Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.89,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 35.88,
				},
			},
			["Ледяной зев"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 89.20999999999999,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 10.7,
				},
			},
			["thorium (riche)"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 80.77,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 64.22,
				},
			},
			["truhe der rabenkralle"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.64,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 57.38,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.58,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 91.45999999999999,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 74.98,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 67.73,
				},
			},
			["filon d'étain"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 55.32,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 42.92,
				},
			},
			["Косяк огнеперого луциана"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 99.58,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 93.52,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.52,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 50.39,
				},
			},
			["魔皇草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.02,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 29.07,
				},
			},
			["Горный серебряный шалфей"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 31.67,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 45.12,
				},
			},
			["mage royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.56,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 40.72,
				},
			},
			["truhe des nistens"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.39,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 60.64,
				},
			},
			["Черный лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 25.86,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 10.49,
				},
			},
			["alliance chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.32,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 56.62,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.38,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.96,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 57.6,
				},
			},
			["oil spill"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.73,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 0.5600000000000001,
				},
			},
			["ooze covered gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.72,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 35.81,
				},
			},
			["Затопленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.46,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.95,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.62,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 74.45,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.79,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 31.79,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.14,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 62.29,
				},
			},
			["sonnengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.79,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 23.35,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 80.56,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 10.5,
				},
			},
			["Гигантский моллюск"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.58,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 54.15,
				},
			},
			["mountain delsage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.02,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 29.4,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 43.84,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 27.46,
				},
			},
			["armor crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.43000000000001,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.23,
				},
			},
			["格罗姆之血"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 82.41,
				},
			},
			["破损的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.3,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.2,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.06,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 76.78,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 10.89,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 93.33,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.15,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 40.49,
				},
			},
			["ooze covered silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.55,
					["count"] = 0,
					["icon"] = 0,
					["y"] = 12.78,
				},
			},
			["aveuglette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 28.13,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 88.72,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 48.27,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 32.63,
				},
			},
			["Очищенный песнецвет"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.29,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 52.2,
				},
			},
			["皇血草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.06,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 53.24,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.85,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 51.37,
				},
			},
			["cleansed windblossom"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.16,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 23.43,
				},
			},
			["Чумоцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.82,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 18.64,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.42,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 13.95,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.94,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 36.64,
				},
			},
			[" copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 47.21,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 54.43,
				},
			},
			["Оскверненный Ночной дракон"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.72,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 78.26000000000001,
				},
			},
			["zinnvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 21.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 26.02,
				},
			},
			["mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 92.52,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 52.65,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.04000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 42.83,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 65.61,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 93.12000000000001,
				},
			},
			["gisement de mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 15.82,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 88.36,
				},
			},
			["fass mit milch"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 78.38,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 85.31,
				},
			},
		},
		[18] = {
			["bloodpetal sprout"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.43,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 83.39,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 51.5,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 43.3,
				},
			},
			["Плавающий мусор"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 48.68,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 20.27,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.92,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 47.22,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.98,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 62.61,
				},
			},
			["Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 31.82,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 99.74,
				},
			},
			["vorratskisten des wegekreuzes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 58.52,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 27.25,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.11,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 27.28,
				},
			},
			["caisse de nourriture"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.53,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 36.43,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 79.88,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 18.73,
				},
			},
			["firebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.22,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 96.59,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.54,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 55.82,
				},
			},
			["Сейф буканьера"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.94,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 92.67,
				},
			},
			["Ящик с блеснами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.15,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.65,
				},
			},
			["red power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 42.75,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 92.06,
				},
			},
			["coffre endommagé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.56,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 35.15,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 83.81999999999999,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 16.35,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 71.59,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 43.96,
				},
			},
			["Ледяной зев"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 96.53,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 35.36,
				},
			},
			["  Сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.12,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 37.03,
				},
			},
			["traumblatt"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.81,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 50.1,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 48.68,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 20.27,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.99,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 88.84999999999999,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 36.61,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 97.14,
				},
			},
			["阿尔萨斯之泪"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.27,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 87.28,
				},
			},
			["Горный серебряный шалфей"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 83.41,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 33.95,
				},
			},
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 4.12,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 96.87000000000001,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 99.58,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 93.52,
				},
			},
			["gesäuberte liedblume"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.65,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 30.68,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 17.57,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 76.92,
				},
			},
			["del"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 24.47,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 40.4,
				},
			},
			["terrestrine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.09,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.89,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 94.19,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 33.53,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.46,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 72.26000000000001,
				},
			},
			["Ящик с оружием"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.74,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 19.66,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.01,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 27.04,
				},
			},
			["黄金参"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.8,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 17.48,
				},
			},
			["Ящик с пометкой \"Хрупкое! Не ронять!\""] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.54,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 49.18,
				},
			},
			["Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.11,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 41.34,
				},
			},
			["cristal de puissance bleu"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.15,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 60.61,
				},
			},
			["Ящик с документами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.79,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 32.61,
				},
			},
			["cristal de puissance"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 69.48,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 79.92,
				},
			},
			["gesäuberter nachtdrache"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.72,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 78.17,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 83,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 55.22,
				},
			},
			["Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.90000000000001,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 35.11,
				},
			},
			["ooze covered thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 10.97,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 81.18000000000001,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.25,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 15.95,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.95,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 35.68,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.55,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 12.32,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 99.58,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 93.52,
				},
			},
			["ooze covered silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.06,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.16,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.54,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 97.95,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 7.72,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 83.62000000000001,
				},
			},
			["navetille"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.75,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 80.36,
				},
			},
			["feuillerêve"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.38,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 65.84,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 24.67,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 97.78,
				},
			},
			["aciérite sauvage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 12.01,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 11.32,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.09,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 98.37000000000001,
				},
			},
			["被腐化的轻歌花"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.34,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 52.21,
				},
			},
			["Гнилой кнутокорень"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.75,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 80.36,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.1,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 52.01,
				},
			},
			["Косяк шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.53,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 42.31,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38.38,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 30.83,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 18.82,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 87.76000000000001,
				},
			},
			["Желтый кристалл силы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.17,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 20.34,
				},
			},
			["larmes d'arthas"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.36,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 86.47,
				},
			},
			["Денежный ящик Серебряной Зари"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.22,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 28.82,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.22,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 33.29,
				},
			},
			["document chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.76,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 39.89,
				},
			},
		},
		[19] = {
			["bloodpetal sprout"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.52,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 81.12000000000001,
				},
			},
			["geisterpilz"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.2,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 54.09,
				},
			},
			["Плавающий мусор"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.73,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 38.69,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 40.63,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 0.24,
				},
			},
			["chest of the black feather"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.7,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 61.18,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.99,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 46.43,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 28.95,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 88.65000000000001,
				},
			},
			["songflower serenade"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.13,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 56.6,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.45,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 19.13,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 0.91,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 3.92,
				},
			},
			["etouffante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.02,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.4,
				},
			},
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.94,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 19.21,
				},
			},
			[" Покрытая слизью серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.06,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.22,
				},
			},
			["迷雾之纱号的保险箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.64,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 27.44,
				},
			},
			["Ящик с документами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.78,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 39.89,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 28.72,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 85.61,
				},
			},
			["yellow power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 11.9,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 20.23,
				},
			},
			["sansam doré"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 7.05,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 17.85,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 62.83,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 45.68,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 43.84,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 39.79,
				},
			},
			[" Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.63,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 65.5,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.02,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 40.17,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.71,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 81.31,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.25,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 15.95,
				},
			},
			["Поврежденный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.49,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.63,
				},
			},
			["purple lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.13,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 97.31,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 33.9,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 52.03,
				},
			},
			["Косяк огнеперого луциана"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.98,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 70.14,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 5.57,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 14.79,
				},
			},
			["Покрытая слизью серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.06,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.09999999999999,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 73.16,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 7.96,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 79.88,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 18.73,
				},
			},
			["Горный серебряный шалфей"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 10.97,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 80.81,
				},
			},
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 17.43,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 31.98,
				},
			},
			["cleansed songflower"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 60.51,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 36.51,
				},
			},
			["ooze covered argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.55,
					["count"] = 0,
					["icon"] = 0,
					["y"] = 12.78,
				},
			},
			["del"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.94,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 24.3,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.42,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 52.09,
				},
			},
			["green power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 14.92,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 86.2,
				},
			},
			["Ящик с оружием"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 77.84,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 74.37000000000001,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.03,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 15.95,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 18.21,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 76.89,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.58,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 60.8,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 43.4,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 51.37,
				},
			},
			["玛雷姆的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.84,
				},
			},
			["野钢花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.9,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 29.67,
				},
			},
			["跌打草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.75,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 22.09,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 31.66,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 45.15,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 41.03,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 57.15,
				},
			},
			["cleansed windblossom"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.16,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 23.43,
				},
			},
			["Ящик с гномскими инструментами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.76,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 45.88,
				},
			},
			["traumblatt"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.26,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 43.07,
				},
			},
			["eisenvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 58.85,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 65.7,
				},
			},
			["wintersbite"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.94,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 76.8,
				},
			},
			["mountain delsage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.95,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 36.5,
				},
			},
			["cristal de puissance rouge"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.73,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 38.75,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 67.44,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 24.91,
				},
			},
			["Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.9,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 97.98,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 10.96,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 36.17,
				},
			},
			["troll chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.94,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.65,
				},
			},
			["风花果"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.34,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 12.18,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 90.87000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 60.92,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.16,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 40.85,
				},
			},
			[" Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.27,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 63.66,
				},
			},
			["gisement de mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.07,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 69.01000000000001,
				},
			},
			["gallywix's lockbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 80.2,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 89.39,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.08,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 55.24,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 39.22,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 32.86,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 83.73,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 52.62,
				},
			},
			["Чумоцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.31,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 50.43,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 17.57,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 50.04,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 99.58,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 93.52,
				},
			},
			["débris flottant"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 67.34,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 19.07,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 66.51000000000001,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 18.48,
				},
			},
			["Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.99,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 88.84999999999999,
				},
			},
			["Покрытые слизью мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 69.45,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 88.55,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.22,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 17.39,
				},
			},
			["Кровь Грома"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.91,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 70.67,
				},
			},
			["Денежный ящик Серебряной Зари"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.22,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 28.81,
				},
			},
			["thorium (riche)"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 14.12,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 30.85,
				},
			},
			[" Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 58.53,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 54.92,
				},
			},
		},
		[20] = {
			["Призрачная поганка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.13,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 54.07,
				},
			},
			["corrupted whipper root"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.6,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 44.27,
				},
			},
			["cristal de puissance vert"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 74.93000000000001,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 70.52,
				},
			},
			["Черный лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 86.52,
				},
			},
			["buccaneer's strongbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.97,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 92.59,
				},
			},
			["Плавающий мусор"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.67,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 96.92,
				},
			},
			["terrestrine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.26,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 73.78,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 44.32,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 48.66,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 88.83,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 9.74,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 80.06,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 77.77,
				},
			},
			["Стайка каменного угря"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.79,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 36.26,
				},
			},
			["Красный кристалл силы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 91.58,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 85.40000000000001,
				},
			},
			["calot de glace"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.3,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 44.4,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 95.79000000000001,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 56.4,
				},
			},
			["Покрытые слизью мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 73.56,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 64.89,
				},
			},
			["caisse d'armes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.45,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 30.98,
				},
			},
			["firebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 97.70999999999999,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 45.05,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.58,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 6.31,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 88.83,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 9.74,
				},
			},
			["floating debris"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.25,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 36.84,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 81.56,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 44.76,
				},
			},
			["doulourante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.43,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 57.19,
				},
			},
			["power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 70.01000000000001,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 77.11,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.11,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 50.9,
				},
			},
			["un'goro soil"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.05,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 17.55,
				},
			},
			["coffre de la griffe du corbeau"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.65,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 57.46,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.45,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 14.34,
				},
			},
			["Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.09,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 92.48,
				},
			},
			["gallywix's lockbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.22,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 16.2,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 94.45999999999999,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 55.15,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 93.74,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 0.22,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.3,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 23.23,
				},
			},
			["Оскверненный песнецвет"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.35,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 52.17,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 90.14,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.27,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 81.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 94.51000000000001,
				},
				[3] = {
					["gtype"] = 2,
					["x"] = 85.74,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 91.8,
				},
			},
			["mithrilablagerung"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 62.64,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 18.28,
				},
			},
			["königsblut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.77,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 77.81,
				},
			},
			["yellow power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.09,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 67.02,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.67,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 12.32,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 81.5,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 4.54,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.77,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 21.66,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 97.66,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 58.47,
				},
			},
			[" ooze covered truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 45.3,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 87.74,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 55.33,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 35.15,
				},
			},
			["ooze covered rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 6.41,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 68.63,
				},
			},
			["del"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.01,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 16.45,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.83,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 85.43000000000001,
				},
			},
			["Обломки в воде"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.11,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 35.27,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.77,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 74.93000000000001,
				},
			},
			["Blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.66,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 22.55,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.15,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 0.14,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 42.81,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 13.9,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.82,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 67.22,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 65.39,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 26.89,
				},
			},
			["coffre de karnitol"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.09,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 30.47,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.51,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 54.03,
				},
			},
			["宁神花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.79,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 18.67,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.75,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 34.47,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 30.62,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 62.92,
				},
			},
			["crate of elunite"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.08,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.56,
				},
			},
			[" small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.88,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 17.6,
				},
			},
			["gromsang"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.72,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 73.93000000000001,
				},
			},
		},
		[21] = {
			["corrupted whipper root"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 7.28,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 67.61,
				},
			},
			["gromsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 10.64,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 42.51,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 3.81,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 69.37000000000001,
				},
			},
			["Ящик c пометкой \"Лавка Дриззлика\""] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.64,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 49.66,
				},
			},
			["sauge-argent des montagnes"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.05,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 18.6,
				},
			},
			["echtsilberablagerung"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 61.64,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 75.17,
				},
			},
			["Участок первородной воды"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 66.3,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 68.5,
				},
			},
			["corrupted windblossom"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 8.69,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 63.38,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 40.06,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 37.26,
				},
			},
			["石南草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.38,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 87.29000000000001,
				},
			},
			["corrupted songflower"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 24.18,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 34.51,
				},
			},
			["stonescale eel swarm"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.79,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 70.45,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.43000000000001,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 96.98,
				},
			},
			[" Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.42,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 25.99,
				},
			},
			["etouffante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.02,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.4,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.52,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 30.61,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.11,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 38.24,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.70999999999999,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 85.31,
				},
			},
			["Тролльский сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.92,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 33.03,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 40.44,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 34.34,
				},
				[3] = {
					["gtype"] = 0,
					["x"] = 40.82,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.82,
				},
				[4] = {
					["gtype"] = 0,
					["x"] = 40.93,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.62,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.78,
				},
			},
			["富瑟银矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.58,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 37.39,
				},
			},
			["奇怪的带锁箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 48.84,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 11.32,
				},
			},
			[" Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.47,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 50.67,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.2,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 71.25,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 19.72,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 17.03,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.98,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 45.44,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 82.08,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 15.56,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 33.46,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 40.7,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.59,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 34.08,
				},
			},
			["purple lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.05,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 98.14,
				},
			},
			["Кровь Грома"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.06,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 70.22,
				},
			},
			["Стая рыбы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.74,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 52.95,
				},
			},
			["Покрытая слизью серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.11,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.14,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 79.2,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 62.3,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.51,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 13.9,
				},
			},
			["ooze covered mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 78.91,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 62.83,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.86,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 36.51,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.77,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 44.77,
				},
			},
			["Огнецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.25,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 42.5,
				},
			},
			["Стайка каменного угря"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 48.65,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 51.13,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.06,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 61.31,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 54.45,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 44.26,
				},
			},
			["robuste truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.07,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 36.75,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 55.83,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 44.65,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.19,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 92.67,
				},
			},
			["oil spill"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 29.47,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 82.88,
				},
			},
			["Замшелый сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 82.53,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 30.71,
				},
			},
			["Куча земли Ун'Горо"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.16,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 17.61,
				},
			},
			["friedensblume"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.35,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 14.02,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 42.95,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 62.81,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.2,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 40.48,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 33.59,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 42.86,
				},
			},
			["  Сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.27,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 34.2,
				},
			},
			["thorium (riche)"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 24.91,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 14.28,
				},
			},
			["riche filon de thorium"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.44,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 77.62000000000001,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 40.73,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.27,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.7,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 64.68000000000001,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 13.94,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 28.29,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 12.86,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.9,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.44,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 59.38,
				},
			},
			["地根草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.92,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 83.7,
				},
			},
			["Зеленый кристалл силы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 66.06,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 21.1,
				},
			},
			["食品箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.89,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 83.66,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 0.24,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 97.29000000000001,
				},
			},
			["铜矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.06,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 27.89,
				},
			},
			["ooze covered silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 63.74,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 86.38,
				},
			},
			["document chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.77,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 39.86,
				},
			},
			[" Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 45.19,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 69.59,
				},
			},
			["Покрытая слизью золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.73,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 74.19,
				},
			},
			["kleines thoriumvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 52.34,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 7.6,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.26,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 93.14,
				},
			},
			["Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 0.62,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 98.39,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 21.26,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 48.16,
				},
			},
			["coffre de malem"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.57,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.89,
				},
			},
			["Покрытые слизью мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 69.28,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 82.78,
				},
			},
			["铠甲箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.88,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 29.37,
				},
			},
			["Черный лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.64,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 2.17,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.93,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 36.4,
				},
			},
			["maguskönigskraut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.55,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 51.01,
				},
			},
			["Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 17.55,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 72.31,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 40.45,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 44.55,
				},
			},
			["wilddornrose"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.05,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 37.35,
				},
			},
			["fass mit milch"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 78.38,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 85.31,
				},
			},
		},
	},
	[2] = {
		[1] = {
			[" Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 79.56,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 52.93,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.25,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 71.09,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.81,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 16.98,
				},
			},
			["würgetang"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.02,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 65.04000000000001,
				},
			},
			["富瑟银矿 [270]"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.88,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 68.98,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 4.44,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 63.04,
				},
			},
			["winterbiss"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.57,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 68.43000000000001,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 37.86,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 70.7,
				},
			},
			["太阳草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.36,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 40.72,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.94,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 80.08,
				},
			},
			["Обломки в воде"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 29.24,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 37.79,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 83.12000000000001,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 97.65000000000001,
				},
			},
			["pacifique"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.31,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 45.95,
				},
			},
			["石南草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.34,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 73.42,
				},
			},
			["铜矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 24.56,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 80.39,
				},
			},
			["Подержанный деревянный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.21,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 14.67,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.65000000000001,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 1.79,
				},
			},
			["doulourante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.39,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 80.23,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 4.44,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 63.04,
				},
			},
			[" crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.44,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 37.93,
				},
			},
			[" iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 51.1,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 45.73,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.17,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 92.65000000000001,
				},
			},
			["dorépine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 17.01,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 99.67,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 13.6,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 55.36,
				},
			},
			["ghost mushroom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.39,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 40.86,
				},
			},
			["真银矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 75.3,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 49.26,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 53.58,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 46.59,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 38.04,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 71.97,
				},
			},
			["wilddornrose"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 82.34999999999999,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 49.13,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.3,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 40.63,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 37.26,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 48.37,
				},
			},
			["cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.44,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 73.47,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 73.15000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 10.02,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 1.96,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 44.76,
				},
			},
			[" fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.11,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 21.07,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 14.82,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 43.99,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 88.90000000000001,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 2.62,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 89.79000000000001,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 43.35,
				},
			},
			["aciérite sauvage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.01,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 80.27,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.15,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 98.36,
				},
			},
			["echtsilberablagerung"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.45,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.9,
				},
			},
			["coffre des défias"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 23.94,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 71.97,
				},
			},
			["坚固的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 48.73,
				},
			},
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.8,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 41.58,
				},
			},
			["宁神花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.93,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 39.14,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 19.95,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 19.98,
				},
			},
			["wildstahlblume"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.4,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 39.2,
				},
			},
			["  Ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.23,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 71.01000000000001,
				},
			},
			["filon de cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.47,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 78.31,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.35,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 49.74,
				},
			},
			["caisse de ravitaillement de la horde"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.76,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 38.53,
				},
			},
		},
		[2] = {
			["trelane's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.11,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 68.98,
				},
			},
			[" Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.27,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 54.97,
				},
			},
			["feuillargent"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.48,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 96.61,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 1.04,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 97.65000000000001,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 76.42,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 82.29000000000001,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.26,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 0.39,
				},
			},
			["marshal haggard's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.59,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 69.52,
				},
			},
			["alliance chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 22.65,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 63.53,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.5,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 4.43,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 63.72,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 65.2,
				},
			},
			["Побитый сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 42.15,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 31.01,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 41.3,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.29,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.37000000000001,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 67.36,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 69.03,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 66.56,
				},
			},
			["菲利克斯的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 22.77,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 79.97,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.63,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 77.56,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 15.75,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 81.43000000000001,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 16.55,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 47.53,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 43.89,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 30.01,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.39,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 12.71,
				},
			},
			["Ящик с припасами с карьера"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 66.78,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 23.48,
				},
			},
			["raíz de tierra"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.54000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 69.31,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 72.34,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 6.73,
				},
			},
			["beulengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.25,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 30.39,
				},
			},
			["riche filon de thorium"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 72.45,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 27.48,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 12.79,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 82.16,
				},
			},
			["sang-royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.31,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 34.11,
				},
			},
			["Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.66,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 10.76,
				},
			},
			["卡德加的胡须"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.15,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 39.97,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 24.79,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 87.86,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.95,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 20.23,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.67,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 7.27,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 38.14,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 34.17,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.94,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 1.9,
				},
			},
			["trelane's footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.14,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 68.14,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.78,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 0.63,
				},
			},
			[" Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.17,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.03,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38.79,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 37.04,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.59,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 6.24,
				},
			},
			["goldvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 63.38,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 73.91,
				},
			},
			["Разбитый ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.96,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 23.49,
				},
			},
			["purple lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.34,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 38.44,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.73,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 59.25,
				},
			},
			["boîte à outils de bink"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 27.69,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 36.45,
				},
			},
			["Залежи черного железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 78.37000000000001,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 20.57,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 81.56,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 8.109999999999999,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 99.76000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 27.99,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 15.18,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 17.17,
				},
			},
			["  Ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.32,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 68.29000000000001,
				},
			},
			["破损的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 23.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.42,
				},
			},
			["食品箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 48.04,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 20.92,
				},
			},
			["barrel of sweet nectar"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.65,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 39.1,
				},
			},
		},
		[3] = {
			["del vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 39.86,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 73.38,
				},
			},
			["sonnengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.94,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 34.86,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.38,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 36.09,
				},
			},
			["Черный лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 19.44,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 94.97,
				},
			},
			["del of sweet nectar"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.04,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 47.91,
				},
			},
			[" silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 45.03,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 42.11,
				},
			},
			["wildstahlblume"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.03,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 54.32,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.28,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.75,
				},
			},
			["Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 71.06,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 98.06999999999999,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.4,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 43.5,
				},
			},
			["fleur de peste"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.69,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 67.95,
				},
			},
			["Ящик Орды с припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.46,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 43.55,
				},
			},
			["goldvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.44,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 39.19,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.4,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 5.81,
				},
			},
			["锡矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.21,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 81.38,
				},
			},
			["coffre endommagé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.97,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 67.45,
				},
			},
			[" gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 49.08,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 28.64,
				},
			},
			["Проломленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.72,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 31.17,
				},
			},
			["跌打草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 19.23,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 57.81,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.23,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 13,
				},
			},
			["floating debris"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.36,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 83.53,
				},
			},
			["horde chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 60.15,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 55.93,
				},
			},
			["dorépine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.52,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 56.05,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.54,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 64.45,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 1.04,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 97.65000000000001,
				},
			},
			[" Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.28,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 27.7,
				},
			},
			["荆棘藻"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.85,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 52.11,
				},
			},
			["金矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.06,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 33.82,
				},
			},
			[" iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 43.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 78.59,
				},
			},
			["box of assorted parts"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.34,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 66.45,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.37,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 33.97,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.3,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 95.93000000000001,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.29,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 19.73,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.12,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 34.94,
				},
			},
			["联盟宝箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.52,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 59.43,
				},
			},
			["sang-royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 77.63,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 88.08,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 22.49,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 73.2,
				},
			},
			["reiches thoriumvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 22,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 66.63,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 25.52,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 66.98,
				},
			},
			["tonneau de lait"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.18,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 25.38,
				},
			},
			["greater sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 71.66,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 86.04000000000001,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.66,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 53.91,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.08,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 41.77,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.86,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 63.92,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.29000000000001,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 52.98,
				},
			},
			["一桶蜂蜜酒"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.86,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 39,
				},
			},
			["银矿脉 [稀有] [75]"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 53.52,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 48.38,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.88,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 54.18,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 49.73,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 33.59,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.32,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 62.56,
				},
			},
			["coffre en morceaux"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 60.21,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 55.93,
				},
			},
			["robuste truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.39,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 66.77,
				},
			},
			["school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 15.33,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 35.5,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 89.18000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 57.4,
				},
			},
			["caisse de nourriture"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.94,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 29.54,
				},
			},
			[" goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.92,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 56.57,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 90.73,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 23.42,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.3,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.29,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.62,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 17.55,
				},
			},
			["boîte de bombes incendiaires"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 83.06,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 69.09,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.7,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 38.06,
				},
			},
			["storage chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.18,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.77,
				},
			},
		},
		[4] = {
			["Горный серебряный шалфей"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.61,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 14.97,
				},
			},
			["Черный лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.42,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 11.07,
				},
			},
			["captain's footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.95,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 47.9,
				},
			},
			["macgranns fleischtruhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.46,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 53.94,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.98,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 92.76000000000001,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.82,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 55.78,
				},
			},
			["banc"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.29,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 56.16,
				},
			},
			["Ящик Орды с припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.46,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 37.96,
				},
			},
			["wintersbite"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.19,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 8.57,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.58,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 18.92,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.47,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 99.17,
				},
			},
			["Косяк большого шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 70.87000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 94.38,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.49,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 5.16,
				},
			},
			["野钢花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.23,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 85.84999999999999,
				},
			},
			["filon de cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 75.76000000000001,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 49,
				},
			},
			[" Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.94,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 27.33,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 87.77,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 8.66,
				},
			},
			["dark iron ore"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 64.40000000000001,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 63.55,
				},
			},
			["vietérule"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.7,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 22.31,
				},
			},
			["Ящики для оборудования"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.11,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 65.58,
				},
			},
			["ramponierte truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.13,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 46.54,
				},
			},
			["sombrefer deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.27,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 26.51,
				},
			},
			["firebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.52,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 48.15,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 74.84,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 16.77,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.98,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 55,
				},
			},
			["Плавающий мусор"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 23.78,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 94.42,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.98,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 27.97,
				},
			},
			["or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 88.69,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 31.03,
				},
			},
			["greater sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.45,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 96.14,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.12,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 50.19,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 5.32,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 6.94,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.36,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 83.53,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.06,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 86.99,
				},
			},
			["goldener sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.72,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 83.16,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 0.34,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 8.93,
				},
			},
			["aciérite sauvage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 71.09,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 56.44,
				},
			},
			["火岩箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 83.12000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 69.01000000000001,
				},
			},
			["Ящик Феликса"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.92,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.02,
				},
			},
			["一箱铁材"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 32.06,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 45.37,
				},
			},
			["silbervorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 64.41,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 25.86,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26.3,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 95.72,
				},
			},
			["ambermill strongbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 9.140000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.26,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.62,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 96.73,
				},
			},
			["Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.19,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 46.25,
				},
			},
			["Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 17.32,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 54.3,
				},
			},
			["坚固的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 32.35,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 72.25,
				},
			},
			[" khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.91,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 50.82,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.32,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 11.52,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 65.37000000000001,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 3.29,
				},
			},
		},
		[5] = {
			["del vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.95,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 25.78,
				},
			},
			["boîte à outils de bink"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 27.68,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 36.4,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.33,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 19.48,
				},
			},
			["Огнецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.6,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 85.34999999999999,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 77.48,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 0.97,
				},
			},
			["Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.04,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 66.93000000000001,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 28.08,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 38.14,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.85,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 96.29000000000001,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 47.61,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 24.93,
				},
			},
			["beulengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 19.44,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 72.03,
				},
			},
			["erdwurzel"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.42,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 81.18000000000001,
				},
			},
			["pacifique"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.48,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 52.5,
				},
			},
			["chest of containment coffers"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.33,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 10.01,
				},
			},
			["Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.96,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 46.07,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 86.84,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 37.36,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.01,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 60.06,
				},
			},
			["barrel of melon juice"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.91,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 73.94,
				},
			},
			["Плавающие обломки"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.07,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 36.95,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.79000000000001,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 0.14,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 42.24,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 62,
				},
			},
			["eglantine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.44,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 74.37000000000001,
				},
			},
			["caisse de nourriture"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.01,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 51.57,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 13.49,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.98,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 38.54,
				},
			},
			["mountain delsage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.81,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 24.43,
				},
			},
			["fass melonensaft"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.26,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 55.55,
				},
			},
			["Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.85,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 51.02,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 8.810000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 4.72,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.02,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 5.93,
				},
			},
			["maguskönigskraut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 73.67,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 92.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 68.15000000000001,
				},
			},
			["königsblut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.45,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 50.18,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.94,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 6.24,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 21.63,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 5.24,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 82.34,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 57.79,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.84,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 39.52,
				},
			},
			["gisement de sombrefer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 84.72,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 48.75,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.59,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 95.19,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 79.08,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 44.09,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 58.27,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 89.28,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.2,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 37.57,
				},
			},
			["grabmoos"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.58,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 44.6,
				},
			},
			["filon d'or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 52.22,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 53.12,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.36,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 83.53,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 83.19,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 37.56,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 91.52,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 25.57,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 52.16,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 53.07,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.36,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 86.77,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 69.63,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 60.04,
				},
			},
			["grave moss"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.78,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 85.51000000000001,
				},
			},
			["Кровь Грома"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.85,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 94.64,
				},
			},
			["mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 62.5,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 84.55,
				},
			},
			["rich thorium vein (275)"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 39.15,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 38.35,
				},
			},
			["瘟疫花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.72,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 76.08,
				},
			},
			[" Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.01,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 54.98,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.87,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 54.73,
				},
			},
		},
		[6] = {
			["Горный серебряный шалфей"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 78.64,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 50.9,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 1.71,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 82.09999999999999,
				},
			},
			["Кровь героев"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.25,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 62.22,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.6,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 36.02,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.73,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 79.81,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.44,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 0.9,
				},
			},
			["filon d'argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.05,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 57.62,
				},
			},
			["Побитый сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.91,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 57.35,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.34,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 30.25,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 79.31,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 63.62,
				},
			},
			["dorépine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 80.39,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 45.15,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.39,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 59.6,
				},
			},
			["锡矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 45.7,
				},
			},
			["Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 71.29000000000001,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 36.72,
				},
			},
			["vietérule"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 31.63,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 33.89,
				},
			},
			["Сундучок Алого ордена"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 87.83,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 86.84,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.03,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 36.25,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 17.43,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 97.90000000000001,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.77,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 26.67,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 22.28,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 46.3,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 2.83,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 76.25,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.26,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 40.72,
				},
			},
			[" 坚固的箱子 "] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.99,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 29.58,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 90.53,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 51.11,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.82,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 89.92,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.06,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 41.66,
				},
			},
			["arena treasure chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 30.43,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 47.75,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 69.19,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 16.94,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 0.52,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 80.65000000000001,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.67,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 19.02,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.14,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 33.43,
				},
			},
			["horde supply crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.29,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 41,
				},
			},
			["trelane's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 68.98,
				},
			},
			["Слезы Артаса"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.72,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 70.72,
				},
			},
			["fleur de feu"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 82.23,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 91.45999999999999,
				},
			},
			["Чумоцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.32,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 77.61,
				},
			},
			[" 破烂的箱子 "] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.7,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 35.74,
				},
			},
			["blassblatt"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.07,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 39.7,
				},
			},
			[" copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 41.86,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 29.49,
				},
			},
			["khadgars schnurrbart"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.11,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 54.42,
				},
			},
			["Могильный мох"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.9,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 85.52,
				},
			},
			["blood of heroes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.73,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 33.21,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 49.11,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 35.32,
				},
			},
			["barrica de agua"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.01,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 51.54,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 69.87000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 21.37,
				},
			},
			["金矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 10.58,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 58.34,
				},
			},
			["storage chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.18,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.8,
				},
			},
		},
		[7] = {
			["del vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 41.22,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 37.86,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 97.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 71.52,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 6.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 2.98,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 77.31,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 52.52,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.98,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 51.52,
				},
			},
			["宁神花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.77,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 60.78,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.58,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 56.15,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 53.33,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 78.77,
				},
			},
			["lila lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.27,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 65.37000000000001,
				},
			},
			["vorratskiste der horde"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.89,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 38.25,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26.3,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 95.72,
				},
			},
			["caisse de nourriture"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.93,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 87.54000000000001,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.01000000000001,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 10.17,
				},
			},
			["echtsilbervorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.77,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 67.59,
				},
			},
			["school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.25,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 17.14,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 97.79000000000001,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 0.7,
				},
			},
			["Проломленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 60.36,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 88.48,
				},
			},
			["sombrefer deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 42.76,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 60.14,
				},
			},
			["heiliger kasten"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.18,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 23.46,
				},
			},
			[" Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.78,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 62.7,
				},
			},
			["friedensblume"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.29,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 49.96,
				},
			},
			["Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.44,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 67.84,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.47,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 92.09999999999999,
				},
			},
			["Странный денежный ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 29.58,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 29.36,
				},
			},
			["feuillargent"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.78,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 81.06,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.5,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 55.32,
				},
			},
			["Ящик со шкатулками-духоловками"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.22,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 10.21,
				},
			},
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.32,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 2.25,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 37.56,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 1.98,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 44.09,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 0.38,
				},
			},
			["felix's del"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.94,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 76.14,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 58.61,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 40.54,
				},
			},
			["Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.82,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 3.06,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 96.83,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 86.92,
				},
			},
			["silberblatt"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.58,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 58.09,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.91,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 46.48,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.06,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 0.24,
				},
			},
			["Ящики Лиги Рудокопов"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.03,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 23.28,
				},
			},
			["blood of heroes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.13,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 35.2,
				},
			},
			["sansam doré"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.52,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 5.96,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 6.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 2.98,
				},
			},
			["dented footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 99.55,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 75.14,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.59,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 0.32,
				},
			},
			["coffre en morceaux"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.48,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 58.4,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 4.18,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 10.02,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.83,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 82.90000000000001,
				},
			},
			[" barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.91,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 46.94,
				},
			},
			[" Призрачная поганка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.44,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 39.86,
				},
			},
			["vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 65.06,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 3.26,
				},
			},
			["食品箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.64,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 68.18000000000001,
				},
			},
			["银叶草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 69.73,
				},
			},
			["purple lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 89.28,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 82.93000000000001,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 42.79,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 51.5,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 86.37000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 0.3,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.64,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 1.97,
				},
			},
			["pestblüte"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.37,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 57.61,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.61,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 30.15,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.04,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 22.79,
				},
			},
			["Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 49.96,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 0.87,
				},
			},
			[" Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.15,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 54.75,
				},
			},
			["Побитый сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.05,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 28.3,
				},
			},
		},
		[8] = {
			["del vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 5.89,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 44.64,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.31,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 9.560000000000001,
				},
			},
			["墓地苔"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 14.49,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 45.88,
				},
			},
			["lebenswurz"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.36,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 13.61,
				},
			},
			["terrestrine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.36,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 27.23,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 45.99,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 30.24,
				},
			},
			["Огнецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.43000000000001,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 90.55,
				},
			},
			["Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 89.28,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 82.93000000000001,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26.86,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 4.62,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 37.68,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 78.63,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 84.01000000000001,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 10.17,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 29.88,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 77.8,
				},
			},
			["abercrombie's crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.4,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.3,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 33.92,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 75.92,
				},
			},
			["石南草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.97,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 72.34,
				},
			},
			["铜矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 70.75,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 72.01000000000001,
				},
			},
			["broken barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.5,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 47.73,
				},
			},
			[" Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 79.5,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 51.88,
				},
			},
			["金矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 77.16,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 38.85,
				},
			},
			[" gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 74.31,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 78.81,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 51.3,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 22.39,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 72.31,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 91.22,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 73.63,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.81,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 96.75,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 33.79,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 36.01,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 41.24,
				},
			},
			["feuillargent"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.89,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.11,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 54.79,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 19.41,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.17,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 68.17,
				},
			},
			["英雄之血"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.92,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 74.7,
				},
			},
			["艾力克斯顿的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.57,
				},
			},
			["Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 12.32,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 63.55,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.42,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 15.04,
				},
			},
			["  Сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 22.79,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 79.94,
				},
			},
			["mage royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.15,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 28.73,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.88,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 2.68,
				},
			},
			["ramponierte truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.56,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 59.24,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.66,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 53.91,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 66.48,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 90.52,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 90.39,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 88.91,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.31,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 97.02,
				},
			},
			[" briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.81,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 65.34,
				},
			},
			["scarlet footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 84.23,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 81.08,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.06,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 0.24,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.59,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 46.83,
				},
			},
			["grabmoos"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.95,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 53.16,
				},
			},
			["filon d'or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 62.21,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 83.09999999999999,
				},
			},
			["caravan chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.37000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 18.23,
				},
			},
			["argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 96.59999999999999,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 39.28,
				},
			},
			["duskwood chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 10.41,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 78.23,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 70.41,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 73.93000000000001,
				},
			},
			["Сейф Янтарной мельницы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.33,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 88.94,
				},
			},
			["silbervorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 64.61,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 15.4,
				},
			},
			["felix's box"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.85,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 76,
				},
			},
			["khadgars schnurrbart"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.63,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 54.56,
				},
			},
			["scattered crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.9,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 24.67,
				},
			},
			["grave moss"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.46,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 46.62,
				},
			},
			["coffre du maréchal haggard"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.61,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 69.59,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 4.49,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 99.99,
				},
			},
			["Проломленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 99.42,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 75.77,
				},
			},
			["storage chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.81,
				},
			},
		},
		[9] = {
			["Призрачная поганка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.85,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 42.42,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 4.12,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 70.63,
				},
			},
			[" Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.83,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 59.19,
				},
			},
			["dark iron kidnapper"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.98,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 31.66,
				},
			},
			["del"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.53,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 62.64,
				},
			},
			["petit filon de thorium"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 24.09,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 36.82,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.08,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 49.27,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 23.81,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 97.67,
				},
			},
			["Обломки в воде"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 9.49,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 91.45999999999999,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 0.79,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.14,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 97.33,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 99.23,
				},
			},
			["floating debris"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.14,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 34.61,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.97,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 19.3,
				},
			},
			[" Чумоцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.59,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 77.53,
				},
			},
			["barrel of melon juice"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 79.39,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 48.31,
				},
			},
			["Драконьи зубы"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 13.06,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 96.16,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 14.39,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 96.26000000000001,
				},
			},
			["moustache de khadgar"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 71.98,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 62.28,
				},
			},
			["Горный серебряный шалфей"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 97.54000000000001,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 27.02,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 82.19,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 2.22,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.84,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 38.76,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 21.39,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 26.27,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.92,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 9.58,
				},
			},
			["Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.97,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 57.48,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 45.54,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 47.38,
				},
			},
			["梦叶草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.25,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 40.76,
				},
			},
			["封灵箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.65,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 79.25,
				},
			},
			["Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 99.63,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 20.3,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.83,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.86,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.61,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 75.61,
				},
			},
			["tonneau de nectar sucré"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 15.44,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 61.46,
				},
			},
			["mountain delsage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 28.31,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 43.79,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 37.32,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 51.61,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 56.73,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 66.13,
				},
			},
			["Ящики для оборудования"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.79,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 61.95,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.25,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 71.03,
				},
			},
			["食品箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.37,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 33.75,
				},
			},
			["greater sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 86.17,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 24.01,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 94.59999999999999,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 93.41,
				},
			},
			["blood of heroes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.58,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 32.61,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.5,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 93.97,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 58.75,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 66.09,
				},
			},
			["grabmoos"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.95,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 53.16,
				},
			},
			["filon d'or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.34,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 31.31,
				},
			},
			["duskwood chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 10.4,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 78.23,
				},
			},
			["dark iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.7,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 78.04000000000001,
				},
			},
			["supply crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.2,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 42.29,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.23,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 43.65,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 90.2,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 16.05,
				},
			},
			["boîte de felix"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.96,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 75.98,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.22,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 67.05,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 32.95,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 74.65000000000001,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.67,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 78.87000000000001,
				},
			},
			["coffre en morceaux"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 60.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 55.94,
				},
			},
			["Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.78,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 54.53,
				},
			},
			["swiftthistle"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.36,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 55.89,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.06,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 75.45,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 24.78,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 89.98,
				},
			},
		},
		[10] = {
			["del vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 74.19,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 47.97,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 2.18,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 84.68000000000001,
				},
			},
			["ammo del"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.12,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.86,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 30,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 49.75,
				},
			},
			["champignon fantôme"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 79.68000000000001,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 19.94,
				},
			},
			["Огнецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.27,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 33.1,
				},
			},
			["alliance chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.32,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 39.65,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.86,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 60.64,
				},
			},
			["echtsilbervorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 53.19,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 53.88,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.63,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 41.49,
				},
			},
			["Сундук Сумеречного леса"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 70.41,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 73.93000000000001,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.23,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 43.65,
				},
			},
			["魔皇草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.53,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 18.67,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.23,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 68.40000000000001,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.27,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 10.22,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.06,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 50.39,
				},
			},
			["tombeline"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.22,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 56.4,
				},
			},
			["dorépine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.6,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 65.18000000000001,
				},
			},
			["lebenswurz"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.28,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 62.11,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.86,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 83.39,
				},
			},
			[" Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.99,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 35.59,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.96,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 24.18,
				},
			},
			["coffre endommagé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.52,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.79,
				},
			},
			["eisenvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.56,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 19.95,
				},
			},
			["Запертый сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.96,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 16.87,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 8.25,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 71.45,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.54,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 59.72,
				},
			},
			["Ящик с различными деталями"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 30.88,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 27.88,
				},
			},
			["caisse de coffres de stockage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.59,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 79.44,
				},
			},
			["Гигантский моллюск"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 28.49,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 89.36,
				},
			},
			["sang-royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.35,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 67.56,
				},
			},
			[" copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 60.31,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 63.78,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 47.67,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 77.43000000000001,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 91.78,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 10.91,
				},
			},
			["破损的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.57,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 90.92,
				},
			},
			["greater sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 82.15000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 90.77,
				},
			},
			[" chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.23,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 66.68000000000001,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 4.12,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 70.63,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.31,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 22.75,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 99.38,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 7.54,
				},
			},
			["goldener sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.4,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 44.65,
				},
			},
			["caravan chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.37000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 18.23,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.15,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 99.59999999999999,
				},
			},
			["filon d'or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 63.27,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 73.88,
				},
			},
			["银叶草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.91,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 34.32,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.14,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 36.97,
				},
			},
			["锡矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 80.17,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 73.65000000000001,
				},
			},
			["coffre solide"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.59,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.33,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 53.4,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 74.3,
				},
			},
			["ambermill strongbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 9.140000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.26,
				},
			},
			["Странный денежный ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 17.89,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 33.07,
				},
			},
			["Косяк шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.73,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 43.34,
				},
			},
			["sombrefer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 78.37000000000001,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 20.57,
				},
			},
			["marshal haggard's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.64,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 69.58,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.65000000000001,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 97.2,
				},
			},
			["storage chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.27,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.8,
				},
			},
		},
		[11] = {
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 28.06,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 51.05,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 73.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 71.3,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 88.05,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 30.84,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.64,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 48.89,
				},
			},
			["wildstahlblume"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.4,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 6.82,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.67,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 50.35,
				},
			},
			["皇血草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.76000000000001,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 39.06,
				},
			},
			["Косяк шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.51,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 29.65,
				},
			},
			["robuste truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 27.77,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 62.39,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.29,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 63.54,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.22,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 39.26,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.63,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 26.25,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.40000000000001,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 4.83,
				},
			},
			["石南草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.66,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 31.85,
				},
			},
			["abercrombie's crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.42,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.2,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.99,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 32.9,
				},
			},
			["floating debris"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 3.13,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 1.77,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 45.02,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 27.61,
				},
			},
			["barrica de agua"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.85,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 53.59,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 78.48,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 77.91,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 83.86,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 78.14,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 66.02,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 42.67,
				},
			},
			["eglantine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.29,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 35.7,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 20.82,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 74.55,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 85.18000000000001,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 49.07,
				},
				[3] = {
					["gtype"] = 2,
					["x"] = 53.31,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 54.91,
				},
			},
			["Сейф Люция"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.04,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 44.69,
				},
			},
			["practice lockbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.74,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 44.92,
				},
			},
			["firebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.64,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 40.81,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 37.53,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 25.88,
				},
			},
			["Окованный мифрилом большой сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.94,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 13.17,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 17.23,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 55.63,
				},
			},
			["fass mit süßem nektar"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.4,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 7.85,
				},
			},
			["Затонувший сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.45,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.67,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 79.12000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 40.47,
				},
			},
			["königsblut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.74,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 18.76,
				},
			},
			[" Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.08,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 44.69,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.19,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 69.06,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 73.53,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 39.1,
				},
			},
			["cozzles schließkiste"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.34,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 20.32,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 97.55,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 77.11,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 22.84,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 64.94,
				},
			},
			["scarlet footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 84.69,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 79.68000000000001,
				},
			},
			["Сейф Янтарной мельницы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.71,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 65.23,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.46,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 75.55,
				},
			},
			["worn wooden chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.88,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 58.2,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 60.53,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 30.3,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 35.38,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 32.35,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 72.26000000000001,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.11,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 66.09,
				},
			},
			["tattered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.55,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 58.31,
				},
			},
			["ramponierte truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.14,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 79.56,
				},
			},
			["coffre solide"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 32.4,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 72.39,
				},
			},
			["khadgars schnurrbart"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.04,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 44.54,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.11,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 65.84,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 81.90000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 41.71,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.73,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 59.28,
				},
			},
			["哈加德的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.59999999999999,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 69.58,
				},
			},
			["活根草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.56,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 29.64,
				},
			},
			["魔皇草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.89,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 25.19,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 66.13,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 41.14,
				},
			},
		},
		[12] = {
			["del vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 17.13,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 56.16,
				},
			},
			["sonnengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.81,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 47.09,
				},
			},
			["Кровь героев"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.78,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 65.34,
				},
			},
			["mithrilvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.74,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 49.47,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 72.87000000000001,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 28.35,
				},
			},
			[" Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 16.23,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 17.98,
				},
			},
			["真银矿床"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 39.89,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 42.28,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.08,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.43000000000001,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.11,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 41.85,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.84,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 72.56,
				},
			},
			["Косяк шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.5,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 67.56,
				},
			},
			["robuste truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.29,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 39.95,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 26.02,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 24.52,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.49,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 82.56,
				},
			},
			["Побитый сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.4,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 99.8,
				},
			},
			["abercrombie's crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.49,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.23,
				},
			},
			["firebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.1,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 35.95,
				},
			},
			["floating debris"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 42.4,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 14.07,
				},
			},
			["friedensblume"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.93,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 37.45,
				},
			},
			["doulourante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 21.21,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 34.13,
				},
			},
			["皇血草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.87,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 33.06,
				},
			},
			[" Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 71.31,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 43.27,
				},
			},
			["黑铁矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 33.17,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 26.91,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 24.64,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 36.47,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.02,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 34.89,
				},
			},
			["Ящики Лиги Рудокопов"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.01,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 24.41,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 36.39,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 20.6,
				},
				[3] = {
					["gtype"] = 0,
					["x"] = 34.81,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 26.85,
				},
			},
			["tonneau de lait"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 27.94,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 22.18,
				},
			},
			["坚固的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.6,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 38.6,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 77.48,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 46,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.48,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 42.78,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.58,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 23.09,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.98,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 90.38,
				},
			},
			["caravan chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.37000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 18.23,
				},
			},
			["alexston's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.41,
				},
			},
			["dorépine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 86.95999999999999,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 99.70999999999999,
				},
			},
			["stratholme supply crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.76,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 51.58,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.7,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 29.76,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 80.18000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 73.65000000000001,
				},
			},
			["coffre solide"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.17,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 43.69,
				},
			},
			["ambermill strongbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 9.140000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.26,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 80.18000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 73.65000000000001,
				},
			},
			["  Сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.59,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 91.04000000000001,
				},
			},
			["trelane's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 68.98,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 66.43000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 80.23,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 17.39,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 27.32,
				},
			},
			["barrel of sweet nectar"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.3,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 44.21,
				},
			},
		},
		[13] = {
			["del vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.03,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 57.59,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 48.03,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 21.06,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 86.73,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.22,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 61.17,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.31,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 47.86,
				},
			},
			["coffre endommagé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 27.91,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 83.40000000000001,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 31.91,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 35.65,
				},
			},
			["filon d'argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 52.05,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 51.61,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.2,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 50.61,
				},
			},
			["Плавающие обломки"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.39,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 80.73,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.87,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 70.15000000000001,
				},
			},
			["紫莲花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.75,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 55.08,
				},
			},
			["tonneau de jus de melon"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 19.32,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 85.68000000000001,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.45,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 61.11,
				},
			},
			["floating debris"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.8,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 43.71,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 78.18000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 5.61,
				},
			},
			["秘银矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.72,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 59.34,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 52.19,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 53.12,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.56,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 65.48,
				},
			},
			["ghost mushroom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.69,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 44.24,
				},
			},
			["erdwurzel"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.16,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 29.96,
				},
			},
			["etouffante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.88,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 88.51000000000001,
				},
			},
			["金矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 80.5,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 40.89,
				},
			},
			["Могильный мох"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.26,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 56.5,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.41,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 25.53,
				},
			},
			["stratholme supply crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.76,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 51.58,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.98,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 90.38,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.1,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 29.94,
				},
			},
			["scarlet footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 87.83,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 86.84,
				},
			},
			["Гигантский моллюск"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.2,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 12.99,
				},
			},
			[" liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.51000000000001,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 41.54,
				},
			},
			["Сейф Янтарной мельницы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 9.140000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.26,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.93,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 27.94,
				},
			},
			["sansam doré"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.67,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 59.13,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 62.15,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 66.69,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 72.41,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 59.94,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 47.8,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 35.7,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 69.77,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 20.69,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.8,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.3,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 86.73,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 4.05,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 51.78,
				},
			},
			[" peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 28.68,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 14.58,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 69.37000000000001,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 78.69,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 69.18000000000001,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 82.22,
				},
			},
			["floadelg wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.68,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 34.97,
				},
			},
			["hojaplata"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.4,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 23.86,
				},
			},
			["dark iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 17.88,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 34.43,
				},
			},
			["large mithril bound chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.94,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 13.17,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.73,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 96.40000000000001,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 1.12,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 47.08,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.23,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 68.98,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 53.41,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 50.55,
				},
			},
			["gisement de mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 51.82,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 65.2,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.49,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.22,
				},
			},
			["梦叶草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.61,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 47.28,
				},
			},
			["太阳草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.3,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 44.74,
				},
			},
			["Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 75.99,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 45.72,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 74.91,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 47.46,
				},
				[3] = {
					["gtype"] = 2,
					["x"] = 74.04000000000001,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 47.81,
				},
				[4] = {
					["gtype"] = 2,
					["x"] = 73,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 51.81,
				},
				[5] = {
					["gtype"] = 2,
					["x"] = 70.18000000000001,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 57.18,
				},
				[6] = {
					["gtype"] = 2,
					["x"] = 73.91,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 61.19,
				},
				[7] = {
					["gtype"] = 2,
					["x"] = 72.61,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 62.75,
				},
				[8] = {
					["gtype"] = 2,
					["x"] = 66.02,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 74.68000000000001,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.05,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 60.85,
				},
			},
			["friedensblume"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.35,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 12.82,
				},
			},
		},
		[14] = {
			["Горный серебряный шалфей"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 86.93000000000001,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 37.22,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.37,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 28.33,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 82.74,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 99.94,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.09,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 89.5,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 52.57,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 59.13,
				},
			},
			[" tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 25.94,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 73.75,
				},
			},
			["Огнецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 73.47,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 96.68000000000001,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 70.63,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 83.12000000000001,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 14.94,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 27.46,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.78,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 81.19,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 10.16,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 74.25,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.41,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 68.36,
				},
			},
			["Залежи черного железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.7,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 78.04000000000001,
				},
			},
			["firebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.43,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 33.08,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.17,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 12.57,
				},
			},
			[" crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 69.56,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.19,
				},
			},
			["tombeline"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.67,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 25.53,
				},
			},
			["doulourante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.8,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 30.41,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.34999999999999,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 94.92,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 17.57,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 65.91,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.98,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 76.31,
				},
			},
			[" Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.05,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 40.17,
				},
			},
			["Ящик со шкатулками-духоловками"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.22,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 10.21,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.17,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 61.17,
				},
			},
			["dorépine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 24.82,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 39.33,
				},
			},
			["raíz de tierra"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.14,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 70.89,
				},
			},
			["Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 90.73,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 17.77,
				},
			},
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.20999999999999,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 17.73,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.18,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 43.73,
				},
			},
			["grave moss"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 18.14,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 68.3,
				},
			},
			["alexstons truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.33,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.61,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.37,
					["count"] = 0,
					["icon"] = 0,
					["y"] = 87.8,
				},
			},
			["破损的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.67,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 94.47,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 92.59999999999999,
				},
			},
			["or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.07,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 45.86,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.85,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 46.73,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.81,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 63.25,
				},
			},
			["feuerblüte"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.05,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 61.03,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.58,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 23.09,
				},
			},
			["nahrungsmittelkiste"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.51,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 23.62,
				},
			},
			[" barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.17,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 7.38,
				},
			},
			["waterlogged footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.17,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 61.3,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.59,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 36.74,
				},
			},
			["水桶"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.12,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 89.59,
				},
			},
			["银叶草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.36,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 66.48,
				},
			},
			["schwarzer lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.13,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 30.1,
				},
			},
			["Ящики для оборудования"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.79,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 61.95,
				},
			},
			["Ящик со снарядами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.1,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.85,
				},
			},
			["sunken chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.41,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.75,
				},
			},
			["Могильный мох"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 18.14,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 68.3,
				},
			},
			["储物箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.77,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 53.36,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 55.19,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 85.11,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 49.14,
				},
			},
			["哈加德的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.59999999999999,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 69.56,
				},
			},
			["储藏箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.8,
				},
			},
			["魔皇草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.22,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 15.62,
				},
			},
		},
		[15] = {
			["Призрачная поганка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.85,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 42.42,
				},
			},
			["mage royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.21,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 33.61,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.06,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 86.99,
				},
			},
			["würgetang"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 14.34,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 28.11,
				},
			},
			["captain's footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 69.56,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 48.51,
				},
			},
			["cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.37,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 82.29000000000001,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 24.72,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 38.56,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.68,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 7.82,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.65,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 45.87,
				},
			},
			["活根草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 25.83,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 59.2,
				},
			},
			["firebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.71,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 62.9,
				},
			},
			["filon de cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 40.9,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 9.1,
				},
			},
			["金棘草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.38,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 36.22,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.93000000000001,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 70.92,
				},
			},
			["秘银矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 30.66,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 39.54,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 1.19,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 91.42,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 10.31,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 4.13,
				},
			},
			["dark iron ore"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 33.14,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 27.02,
				},
			},
			["Ящик со шкатулками-духоловками"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.20999999999999,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 10.11,
				},
			},
			["eisenvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.51000000000001,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 27.58,
				},
			},
			[" Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.49,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 57.48,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.73,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 98.22,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 17.7,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 2.95,
				},
			},
			["lotus pourpre"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.17,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 85.92,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.16,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 11.18,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 42.71,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 28.74,
				},
			},
			["swiftthistle"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.98,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 25,
				},
			},
			["坚固的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.04,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 82.26000000000001,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.99,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 98.91,
				},
			},
			["dorépine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 24.82,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 39.33,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 66.51000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 33.38,
				},
			},
			["Плавающий мусор"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 3.13,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 1.77,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.42,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 75,
				},
			},
			["filon d'étain"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.35,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 72.37000000000001,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.11,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 74.69,
				},
			},
			["purple lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.17,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 85.92,
				},
			},
			["duskwood chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 70.41,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 73.93000000000001,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.73,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 96.40000000000001,
				},
			},
			["trelane's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 68.98,
				},
			},
			["boîte de felix"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.96,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 75.98,
				},
			},
			["Чумоцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.95,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 67.15000000000001,
				},
			},
			["school of tastyfish"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 28.01,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 21.65,
				},
			},
			["gisement de mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 53.51,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 42.96,
				},
			},
			["rich thorium vein (275)"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.69,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 27.85,
				},
			},
			["wildstahlblume"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.53,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 48.71,
				},
			},
			["terrestrine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.2,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 61.16,
				},
			},
			["紫莲花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.14,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 15.11,
				},
			},
		},
		[16] = {
			["一桶蜂蜜酒"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 15.59,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 61.51,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 99.70999999999999,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 72.92,
				},
			},
			["墓地苔"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 16.39,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 45.98,
				},
			},
			["würgetang"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 90.66,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 23.6,
				},
			},
			["sauge-argent des montagnes"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.92,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 62.02,
				},
			},
			["abercrombie's del"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.38,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.23,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 53.23,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 37.29,
				},
			},
			["Драконьи зубы"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.61,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 10.35,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 42.1,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 11.54,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.06,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 35.28,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 58.4,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 28.88,
				},
			},
			[" khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.91,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 50.82,
				},
			},
			["Проломленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 60.36,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 88.48,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 9.960000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 46.55,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 89.74,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 31.67,
				},
			},
			["larmes d'arthas"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 79.14,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 57.76,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 45.22,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 84.5,
				},
			},
			["eglantine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.72,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 60.85,
				},
			},
			["rich thorium vein (275) [270]"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 61.2,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 30.71,
				},
			},
			["  Ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 66.34,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 61.47,
				},
			},
			["school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 42.32,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 76.31,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 87.69,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 23.36,
				},
			},
			["ancient chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.5,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 25.94,
				},
			},
			["robuste truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 13.82,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 71.43000000000001,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.69,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 36.28,
				},
			},
			["riche filon de thorium"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.73,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 27.81,
				},
			},
			["vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 69.87000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 21.37,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 81.45,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 98.09999999999999,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 62.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 63.35,
				},
			},
			[" Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.23,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 53.66,
				},
			},
			["terrestrine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.14,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 45.02,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 7.73,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 47.81,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.56,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 62.61,
				},
			},
			["tonneau de croquejarret brune"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 71.44,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 80.95,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.11,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 71.17,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.81,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 68.23,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.67,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 62.42,
				},
			},
			[" Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 42.06,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 31.29,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 39.96,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 19.36,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.26,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 57.52,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 85.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 74.04000000000001,
				},
			},
			["floadelg wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 23.99,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 61.44,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.83,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 19.89,
				},
			},
			["tattered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.54,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 64.23,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 80.2,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 94.78,
				},
			},
			["Обломки в воде"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.52,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 69.75,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.93,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 30.47,
				},
			},
			["Косяк огнеперого луциана"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.79,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 62.43,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 57.52,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 69.75,
				},
			},
			["mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 20.85,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 84.04000000000001,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.56,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 22.55,
				},
			},
			["Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.84,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 26.52,
				},
			},
			["karawanentruhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.45,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 18.43,
				},
			},
			["金矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 43.56,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 74.29000000000001,
				},
			},
		},
		[17] = {
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.54,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 48.66,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 3.46,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 48.79,
				},
			},
			["Ящик со снарядами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.1,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.85,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.77,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 44.46,
				},
			},
			["large solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.27,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.87000000000001,
				},
			},
			["真银矿床"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.65,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 69.54000000000001,
				},
			},
			["terrestrine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.45,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 54.78,
				},
			},
			["圣箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.12,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 23.54,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 83.55,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 46.04,
				},
			},
			["山鼠草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.02,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 39.79,
				},
			},
			["wintersbite"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.83,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 29.45,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.59,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 95.19,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 94.84,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 0.96,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 94.49,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 97.56,
				},
			},
			["Залежи черного железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.88,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 11.76,
				},
			},
			["chest of containment coffers"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 71.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 63.49,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 38.54,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 79.13,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.43000000000001,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 7.88,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 73.98,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 6.13,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.19,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 62.47,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.27,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 39.92,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 94.81,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 58.68,
				},
			},
			["barrel of melon juice"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.54,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 76.25,
				},
			},
			["feuillerêve"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.53,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 57.69,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 22.92,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 64.12000000000001,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 64.2,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 33.5,
				},
			},
			["erdwurzel"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.23,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 36.13,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 79.59,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 85.75,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.68,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 74.52,
				},
			},
			["Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.39,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 55.17,
				},
			},
			["英雄之血"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.28,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 54.9,
				},
			},
			["vietérule"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.83,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 78.31,
				},
			},
			["trelane's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.1,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 68.97,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 76.23,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 63.15,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.84,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 39.52,
				},
			},
			["瑟银矿脉"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.7,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 47.35,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 81.86,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 44.81,
				},
			},
			["moustache de khadgar"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 24.23,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 58.77,
				},
			},
			["horde chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.57,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 55.58,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.25,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 95.28,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.29,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 94.56999999999999,
				},
			},
			["坚固的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.81,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 40.54,
				},
			},
			["maguskönigskraut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 73.67,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 79.73,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 90.40000000000001,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.89,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 63.62,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.61,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 18.79,
				},
			},
			[" barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.31,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 13.85,
				},
			},
			["caravan chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.37000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 18.23,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 94.84,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 0.96,
				},
			},
			["dark iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.88,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 11.76,
				},
			},
			["食物木箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.79,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 28.21,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.93,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 64.28,
				},
			},
			["fleur de feu"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.11,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 48.52,
				},
			},
			["vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.22,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 64.59,
				},
			},
			["petit filon de thorium"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 64.83,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 36.44,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.96,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 90.06,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 15.18,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 17.17,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 16.88,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 98.88,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.4,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 53.71,
				},
			},
			[" khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.38,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 32.02,
				},
			},
			["Проломленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 42.31,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 28.41,
				},
			},
		},
		[18] = {
			["Призрачная поганка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.42,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 44.45,
				},
			},
			["mage royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.52,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 4.26,
				},
			},
			["墓地苔"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 28.29,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 57.03,
				},
			},
			["ooze covered mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.1,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 74.94,
				},
			},
			["Черный лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.42,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 11.07,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 88.69,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 11.04,
				},
			},
			[" truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.97,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 63.64,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.73,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 45.96,
				},
			},
			["wildvine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.36,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 15.73,
				},
			},
			["Косяк шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.51,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 24.06,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 13.97,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 0.76,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.52,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 56.15,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 29.38,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.14,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 12.21,
				},
			},
			["石南草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.14,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 61.1,
				},
			},
			["银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.79,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 50.56,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.98,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 30.27,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 64.64,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 53.28,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 63.42,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 55.96,
				},
				[4] = {
					["gtype"] = 1,
					["x"] = 50.19,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 45.06,
				},
				[5] = {
					["gtype"] = 1,
					["x"] = 53.95,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 48.47,
				},
			},
			["stonescale eel swarm"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 28.87,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 37.67,
				},
			},
			["doulourante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.33,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 5.63,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.02,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 11.84,
				},
			},
			["blindkraut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.78,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 34.11,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.62000000000001,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 46.95,
				},
			},
			["etouffante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.59999999999999,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 64.36,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 90.98,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 68.45,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 11.27,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 2.1,
				},
			},
			["Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 88.69,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 47.63,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.91,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 38.19,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 99.56999999999999,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 95.2,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.37,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 53.53,
				},
			},
			["Побитый сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.16,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 58.68,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 64.81,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 12.15,
				},
			},
			[" chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.4,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 88.11,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 89.40000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 15.82,
				},
			},
			[" mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.42,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 74.95,
				},
			},
			["arena treasure chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 30.44,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 47.75,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.65,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 46.03,
				},
			},
			[" Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.35,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 8.15,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.37,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 13.54,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 38.29,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 45.39,
				},
			},
			["Ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.23,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 65.8,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.31,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 37.44,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.43000000000001,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 55.46,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 63.84,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 55.78,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 62.11,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 61.3,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 90.98,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 27.97,
				},
			},
			[" barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.36,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 20.34,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.39,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 0.5600000000000001,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.32,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 73.11,
				},
			},
			["dark iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.27,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 26.51,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.44,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 10.54,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 41.57,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 12.73,
				},
			},
			["Косяк огнеперого луциана"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 90.16,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 97.67,
				},
			},
			["aveuglette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.18,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 52.67,
				},
			},
			["艾力克斯顿的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.57,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.65,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 5.84,
				},
			},
			["pestblüte"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.4,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 63.32,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.93,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 63.71,
				},
			},
			[" Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.13,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.51,
				},
			},
			["瘟疫花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.66,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 36.06,
				},
			},
			["sealed barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 13.53,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 38.22,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.42,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 24.15,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 24,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 24.48,
				},
				[3] = {
					["gtype"] = 0,
					["x"] = 26.05,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 22.88,
				},
				[4] = {
					["gtype"] = 0,
					["x"] = 27.21,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 23.98,
				},
				[5] = {
					["gtype"] = 0,
					["x"] = 28.01,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 24.52,
				},
				[6] = {
					["gtype"] = 0,
					["x"] = 27.85,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 23.61,
				},
			},
		},
		[19] = {
			["del vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 21.31,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 56.53,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 78.55,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 33.89,
				},
			},
			["lebenswurz"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.72,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 23.91,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.57,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 59.13,
				},
			},
			["真银矿床"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 49.84,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 27.49,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 62.87,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 36.75,
				},
			},
			["ammo crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.87,
				},
			},
			["grave moss"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.09,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 43.31,
				},
			},
			["wintersbite"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.83,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 4.04,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.85,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 57.76,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 33.63,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 24.15,
				},
			},
			[" gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 64.3,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 88.37000000000001,
				},
			},
			["firebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.6,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 85.34999999999999,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.2,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 5.67,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 71.95,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 62.24,
				},
			},
			["mossy footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 74.2,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 58.51,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.57,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 45.13,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 79.09,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 77.40000000000001,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 38.28,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 29.75,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 82.36,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 51.21,
				},
			},
			["coffre endommagé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 60.66,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 58.34,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 8.810000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 4.72,
				},
			},
			["barrel of melon juice"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.54,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 76.25,
				},
			},
			["gromsblut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.02,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 50.15,
				},
			},
			["金矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.06,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 58.11,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.18,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.82,
				},
			},
			["pacifique"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.25,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 46.09,
				},
			},
			["moustache de khadgar"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 99.79000000000001,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 94.59,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.89,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 1.02,
				},
			},
			["del"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.47,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 40.61,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.36,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 51.5,
				},
			},
			["mage royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.53,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 26.27,
				},
			},
			["swiftthistle"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.65,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 29.85,
				},
			},
			[" kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.75,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 33.04,
				},
			},
			["cozzles schließkiste"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.34,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 20.32,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.59,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 49.32,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.48,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 39.57,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 84.69,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 22.36,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.87,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 6.75,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.36,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 17.51,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 3.13,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 1.77,
				},
			},
			["Blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.94,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 31.53,
				},
			},
			["feuillargent"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.28,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 5.19,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 49.3,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.85,
				},
			},
			["sonnengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.54,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 54.07,
				},
			},
			["Сейф Янтарной мельницы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.71,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 65.23,
				},
			},
			[" earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.45,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 36.19,
				},
			},
			[" goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.43000000000001,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 77.7,
				},
			},
			["scattered crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.27,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 22.65,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 9.51,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 7.53,
				},
			},
			[" Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.1,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 52.12,
				},
			},
			["caisse de nourriture"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 42.71,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 88.27,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.41,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 64.78,
				},
			},
			["etouffante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.17,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 9.34,
				},
			},
		},
		[20] = {
			["Призрачная поганка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.85,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 42.42,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.05,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 54.3,
				},
			},
			["horde supply crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.49,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 43.9,
				},
			},
			["Ящик Аберкромби"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.34,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.3,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.14,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 11.89,
				},
			},
			["champignon fantôme"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.2,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 42.02,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.53,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 54.42,
				},
			},
			["golddorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.02,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 83.34999999999999,
				},
			},
			["barrel of melon juice"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 22.58,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 60.39,
				},
			},
			["fleur de peste"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 97.08,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 2.6,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 33.01,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 46.32,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 10.95,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 27.34,
				},
			},
			["黑莲花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 87.83,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 82.81,
				},
			},
			[" mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 39.85,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 43.74,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38.7,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 62.27,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.98,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 51.52,
				},
			},
			["石南草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.34,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 73.42,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 77.06,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 84.53,
				},
			},
			["ambermill strongbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.33,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 88.94,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.05,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 13.38,
				},
			},
			["tombeline"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.92,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 53.18,
				},
			},
			["Плавающие обломки"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 81,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.44,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 42.29,
				},
			},
			["large mithril bound chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.94,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 13.17,
				},
			},
			[" 沉没的箱子 "] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.58,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.68,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 21.66,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 57.3,
				},
			},
			["食物木箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 30.52,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 59.73,
				},
			},
			[" iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.97,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 58.88,
				},
			},
			["沉没的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.38,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.68,
				},
			},
			["stratholme supply crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.76,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 51.58,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.27,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 41.33,
				},
			},
			["ghost mushroom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.02,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 41.99,
				},
			},
			["crate of crash helmets"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.38,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 66.95,
				},
			},
			["filon d'or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.34,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 31.31,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 25.14,
				},
			},
			["lotus pourpre"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.29,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 58.06,
				},
			},
			["grabmoos"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.95,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 53.16,
				},
			},
			["sansam doré"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.67,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 59.13,
				},
			},
			["coffre en morceaux"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 59.55,
				},
			},
			["坚固的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 75.51000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 30.02,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 19.87,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 88.20999999999999,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 9.19,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 3.09,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 8.609999999999999,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 4.09,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.46,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 15.3,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.45,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 54.57,
				},
			},
			["tonneau de nectar sucré"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 48.69,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 44.14,
				},
			},
			["filon d'étain"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.13,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 81.40000000000001,
				},
			},
			["瑟银矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.03,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 43.52,
				},
			},
			["blood of heroes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.73,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 33.21,
				},
			},
			["coffre en bois usé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.26,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 14.63,
				},
			},
			["tattered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.53,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 59.62,
				},
			},
			["Слезы Артаса"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.58,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 5.86,
				},
			},
			["caisse de munitions"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.08,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.87,
				},
			},
			[" goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.45,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 52.19,
				},
			},
			["horde supply del"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.82,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 38.57,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.26,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 76.93000000000001,
				},
			},
			["school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.31,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 68.16,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.41,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 68.36,
				},
			},
			[" small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.91,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 70.01000000000001,
				},
			},
			["梦叶草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.83,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 55.32,
				},
			},
		},
		[21] = {
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.12,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 13.91,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 34.07,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 16.69,
				},
			},
			["ooze covered mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.09,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 74.92,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.78,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 19.78,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 97.38,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 34.72,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 83.39,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 72.19,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 33.65,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 43.7,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.59,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 44.44,
				},
			},
			["宁神花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.81,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 26.8,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.88,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 56.5,
				},
			},
			["alliance chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.32,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 39.65,
				},
			},
			["地根草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.27,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 58.12,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.47,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 53.22,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.86,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 48.66,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 68.76000000000001,
				},
			},
			["枯叶草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.26,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 51.03,
				},
			},
			["Плавающие обломки"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 32.32,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 35.76,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 87.18000000000001,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 99.01000000000001,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 9.02,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 5.11,
				},
			},
			["Ящик с припасами с карьера"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 66.8,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 23.49,
				},
			},
			["broken barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.5,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 47.73,
				},
			},
			["ancient chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.72,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 23.78,
				},
			},
			["silberblatt"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 73.29000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 67.31,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.68,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 54.43,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 98.97,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 85.01000000000001,
				},
			},
			["冬刺草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.63,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 63.47,
				},
			},
			["locked chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 16.89,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 62.04,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 90.92,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 29.71,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 42.5,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.56,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 22.55,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.35,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.14,
				},
			},
			["excavation supply del"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 66.61,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 21.95,
				},
			},
			["坚固的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.07,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 66.31,
				},
			},
			["excavation supply crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 66.25,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 23.68,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 30.48,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 7.55,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 77.91,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 12.61,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.02,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 96.94,
				},
			},
			["gisement de mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 77.05,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 42.93,
				},
			},
			["sansam doré"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.23,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 62.18,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 23.78,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 94.42,
				},
			},
			["nahrungsmittelkiste"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.9,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 83.09999999999999,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.74,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 97.13,
				},
			},
			["or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.43000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 39.33,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 86.31,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 0.55,
				},
			},
			["coffre solide"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.16,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 62.6,
				},
			},
			["Огнецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.90000000000001,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 8.33,
				},
			},
			["Косяк огнеперого луциана"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.49,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 20.28,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 71.66,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 86.04000000000001,
				},
			},
			[" Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 25.33,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 67.89,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.89,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 34.79,
				},
			},
			["perrine's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.08,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 67.53,
				},
			},
			["storage chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.78,
				},
			},
		},
		[22] = {
			["Горный серебряный шалфей"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 86.93000000000001,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 37.22,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 79.63,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 25.1,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 51,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 29.48,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 96.8,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 29.26,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.19,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 46.18,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.02,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 28.42,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 71.66,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 86.04000000000001,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.05,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 42.92,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.28,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 44.83,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 96.43000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 33.52,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 77.63,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 88.08,
				},
			},
			["Косяк большого шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 70.87000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 94.38,
				},
			},
			["石南草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.56,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 66.17,
				},
			},
			["beulengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.74,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 31.28,
				},
			},
			["dorépine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.54000000000001,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 10.6,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 96.8,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 29.26,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 1.19,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 91.42,
				},
			},
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.78,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 90.56999999999999,
				},
			},
			["barrel of sweet nectar"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.35,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 20.36,
				},
			},
			["Ящики для оборудования"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 65.28,
				},
			},
			["Плавающие обломки"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.07,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 36.95,
				},
			},
			["chest of containment coffers"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.34,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 10.12,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 55.09,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 70.42,
				},
			},
			[" chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 24.37,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 12.6,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 69.77,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 30.85,
				},
			},
			["schließkiste des kapitäns"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.95,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 47.8,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.4,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 90.68000000000001,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 75.34,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 98.06,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.02,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 99.13,
				},
			},
			["greater sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 90.8,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 94.04000000000001,
				},
			},
			[" purple lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 37.42,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 29.88,
				},
			},
			["blood of heroes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.73,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 33.21,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.69,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 99.66,
				},
			},
			["moustache de khadgar"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 78.28,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 5.75,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 83.95,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 11.03,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 66.84,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 47.97,
				},
			},
			[" Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.41,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 63.14,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.06,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 86.99,
				},
			},
			["dark iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38.93,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 51.66,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 77.06,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 90.55,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 86.74,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 32.01,
				},
			},
			["eisenvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.65,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 53.92,
				},
			},
			["Слезы Артаса"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 94.08,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 78.18000000000001,
				},
			},
			["coffre solide"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 42.54,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 14.42,
				},
			},
			["khadgars schnurrbart"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.11,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 54.42,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.86,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 90.41,
				},
			},
			["fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.11,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 3.24,
				},
			},
			["  Ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 58.58,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 31.01,
				},
			},
			["horde supply del"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.82,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 38.57,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.97,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 90.15000000000001,
				},
			},
			["alexston's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.64,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 55.54,
				},
			},
		},
		[23] = {
			["Горный серебряный шалфей"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.73,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 98.22,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.54,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 48.66,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.48,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 73.15000000000001,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.86,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 97.19,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.85,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 53.57,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 49.52,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 48.45,
				},
			},
			["school of fish"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 2.33,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 65.33,
				},
			},
			["storage chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.18,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.77,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 87.09,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 71.62000000000001,
				},
			},
			["Косяк шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.06,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 86.99,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 6.92,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 38.64,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.39,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 38.39,
				},
			},
			["eglantine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 78.84,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 71.63,
				},
			},
			["pacifique"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 19.6,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 0.96,
				},
			},
			["山鼠草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 16.98,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 66.06,
				},
			},
			["chest of containment coffers"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.33,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 10.01,
				},
			},
			["lila lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.27,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 65.37000000000001,
				},
			},
			["heiliger kasten"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.15,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 23.46,
				},
			},
			["wintersbite"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 14.6,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 98.72,
				},
			},
			["stonescale eel swarm"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 24.29,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 59.35,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.12,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 13.12,
				},
			},
			["银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.82,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 13.89,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 40.54,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 18.85,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.7,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 48.6,
				},
			},
			["荆棘藻"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.09,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 42.81,
				},
			},
			["coffre endommagé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.52,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.8,
				},
			},
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.78,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 56.01,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26.57,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 89.04000000000001,
				},
			},
			["greater sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 4.41,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 97.31,
				},
			},
			["Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.82,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 3.06,
				},
			},
			["old treasure chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 65.77,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 74.31,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.4,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.62,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 25.39,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 98.84,
				},
			},
			["mountain delsage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.59,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 48.91,
				},
			},
			["moustache de khadgar"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.04,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 77.56,
				},
			},
			["blut von helden"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.66,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 33.32,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.84,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 39.54,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.02,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 33.47,
				},
			},
			["dented footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.07,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 24.43,
				},
			},
			["arena treasure chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 30.43,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 47.76,
				},
			},
			["blood of heroes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.35,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 54.95,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.59,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 79.27,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.5,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 93.91,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 17.68,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 97.87000000000001,
				},
			},
			["coffre de perrine"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.09,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 67.56,
				},
			},
			["filon d'or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.01,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 41.87,
				},
			},
			["食品箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 29.46,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 81.08,
				},
			},
			["dark iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.7,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 78.04000000000001,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.26,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 98.84,
				},
			},
			["traumblatt"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.92,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 47.96,
				},
			},
			["fleur de feu"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.05,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 43.9,
				},
			},
			["felix's box"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.85,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 76,
				},
			},
			["ammo del"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.12,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.86,
				},
			},
			["trelane's footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.19,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 68.14,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.79,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.74,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 25.02,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 90.78,
				},
			},
			["Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 64.53,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 48.97,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 88.40000000000001,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 40.77,
				},
			},
			["barrel of sweet nectar"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.4,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 43.93,
				},
			},
		},
		[24] = {
			["墓地苔"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 28.29,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 57.03,
				},
			},
			["破碎的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.27,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 58.79,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.98,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 51.52,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 7.33,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 10.08,
				},
			},
			["ammo crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.08,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.85,
				},
			},
			["地根草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.28,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 27.04,
				},
			},
			["Косяк шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.42,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 59.61,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.89,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 55.27,
				},
			},
			["firebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.46,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 48.16,
				},
			},
			["银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.68,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 44.6,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.27,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 39.92,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 97,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 91.40000000000001,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.91,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 61.33,
				},
			},
			[" crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.13,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 68.18000000000001,
				},
			},
			["水桶"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 83.43000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 72.2,
				},
			},
			["hort des schwarzen drachenschwarms"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.95,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 38.85,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.42,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 15.04,
				},
			},
			["fass mit süßem nektar"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.45,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 44.08,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.65,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 0.12,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.98,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 55,
				},
			},
			["奇怪的带锁箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.9,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 30.33,
				},
			},
			["greater sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 82.15000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 90.77,
				},
			},
			["瑟银矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.47,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 36.64,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.2,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 70.52,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.58,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 52.48,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 87.33,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 65.53,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.42,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 39.69,
				},
			},
			["purple lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.69,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 97.31999999999999,
				},
			},
			["blassblatt"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.56,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 64.87000000000001,
				},
			},
			["Косяк огнеперого луциана"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.99,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 98.91,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 99.67,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 76.23,
				},
			},
			["魔皇草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.13,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 34.65,
				},
			},
			["Сундук Алекстона"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.33,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.6,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.65000000000001,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 32.54,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.23,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 14.57,
				},
			},
			["ooze covered mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.09,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 74.93000000000001,
				},
			},
			["captain's footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.97,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 47.8,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 84.95,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 91.84,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 88.29000000000001,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 93.44,
				},
			},
			["box of assorted parts"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.34,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 66.41,
				},
			},
			["pacifique"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.76,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 74.62000000000001,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.98,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 92.76000000000001,
				},
			},
			["ausgrabungsgrundbedarfskiste"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 66.83,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 23.59,
				},
			},
			[" chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.79,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 82.76000000000001,
				},
			},
			["mithrilablagerung"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.84,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 67.14,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 16.19,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 43.92,
				},
				[3] = {
					["gtype"] = 2,
					["x"] = 42.57,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 77.83,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.28,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 66.88,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.3,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 42,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 45.56,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 21.65,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 49.38,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 75.90000000000001,
				},
			},
			["alexston's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.29,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.59,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.41,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 8.4,
				},
			},
			[" Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.05,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 40.17,
				},
			},
			["filon d'or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.34,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 31.31,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.48,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 96.61,
				},
			},
			["Ящик со шкатулками-духоловками"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.51,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 79.31,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.36,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 95.14,
				},
			},
			["铜矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.65,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 27.19,
				},
			},
			[" mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.64,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 41.44,
				},
			},
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.69,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 26.37,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.5,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 59.23,
				},
			},
			["arena treasure chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 30.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 47.85,
				},
			},
			["duskwood chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 70.41,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 73.93000000000001,
				},
			},
			["nahrungsmittelkiste"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 27.83,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 68.92,
				},
			},
			["locked chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.02,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 16.98,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.14,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 43.38,
				},
			},
			["broken barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.5,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 47.73,
				},
			},
		},
		[25] = {
			["一桶蜂蜜酒"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.54,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 39.15,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.7,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 35.15,
				},
			},
			["破碎的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.29,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 39.75,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.67,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 17.3,
				},
			},
			["schwarzer lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 71.2,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 14.15,
				},
			},
			["真银矿床"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 85.18000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 30.05,
				},
			},
			["Косяк рыбы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.89,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 15.86,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.8,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 61.51,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 14.16,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 43.75,
				},
			},
			["火焰花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.98,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 39.25,
				},
			},
			["sealed barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.94,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 35.99,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 25.11,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 35.21,
				},
			},
			["filon d'argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.05,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 28.11,
				},
			},
			["枯叶草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.11,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 54.79,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.38,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 28.99,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 88.49,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 62.11,
				},
			},
			["floating debris"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 67.06,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 94.28,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.4,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 5.81,
				},
			},
			["storage chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.81,
				},
			},
			["raíz de tierra"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.14,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 70.89,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 73.63,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 15.61,
				},
			},
			["特雷莱恩的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.05,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 67.84,
				},
			},
			["活根草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.96,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 50.17,
				},
			},
			[" crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.59,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 18.25,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.04,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 57.08,
				},
			},
			["破损的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.24,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.67,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.03,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.43,
				},
			},
			["goldener sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.72,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 83.16,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.4,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 83.64,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.57,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 46.25,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 13.4,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 41.44,
				},
			},
			[" copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.85,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 61.1,
				},
			},
			["sang-royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.77,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 50.42,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.2,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 67.8,
				},
			},
			[" 坚固的箱子 "] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.31,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 80.40000000000001,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.1,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 57.54,
				},
			},
			["pâlerette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.21,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 16.04,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.06,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 57.68,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.07,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 51.69,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 33.94,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.09,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.43,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.07,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 4.12,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 70.63,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.40000000000001,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 0.19,
				},
			},
			["grabmoos"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.81,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 85.44,
				},
			},
			["filon d'étain"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 43.41,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 11.41,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 73.03,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 97.89,
				},
			},
			["argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.74,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 5.69,
				},
			},
			["Залежи черного железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 78.37000000000001,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 20.57,
				},
			},
			["echtsilbervorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 15.8,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 32.85,
				},
			},
			["kleines thoriumvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 47.32,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 71.13,
				},
			},
			["coffre solide"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.94,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 18.3,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.83,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 63.58,
				},
			},
			["cozzle's footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.36,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 20.35,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 16.25,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 35.72,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 14.32,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 32.76,
				},
			},
			["robuste truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 23.63,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.58,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 48.75,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.2,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 45.56,
				},
			},
			["barrel of sweet nectar"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.35,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 20.36,
				},
			},
		},
	},
	[0] = {
		[0] = {
			["富瑟银矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.65,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 41.87,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38.38,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 57.97,
				},
			},
		},
	},
}
Gatherer_SavedSettings_AccountWide = {
	["p2p"] = true,
	["miniIconDist"] = 30,
	["minderTime"] = 5,
	["maxDist"] = 20,
	["interested"] = {
		[1] = {
			["briarthorn"] = true,
			["grave moss"] = true,
			["ghost mushroom"] = true,
			["silverleaf"] = true,
			["swiftthistle"] = true,
			["wintersbite"] = true,
			["black lotus"] = true,
			["earthroot"] = true,
			["sungrass"] = true,
			["fadeleaf"] = true,
			["goldthorn"] = true,
			["mageroyal"] = true,
			["wildvine"] = true,
			["arthas' tears"] = true,
			["golden sansam"] = true,
			["wild steelbloom"] = true,
			["bruiseweed"] = true,
			["kingsblood"] = true,
			["liferoot"] = true,
			["firebloom"] = true,
			["dreamfoil"] = true,
			["mountain silversage"] = true,
			["plaguebloom"] = true,
			["purple lotus"] = true,
			["stranglekelp"] = true,
			["khadgar's whisker"] = true,
			["blindweed"] = true,
			["peacebloom"] = true,
			["gromsblood"] = true,
			["icecap"] = true,
		},
		[2] = {
			["tin"] = true,
			["silver"] = true,
			["iron"] = true,
			["truesilver"] = true,
			["thorium (rich)"] = true,
			["mithril"] = true,
			["copper"] = true,
			["gold"] = true,
			["thorium"] = true,
			["dark iron"] = true,
		},
		[3] = {
		},
		[0] = {
			["bloodpetal"] = true,
			["whipper root"] = true,
			["box"] = true,
			["floating wreckage"] = true,
			["blood of heroes"] = true,
			["cask"] = true,
			["power crystal"] = true,
			["night dragon"] = true,
			["shellfish trap"] = true,
			["crate"] = true,
			["footlocker"] = true,
			["patch of elemental water"] = true,
			["barrel"] = true,
			["giant clam"] = true,
			["windblossom"] = true,
			["school"] = true,
			["un'goro soil"] = true,
			["chest"] = true,
			["songflower"] = true,
		},
	},
	["NoIconOnMinDist"] = 0,
	["filters"] = {
		[1] = "auto",
		[2] = "auto",
		[3] = "auto",
		[0] = "auto",
	},
	["HideOnButton"] = 0,
	["debug"] = false,
	["fadeDist"] = 60,
	["HideIcon"] = 0,
	["alphaUnderMinIcon"] = 80,
	["number"] = 10,
	["filterRecording"] = {
		[1] = false,
		[2] = false,
		[3] = false,
		[0] = false,
	},
	["HideMiniNotes"] = 0,
	["disableWMFreezeWorkaround"] = 1,
	["ShowOnButton"] = 0,
	["mapMinder"] = false,
	["ShowOnClick"] = 0,
	["HideOnClick"] = 0,
	["showWorldMapFilters"] = 0,
	["Radius"] = 80,
	["iconSet"] = "shaded",
	["Position"] = 12,
	["rareOre"] = 0,
	["ShowOnMouse"] = 1,
	["ToggleWorldNotes"] = 0,
	["logInfo"] = "on",
	["useMinimapText"] = "on",
	["useMainmap"] = true,
	["Version"] = "1.0.0",
	["filter"] = "all",
	["fadePerc"] = 80,
	["HideOnMouse"] = 1,
	["IconSize"] = 12,
	["useMinimap"] = true,
}
