
GatherItems = {
	[1] = {
		[1] = {
			[" 富瑟银矿 "] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.7,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 38.61,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.51,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 55.79,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 99.78,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 96.65000000000001,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 99.34999999999999,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 48.7,
				},
			},
			["坚固的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.51,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 42.56,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.61,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 58.92,
				},
			},
			["wilddornrose"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.8,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 30.56,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 51.16,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 21.19,
				},
			},
			["filon d'étain"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 47.07,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 48.86,
				},
			},
			["玛雷姆的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.84,
				},
			},
			["weapon crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 75.2,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 73.06,
				},
			},
			["lila lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.22,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 13.17,
				},
			},
			["silbervorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 75.26000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 69.59,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.66,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 62.65,
				},
			},
			["幽灵菇"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.73,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 8.060000000000001,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 66.29000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 83.20999999999999,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 97.31999999999999,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 52.02,
				},
			},
			["larmes d'arthas"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.42,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 16.05,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.44,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 66.06,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.98,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 83.20999999999999,
				},
			},
			["金矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 37.06,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 38.88,
				},
			},
		},
		[2] = {
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.19,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 89.06,
				},
			},
			[" Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.15,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 18.3,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 0.62,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 98.39,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.7,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 97.44,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 17.55,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 51.96,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.19,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 92.67,
				},
			},
			["bergsilberweisling"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 25.2,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 54.43,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.44,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 97.52,
				},
			},
			["玛雷姆的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.45,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.86,
				},
			},
			["铜矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 72.55,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 24.36,
				},
			},
			["银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.18,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 71.63,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.48,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 25.44,
				},
			},
			[" copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.27,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 22.48,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 2.74,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 57.58,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.62,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 90.68000000000001,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.03,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 41.37,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 18.55,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 55.48,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.4,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 52.03,
				},
			},
			["etouffante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.22,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 31.13,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.46,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 61.15,
				},
			},
		},
		[3] = {
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.9,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 89.59999999999999,
				},
			},
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 5.66,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 87.45999999999999,
				},
			},
			["Оскверненный песнецвет"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 75.95,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 32.82,
				},
			},
			["cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.91,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 35.79,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 77.52,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 61.78,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.81999999999999,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 76.33,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.78,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 33.78,
				},
			},
			["vorratskiste des wegekreuzes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.41,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 24.75,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 91.43000000000001,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 43.53,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.07,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 53.94,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 39.9,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 52.02,
				},
			},
			["软泥覆盖的金矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.72,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 86.5,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.75,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 49.36,
				},
			},
			["oil spill"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 72.91,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 55.06,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.39,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 36.65,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.24,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 62.08,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.75,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 51.15,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 69.48,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 47.42,
				},
			},
			["blue power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 17.42,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 80.84,
				},
			},
			["floating debris"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 32.36,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 42.28,
				},
			},
			["Оскверненный Ночной дракон"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.67,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 79.2,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.8,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 20.37,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.74,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 67.23,
				},
			},
			["eiskappe"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.96,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 54.91,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.83,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 44.27,
				},
			},
		},
		[4] = {
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 84.31999999999999,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 84.26000000000001,
				},
			},
			["Косяк загадочной рыбы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.42,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 49.11,
				},
			},
			["Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.79,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 66.95,
				},
			},
			[" Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.23,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 54.77,
				},
			},
			["瑟银矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 64.03,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 30.21,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 86.55,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.01,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 74.95,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 73.39,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 85.69,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 52.69,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 27.56,
				},
			},
			["Желтый кристалл силы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.17,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 20.34,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.31,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 58.64,
				},
			},
			["lotus pourpre"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.59999999999999,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 35.44,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.5,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 83.44,
				},
			},
			["crate of elunite"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.56,
				},
			},
			["  Ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.21,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 46.19,
				},
			},
			["瑟银矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.77,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 27.38,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.42,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 68.47,
				},
			},
			["Удавник "] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.18,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 94.01000000000001,
				},
			},
		},
		[5] = {
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 10.77,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.94,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 57.69,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.11,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 52.94,
				},
			},
			["riche filon de thorium"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.44,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 77.62000000000001,
				},
			},
			[" chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 78.86,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 23.34,
				},
			},
			[" liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.57,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 76.78,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 86.74,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 78.05,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.42,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 73.98,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 77.76000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 19.43,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.67,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 81.99,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.5,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 12.47,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 3.85,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 79.86,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.22,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 40.01,
				},
			},
			["山鼠草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.72,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 70.56,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.82,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 38.63,
				},
			},
			["梦叶草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.81,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 65.09,
				},
			},
			["冰盖草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.56,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 66.81,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.56,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 41.48,
				},
			},
			["stonescale eel swarm"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 77.18000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 98.40000000000001,
				},
			},
			["ooze covered truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.04,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 80.94,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 96.15000000000001,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 88.56,
				},
			},
			["Ящик с блеснами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.15,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.65,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.09,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 75.26000000000001,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.94,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 21.8,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 72.56,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 24.36,
				},
			},
			["vietérule"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 78.63,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 54.01,
				},
			},
		},
		[6] = {
			["navetille purifiée"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.18,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 85.25,
				},
			},
			["bloodpetal sprout"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 83.14,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 57.48,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.03,
					["count"] = 2,
					["icon"] = 2,
					["y"] = 48.61,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 43.29,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 39.36,
				},
			},
			[" silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.33,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 58.04,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.46,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 25.31,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.01,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 16.35,
				},
			},
			["华丽的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.18,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 50,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.78,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 37.69,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.98,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 40.96,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 49.47,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 51.11,
				},
			},
			["gallywix's lockbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.22,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 16.2,
				},
			},
			["fass mit milch"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.86,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 76.19,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.7,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 49.82,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.67,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 40.32,
				},
			},
			["buccaneer's strongbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.95,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 92.66,
				},
			},
			["Косяк огнеперого луциана"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 14.63,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 97.87000000000001,
				},
			},
			["Поврежденный ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.02,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.89,
				},
			},
			[" ooze covered gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.72,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 74.11,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.62,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 60.29,
				},
			},
			["etouffante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.35,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 85.97,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 60.47,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 67.84,
				},
			},
		},
		[7] = {
			["Украшенный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.96,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.2,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 26.21,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 3.59,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 89.55,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.58,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 50.41,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.5,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 24.58,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 9.109999999999999,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 17.17,
				},
			},
			["Зеленый кристалл силы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.67,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 26.88,
				},
			},
			["Ящик с провизией"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 68.56,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 36.44,
				},
			},
			["filon d'argent couvert de limon"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.12000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.16,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 79.23,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 82.19,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.6,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 18.6,
				},
			},
			["Побег кровоцвета"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.15,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 16.76,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.83,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 68.61,
				},
			},
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.56,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 39.03,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.33,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 69.48,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.86,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 15.82,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.3,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 51.45,
				},
			},
			["mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.75,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 51.87,
				},
			},
			["coffre de malem"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.56,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.88,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 5.79,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 83.99,
				},
			},
			["Кровь грома"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.43,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 4.13,
				},
			},
		},
		[8] = {
			["Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.43,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 87.20999999999999,
				},
			},
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 28.47,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 33.25,
				},
			},
			["vietérule"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.07,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 23.18,
				},
			},
			["corrupted night dragon"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.72,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 78.26000000000001,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 42.46,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 13.91,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.45,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 95.45,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 74.92,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 8.77,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 97.05,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 19.89,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 24.57,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 13.7,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 84.90000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 99.55,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.78,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 33.78,
				},
			},
			["瑟银矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 49,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 29.59,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.48,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 22.53,
				},
			},
			["goldener sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.36,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 63.49,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.46,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 22.7,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 12.27,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 92.55,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 14.79,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 8.52,
				},
			},
			["gromsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.08,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 11.95,
				},
			},
			["cleansed songflower"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.29,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 22.56,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 40.15,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 56.58,
				},
			},
		},
		[9] = {
			["corrupted whipper root"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.42,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 12.17,
				},
			},
			["ooze covered mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 78.05,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 64.7,
				},
			},
			["gromsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.19,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 72.66,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.63,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 36.63,
				},
			},
			[" ooze covered truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 72.02,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 64.01000000000001,
				},
			},
			["Побег кровоцвета"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.79,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 15.32,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 93.74,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 0.22,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.26,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 67.25,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 33.97,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 51.54,
				},
			},
			["Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.74,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 88.38,
				},
			},
			["Побитый сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.31,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 73.03,
				},
			},
			["cleansed songflower"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.57,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 13.92,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 83.64,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 98.08,
				},
			},
			[" Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.26,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 57.87,
				},
			},
			["海达克西斯的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 79.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 74.81,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.97,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 63.2,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.72,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 48.12,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 65.39,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 26.89,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 22.4,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 97.51000000000001,
				},
			},
			["Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 15.47,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 19.97,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 7.49,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 49.49,
				},
			},
			["machtkristall"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.73,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 92.48,
				},
			},
		},
		[10] = {
			["malem chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.54,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.8,
				},
			},
			["corrupted whipper root"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.14,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 85.22,
				},
			},
			["Черный лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.22,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 79.27,
				},
			},
			["echtsilberablagerung"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.96,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.91,
				},
			},
			["Огнецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 71.59,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 47.52,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.09,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 59.71,
				},
			},
			["weapon crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.34,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.21,
				},
			},
			["ooze covered rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 6.41,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 68.63,
				},
			},
			["wintersbite"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.3,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 66.43000000000001,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.77,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 73.3,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.61,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 61.37,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 81.19,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 88.8,
				},
			},
			["aciérite sauvage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.44,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 19.67,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.62000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 96,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.59,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 49.16,
				},
			},
			["eglantine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.02,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 47.5,
				},
			},
			["goldvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 22.12,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 24.29,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.42,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 51,
				},
			},
			["Стая рыбы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 22.08,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 72.98,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.79,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 73.94,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 77.25,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 98.65000000000001,
				},
			},
			["gisement de mithril"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.82,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 66.76000000000001,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.59,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 70.25,
				},
			},
		},
		[11] = {
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 82.26000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 23.77,
				},
			},
			["Ящики с припасами для Перекрестка"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.33,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 24.82,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 48.52,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 72.05,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 60.28,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 48.32,
				},
			},
			["Ящик c пометкой \"Лавка Дриззлика\""] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.64,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 49.66,
				},
			},
			["terrestrine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.61,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 27.39,
				},
			},
			["grave moss"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 0.31,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 31.71,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.35,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 92.68000000000001,
				},
			},
			["Побег кровоцвета"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 37.84,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 27.64,
				},
			},
			["calot de glace"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.3,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 44.4,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.68,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 92.15000000000001,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 21.66,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 99.65000000000001,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.21,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 5.75,
				},
			},
			["软泥覆盖的富瑟银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.03,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 11.27,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.34,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 40.15,
				},
			},
			["Чумоцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.55,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 41.23,
				},
			},
			["filon de cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.22,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 23.62,
				},
			},
			["feuillargent"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 19,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26.39,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 3.59,
				},
			},
			["sealed supply crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.76,
					["count"] = 1,
					["icon"] = 4,
					["y"] = 48.22,
				},
			},
			["Кровь Грома"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.33,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 21.39,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.28,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 70.68000000000001,
				},
			},
			["Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.02,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 14.2,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 15.16,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.51,
				},
			},
			["荆棘藻"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.18,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 60.16,
				},
			},
			["waterlogged footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 6.15,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 78.41,
				},
			},
		},
		[12] = {
			["giant softshell clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.93,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 30.58,
				},
			},
			["mage royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.83,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 15.08,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 39.9,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 27.25,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 70.76000000000001,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 34.15,
				},
			},
			["traumblatt"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.5,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 68.05,
				},
			},
			["ooze covered rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 23.29,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 51.74,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.62000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 96,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 39.43,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 74.69,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 86.8,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 5.92,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.61,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 45.73,
				},
			},
			["argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.19,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 50.88,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.56,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 32.49,
				},
			},
			["Замшелый сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.36,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 16.95,
				},
			},
			["Обломки в воде"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.13,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 74.22,
				},
			},
			["corrupted songflower"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.15,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 44.46,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.49,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 74.39,
				},
			},
			["mossy footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.54,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 13.95,
				},
			},
			[" khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.59,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 18.92,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.84,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 79.55,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 77.25,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 98.65000000000001,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.07,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 77.98,
				},
			},
			["gisement de vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.83,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 44.27,
				},
			},
		},
		[13] = {
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.02,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 45.89,
				},
			},
			["秘银矿床"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.79,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 66.62000000000001,
				},
			},
			["del"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.65,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 55.18,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 6.27,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 7.7,
				},
			},
			["soleillette"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.11,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 94.61,
				},
			},
			["filon d'argent couvert de limon"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.06,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.14,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.84,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 6.9,
				},
			},
			["chest of nesting"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.39,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 60.53,
				},
			},
			["kleines thoriumvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 40.33,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 90.67,
				},
			},
			["caisse du bidulium"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.06,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.46,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.57,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 31.11,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 3.9,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 3.9,
				},
			},
			["chest of the black feather"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.71,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 61.17,
				},
			},
			["Солнечник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 4.41,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 36.29,
				},
			},
			["red power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 90.76000000000001,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 20.02,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.48,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 29.8,
				},
			},
			["cleansed windblossom"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.16,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 23.43,
				},
			},
		},
		[14] = {
			["un'goro dirt pile"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 90.05,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 60.53,
				},
			},
			["cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.47,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 38.25,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 58.72,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 34.56,
				},
			},
			["sansam doré"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.25,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 92.73,
				},
			},
			["green power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 97.66,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 70.95,
				},
			},
			["ooze covered rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 19.68,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 65.52,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 84.5,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 29.05,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 73.45,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 10.22,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.19,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 50.88,
				},
			},
			["Желтый кристалл силы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 73.83,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 53.35,
				},
			},
			["school of fish"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.3,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 43.99,
				},
			},
			["mossy footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 11.73,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 87.29000000000001,
				},
			},
			["Побитый сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 84.23,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 84.14,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.15,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 62.83,
				},
			},
			["Могильный мох"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.03,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 81.26000000000001,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 90.81,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 70.84,
				},
			},
			["school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.33,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 71.26000000000001,
				},
			},
			["Затопленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.66,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.77,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.90000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 85.7,
				},
			},
			["Косяк загадочной рыбы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.48,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 40.36,
				},
			},
		},
		[15] = {
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.28,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 50.48,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.66,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 16.05,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.93,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 38.59,
				},
			},
			["Ящики с припасами для Перекрестка"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.33,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 24.82,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 53.28,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 16.04,
				},
			},
			["Ящик c пометкой \"Лавка Дриззлика\""] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.6,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 49.63,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.61,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 78.67,
				},
			},
			["Косяк загадочной рыбы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.48,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 40.36,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.07,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 33.92,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 54.51,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 47.12,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.56,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 90.77,
				},
			},
			["Ящик с отверстиями"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.31,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 37.61,
				},
			},
			["瑟银矿脉"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 37.76,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 31.9,
				},
			},
			["Косяк шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.47,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 38.84,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.99,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 53.21,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.17,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 0.3,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.82,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 12.57,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 17.89,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 39.43,
				},
			},
			["Могильный мох"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 7.85,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 44.71,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 12.83,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 18.22,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 29.24,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.61,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 54.21,
				},
			},
			["Краденый железный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.04,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 26.6,
				},
			},
			["del deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38.22,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 77.44,
				},
			},
		},
		[16] = {
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.48,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 81.08,
				},
			},
			["bloodpetal sprout"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.6,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 17.01,
				},
			},
			["karnitol's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.07,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 30.5,
				},
			},
			["ghost mushroom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.4,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 57.9,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 5.55,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 42.07,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.2,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 58.4,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 75.33,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 46.08,
				},
			},
			["echtsilberablagerung"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 44.96,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.91,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.81,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 59.39,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 47.73,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 33.43,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 44.69,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 39.3,
				},
				[4] = {
					["gtype"] = 1,
					["x"] = 47.03,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 41.38,
				},
				[5] = {
					["gtype"] = 1,
					["x"] = 48.03,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 45.19,
				},
				[6] = {
					["gtype"] = 1,
					["x"] = 44.33,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 48.68,
				},
				[7] = {
					["gtype"] = 1,
					["x"] = 45.07,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 53.78,
				},
				[8] = {
					["gtype"] = 1,
					["x"] = 41.08,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 56.28,
				},
				[9] = {
					["gtype"] = 1,
					["x"] = 38.32,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 79.45999999999999,
				},
				[10] = {
					["gtype"] = 1,
					["x"] = 51.08,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 67.06,
				},
				[11] = {
					["gtype"] = 1,
					["x"] = 50.28,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 73.8,
				},
				[12] = {
					["gtype"] = 1,
					["x"] = 51.7,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 73.02,
				},
				[13] = {
					["gtype"] = 1,
					["x"] = 58.77,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 74.31999999999999,
				},
				[14] = {
					["gtype"] = 1,
					["x"] = 40.35,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 63.27,
				},
				[15] = {
					["gtype"] = 1,
					["x"] = 37.1,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 66.01000000000001,
				},
				[16] = {
					["gtype"] = 1,
					["x"] = 38.67,
					["count"] = 1,
					["icon"] = 3,
					["y"] = 68.95999999999999,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.99,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 5.93,
				},
			},
			["卡德加的胡须"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.48,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 21.41,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.54,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 66.23,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 38.77,
					["count"] = 1,
					["icon"] = 4,
					["y"] = 61.5,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 65.28,
					["count"] = 1,
					["icon"] = 4,
					["y"] = 63.99,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.66,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 30.55,
				},
			},
			["Ящик с оружием"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.33,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.18,
				},
			},
			["chest of the black feather"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.73,
					["count"] = 4,
					["icon"] = 2,
					["y"] = 61.21,
				},
			},
			["chest of nesting"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.41,
					["count"] = 3,
					["icon"] = 2,
					["y"] = 60.59,
				},
			},
			[" Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.71,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 63.76,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.06,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 1.58,
				},
			},
			["紫莲花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.92,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 14.06,
				},
			},
			["blue power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 5.8,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 45.57,
				},
			},
			["银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 51.93,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 58.17,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 9.220000000000001,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 42.3,
				},
			},
			["黄金参"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.40000000000001,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 37.84,
				},
			},
			["秘银矿脉"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.36,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 59.85,
				},
			},
			["chest of the raven claw"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.56,
					["count"] = 2,
					["icon"] = 2,
					["y"] = 57.37,
				},
			},
			["goldvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.64,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 14.81,
				},
			},
			["chest of the sky"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.74,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 62.4,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.71,
					["count"] = 2,
					["icon"] = 1,
					["y"] = 61.29,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 63.66,
					["count"] = 3,
					["icon"] = 1,
					["y"] = 63.63,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 67.03,
					["count"] = 2,
					["icon"] = 1,
					["y"] = 59.67,
				},
				[4] = {
					["gtype"] = 1,
					["x"] = 60.59,
					["count"] = 2,
					["icon"] = 1,
					["y"] = 54.02,
				},
				[5] = {
					["gtype"] = 1,
					["x"] = 57.51,
					["count"] = 5,
					["icon"] = 1,
					["y"] = 64.86,
				},
				[6] = {
					["gtype"] = 1,
					["x"] = 52.53,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 73.77,
				},
				[7] = {
					["gtype"] = 1,
					["x"] = 45.19,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 75.91,
				},
				[8] = {
					["gtype"] = 1,
					["x"] = 41.16,
					["count"] = 2,
					["icon"] = 1,
					["y"] = 48.44,
				},
				[9] = {
					["gtype"] = 1,
					["x"] = 41.72,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 44.65,
				},
				[10] = {
					["gtype"] = 1,
					["x"] = 43.76,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 45.87,
				},
				[11] = {
					["gtype"] = 1,
					["x"] = 57.59,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 70.55,
				},
				[12] = {
					["gtype"] = 1,
					["x"] = 65.52,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 51.83,
				},
				[13] = {
					["gtype"] = 1,
					["x"] = 44.98,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 31.51,
				},
				[14] = {
					["gtype"] = 1,
					["x"] = 46.03,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 41,
				},
				[15] = {
					["gtype"] = 1,
					["x"] = 44.21,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 39.39,
				},
				[16] = {
					["gtype"] = 1,
					["x"] = 46.49,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 45.84,
				},
				[17] = {
					["gtype"] = 1,
					["x"] = 40.08,
					["count"] = 3,
					["icon"] = 1,
					["y"] = 69.11,
				},
				[18] = {
					["gtype"] = 1,
					["x"] = 41.19,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 78.91,
				},
				[19] = {
					["gtype"] = 1,
					["x"] = 49.65,
					["count"] = 3,
					["icon"] = 1,
					["y"] = 68.18000000000001,
				},
				[20] = {
					["gtype"] = 1,
					["x"] = 69.56999999999999,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 58.76,
				},
				[21] = {
					["gtype"] = 1,
					["x"] = 67.66,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 61.79,
				},
				[22] = {
					["gtype"] = 1,
					["x"] = 61.78,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 61.26,
				},
				[23] = {
					["gtype"] = 1,
					["x"] = 60.14,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 61.29,
				},
				[24] = {
					["gtype"] = 1,
					["x"] = 61.01,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 58.15,
				},
				[25] = {
					["gtype"] = 1,
					["x"] = 60.84,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 55.12,
				},
				[26] = {
					["gtype"] = 1,
					["x"] = 55.3,
					["count"] = 2,
					["icon"] = 1,
					["y"] = 66.76000000000001,
				},
				[27] = {
					["gtype"] = 1,
					["x"] = 56.01,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 71.94,
				},
				[28] = {
					["gtype"] = 1,
					["x"] = 63.14,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 71.51000000000001,
				},
				[29] = {
					["gtype"] = 1,
					["x"] = 40.54,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 60.33,
				},
				[30] = {
					["gtype"] = 1,
					["x"] = 38.64,
					["count"] = 1,
					["icon"] = 1,
					["y"] = 67.12000000000001,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.87,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 90.87000000000001,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.06,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 64.98,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 52.04,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 69.26000000000001,
				},
				[3] = {
					["gtype"] = 1,
					["x"] = 39.61,
					["count"] = 2,
					["icon"] = 2,
					["y"] = 61.93,
				},
				[4] = {
					["gtype"] = 1,
					["x"] = 40.8,
					["count"] = 2,
					["icon"] = 2,
					["y"] = 46.48,
				},
				[5] = {
					["gtype"] = 1,
					["x"] = 35.28,
					["count"] = 2,
					["icon"] = 2,
					["y"] = 31.67,
				},
				[6] = {
					["gtype"] = 1,
					["x"] = 62.78,
					["count"] = 4,
					["icon"] = 2,
					["y"] = 67.84,
				},
				[7] = {
					["gtype"] = 1,
					["x"] = 55.33,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 72.56,
				},
				[8] = {
					["gtype"] = 1,
					["x"] = 54.63,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 72.7,
				},
				[9] = {
					["gtype"] = 1,
					["x"] = 46.53,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 39.69,
				},
				[10] = {
					["gtype"] = 1,
					["x"] = 43.46,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 39.01,
				},
				[11] = {
					["gtype"] = 1,
					["x"] = 39.09,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 80.34999999999999,
				},
				[12] = {
					["gtype"] = 1,
					["x"] = 56.49,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 54.69,
				},
				[13] = {
					["gtype"] = 1,
					["x"] = 62.61,
					["count"] = 2,
					["icon"] = 2,
					["y"] = 64.29000000000001,
				},
				[14] = {
					["gtype"] = 1,
					["x"] = 65.49,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 61.39,
				},
				[15] = {
					["gtype"] = 1,
					["x"] = 67.55,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 58.12,
				},
				[16] = {
					["gtype"] = 1,
					["x"] = 68.8,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 61.63,
				},
				[17] = {
					["gtype"] = 1,
					["x"] = 61.13,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 62.26,
				},
				[18] = {
					["gtype"] = 1,
					["x"] = 49.39,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 73,
				},
				[19] = {
					["gtype"] = 1,
					["x"] = 56.39,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 74.14,
				},
				[20] = {
					["gtype"] = 1,
					["x"] = 56.04,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 76.92,
				},
				[21] = {
					["gtype"] = 1,
					["x"] = 57.79,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 77.23,
				},
				[22] = {
					["gtype"] = 1,
					["x"] = 62.64,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 73.7,
				},
				[23] = {
					["gtype"] = 1,
					["x"] = 38.57,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 65.01000000000001,
				},
				[24] = {
					["gtype"] = 1,
					["x"] = 43.44,
					["count"] = 1,
					["icon"] = 2,
					["y"] = 71.08,
				},
			},
		},
		[17] = {
			["mage royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.56,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 40.72,
				},
			},
			["truhe des nistens"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.39,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 60.64,
				},
			},
			["十字路口的补给箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.37,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 24.73,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.75,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.68,
				},
			},
			["alliance chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.32,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 56.62,
				},
			},
			["破损的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.3,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.2,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 43.84,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 27.46,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.15,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 40.49,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.58,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 91.45999999999999,
				},
			},
			["铜矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.5,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 19.6,
				},
			},
			["ooze covered gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.72,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 35.81,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 65.61,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 93.12000000000001,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.14,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 62.29,
				},
			},
			["cleansed windblossom"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.16,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 23.43,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.38,
				},
			},
			["Черный лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 25.86,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 10.49,
				},
			},
			["Затопленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.46,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.95,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.62,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 74.45,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.06,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 76.78,
				},
			},
		},
		[18] = {
			["bloodpetal sprout"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.43,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 83.39,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 99.58,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 93.52,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 17.57,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 76.92,
				},
			},
			["Ледяной зев"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 96.53,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 35.36,
				},
			},
			["ooze covered thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 10.97,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 81.18000000000001,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.25,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 15.95,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.55,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 12.32,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 99.58,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 93.52,
				},
			},
			["document chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.72,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 39.86,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.01,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 27.04,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 24.67,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 97.78,
				},
			},
			["firebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.22,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 96.59,
				},
			},
			["blindweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 18.82,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 87.76000000000001,
				},
			},
			["被腐化的轻歌花"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.34,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 52.21,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.99,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 88.84999999999999,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.98,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 62.61,
				},
			},
			["cristal de puissance"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 69.48,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 79.92,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.11,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 27.28,
				},
			},
			["Гнилой кнутокорень"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.75,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 80.36,
				},
			},
			["Косяк шалфокуня"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.53,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 42.31,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.54,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 97.95,
				},
			},
			["Ящик с оружием"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.74,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 19.66,
				},
			},
			["阿尔萨斯之泪"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.27,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 87.28,
				},
			},
			["coffre endommagé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.56,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 35.15,
				},
			},
		},
		[19] = {
			["eisenvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 58.85,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 65.7,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 83.73,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 52.62,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 57.08,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 55.24,
				},
			},
			["mountain delsage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.95,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 36.5,
				},
			},
			["cristal de puissance rouge"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.73,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 38.75,
				},
			},
			["yellow power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 11.9,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 20.23,
				},
			},
			["Лиловый лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.9,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 97.98,
				},
			},
			["green power crystal"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 14.92,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 86.2,
				},
			},
			["Ящик с оружием"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 77.84,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 74.37000000000001,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.03,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 15.95,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 18.21,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 76.89,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.22,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 17.39,
				},
			},
			["玛雷姆的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 17.84,
				},
			},
			["野钢花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.9,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 29.67,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.58,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 60.8,
				},
			},
			["sansam doré"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 7.05,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 17.85,
				},
			},
			["bloodpetal sprout"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.52,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 81.12000000000001,
				},
			},
			["gallywix's lockbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 80.2,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 89.39,
				},
			},
			["cleansed windblossom"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.16,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 23.43,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 73.16,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 7.96,
				},
			},
			["Ящик с документами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.78,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 39.89,
				},
			},
		},
		[20] = {
			["Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.09,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 92.48,
				},
			},
			["cristal de puissance vert"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 74.93000000000001,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 70.52,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 90.14,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.27,
				},
			},
			["Оскверненный песнецвет"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.35,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 52.17,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.15,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 0.14,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 59.77,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 74.93000000000001,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 97.66,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 58.47,
				},
			},
			["calot de glace"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.3,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 44.4,
				},
			},
			["crate of elunite"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.08,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.56,
				},
			},
			["Покрытые слизью мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 73.56,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 64.89,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.58,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 6.31,
				},
			},
			["floating debris"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.25,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 36.84,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 65.39,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 26.89,
				},
			},
			["doulourante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.43,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 57.19,
				},
			},
			["Черный лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 86.52,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.75,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 34.47,
				},
			},
			["un'goro soil"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.05,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 17.55,
				},
			},
			["ooze covered rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 6.41,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 68.63,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.67,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 12.32,
				},
			},
		},
		[21] = {
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.52,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 30.61,
				},
			},
			["corrupted whipper root"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 7.28,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 67.61,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.11,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 38.24,
				},
			},
			["地根草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.92,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 83.7,
				},
			},
			["sauge-argent des montagnes"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.05,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 18.6,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.78,
				},
			},
			["富瑟银矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.58,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 37.39,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.2,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 40.48,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 33.59,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 42.86,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 21.26,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 48.16,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 40.73,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.27,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 0.24,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 97.29000000000001,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.98,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 45.44,
				},
			},
			[" Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.47,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 50.67,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.2,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 71.25,
				},
			},
			[" Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 45.19,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 69.59,
				},
			},
			["Тролльский сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.92,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 33.03,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 40.44,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 34.34,
				},
				[3] = {
					["gtype"] = 0,
					["x"] = 40.82,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.82,
				},
				[4] = {
					["gtype"] = 0,
					["x"] = 40.93,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.62,
				},
			},
			["kleines thoriumvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 52.34,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 7.6,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.86,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 36.51,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 40.06,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 37.26,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.06,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 61.31,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 54.45,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 44.26,
				},
			},
			["corrupted songflower"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 24.18,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 34.51,
				},
			},
			["Куча земли Ун'Горо"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 62.16,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 17.61,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 5.26,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 93.14,
				},
			},
			["stonescale eel swarm"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.79,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 70.45,
				},
			},
			["Кровь Грома"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.06,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 70.22,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.43000000000001,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 96.98,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.7,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 64.68000000000001,
				},
			},
			["wilddornrose"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.05,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 37.35,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 79.2,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 62.3,
				},
			},
			["thorium (riche)"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 24.91,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 14.28,
				},
			},
		},
	},
	[2] = {
		[1] = {
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.15,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 98.36,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.25,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 71.09,
				},
			},
			["würgetang"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.02,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 65.04000000000001,
				},
			},
			["coffre des défias"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 23.95,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 71.98,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 4.44,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 63.04,
				},
			},
			["太阳草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.36,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 40.72,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 88.90000000000001,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 2.62,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 1.96,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 44.76,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 83.12000000000001,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 97.65000000000001,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 13.6,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 55.36,
				},
			},
			["石南草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.34,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 73.42,
				},
			},
			["Подержанный деревянный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.21,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 14.69,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.65000000000001,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 1.79,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 53.58,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 46.59,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 38.04,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 71.97,
				},
			},
			["dorépine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 17.01,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 99.67,
				},
			},
			["caisse de ravitaillement de la horde"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.76,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 38.53,
				},
			},
			["真银矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 75.3,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 49.26,
				},
			},
			["  Ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.23,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 71.01000000000001,
				},
			},
			["doulourante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.39,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 80.23,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 19.95,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 19.98,
				},
			},
		},
		[2] = {
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 24.79,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 87.86,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 12.79,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 82.16,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.78,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 0.63,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.5,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 4.43,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38.79,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 37.04,
				},
			},
			["Побитый сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 42.15,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 31.01,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.37000000000001,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 67.36,
				},
			},
			["purple lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.34,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 38.44,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.73,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 59.25,
				},
			},
			["菲利克斯的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 22.77,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 79.97,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.63,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 77.56,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 15.75,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 81.43000000000001,
				},
			},
			["trelane's footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 18.14,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 68.14,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 15.18,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 17.17,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.94,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 1.9,
				},
			},
			[" Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.17,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 44.03,
				},
			},
			["Залежи черного железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 78.37000000000001,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 20.57,
				},
			},
			["barrel of sweet nectar"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.65,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 39.1,
				},
			},
		},
		[3] = {
			[" iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 43.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 78.59,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.38,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 36.09,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.29,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 19.73,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.12,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 34.94,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.28,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.75,
				},
			},
			["tonneau de lait"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.18,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 25.38,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.09,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 41.75,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.86,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 63.92,
				},
			},
			["barrel of milk"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.66,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 53.91,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.4,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 5.81,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.88,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 54.18,
				},
			},
			["Проломленный сундучок"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 40.72,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 31.17,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.3,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 95.93000000000001,
				},
			},
			["荆棘藻"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 11.85,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 52.11,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.36,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 33.97,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.3,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 29.29,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.23,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 13,
				},
			},
			[" Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.28,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 27.7,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.7,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 38.06,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.54,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 64.45,
				},
			},
		},
		[4] = {
			["wintersbite"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.19,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 8.57,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.62,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 96.73,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 0.34,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 8.93,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.06,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 86.99,
				},
			},
			["Черный лотос"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.42,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 11.07,
				},
			},
			["sombrefer deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.27,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 26.51,
				},
			},
			["macgranns fleischtruhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.46,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 53.94,
				},
			},
			["ambermill strongbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 9.140000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.26,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.98,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 55,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 87.77,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 8.66,
				},
			},
			["Королевская кровь"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.47,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 99.17,
				},
			},
			["ramponierte truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.13,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 46.54,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 5.32,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 6.94,
				},
			},
			["banc"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 55.29,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 56.16,
				},
			},
		},
		[5] = {
			["boîte à outils de bink"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 27.68,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 36.4,
				},
			},
			["fass melonensaft"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.26,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 55.55,
				},
			},
			["Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.85,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 51.02,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 8.810000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 4.72,
				},
			},
			["mountain delsage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.81,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 24.43,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.2,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 37.57,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 13.49,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.94,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 6.24,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.02,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 5.93,
				},
			},
			["maguskönigskraut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 73.67,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 58.27,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 89.28,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 86.84,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 37.36,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 52.87,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 54.73,
				},
			},
			["Кровь Грома"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.85,
					["count"] = 0,
					["icon"] = 23,
					["y"] = 94.64,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.79000000000001,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 0.14,
				},
			},
			["rich thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 42.24,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 62,
				},
			},
			["Огнецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.6,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 85.34999999999999,
				},
			},
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.36,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 86.77,
				},
			},
			["caisse de nourriture"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.01,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 51.57,
				},
			},
		},
		[6] = {
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 22.28,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 46.3,
				},
			},
			["锡矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 45.7,
				},
			},
			[" 破烂的箱子 "] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.7,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 35.74,
				},
			},
			["Слезы Артаса"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.72,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 70.72,
				},
			},
			["Золотой сансам"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.26,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 40.72,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 79.31,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 63.62,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 90.53,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 51.11,
				},
			},
			["khadgars schnurrbart"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.11,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 54.42,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.34,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 30.25,
				},
			},
			["fleur de feu"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 82.23,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 91.45999999999999,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 69.19,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 16.94,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.67,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 19.02,
				},
			},
		},
		[7] = {
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.32,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 2.25,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 77.31,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 52.52,
				},
			},
			["Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.82,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 3.06,
				},
			},
			["feuillargent"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.78,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 81.06,
				},
			},
			["silberblatt"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.58,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 58.09,
				},
			},
			["felix's del"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.94,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 76.14,
				},
			},
			["sansam doré"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.52,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 5.96,
				},
			},
			["食品箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.64,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 68.18000000000001,
				},
			},
			["dented footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 99.55,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 75.14,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.59,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 0.32,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26.3,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 95.72,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 42.79,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 51.5,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.01000000000001,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 10.17,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 96.83,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 86.92,
				},
			},
			[" Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.78,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 62.7,
				},
			},
			["pestblüte"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.37,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 57.61,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 86.37000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 0.3,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 58.61,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 40.54,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 4.18,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 10.02,
				},
			},
			["caisse de nourriture"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.93,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 87.54000000000001,
				},
			},
		},
		[8] = {
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 51.3,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 22.39,
				},
			},
			["Пастушья сумка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 12.32,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 63.55,
				},
			},
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 73.63,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.81,
				},
			},
			["ramponierte truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 21.56,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 59.24,
				},
			},
			["grave moss"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 22.46,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 46.62,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 66.48,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 90.52,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 90.39,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 88.91,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.31,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 97.02,
				},
			},
			["scarlet footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 84.23,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 81.08,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.88,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 2.68,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 37.68,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 78.63,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 84.01000000000001,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 10.17,
				},
			},
			["abercrombie's crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.4,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.3,
				},
			},
			["石南草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.97,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 72.34,
				},
			},
			["felix's box"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.85,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 76,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 72.31,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 91.22,
				},
			},
			["scattered crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.9,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 24.67,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.31,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 9.560000000000001,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.06,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 0.24,
				},
			},
			["duskwood chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 10.41,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 78.23,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 96.75,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 33.79,
				},
			},
			["feuillargent"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.89,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 31.11,
				},
			},
		},
		[9] = {
			["Призрачная поганка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.85,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 42.42,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 68.06,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 75.45,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.61,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 75.61,
				},
			},
			["del"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.53,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 62.64,
				},
			},
			["petit filon de thorium"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 24.09,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 36.82,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.25,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 71.03,
				},
			},
			["食品箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.37,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 33.75,
				},
			},
			["greater sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 86.17,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 24.01,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 94.59999999999999,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 93.41,
				},
			},
			["blood of heroes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.58,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 32.61,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 23.81,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 97.67,
				},
			},
			["Драконьи зубы"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 13.06,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 96.16,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 14.39,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 96.26000000000001,
				},
			},
			["dark iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.7,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 78.04000000000001,
				},
			},
			["mountain silversage"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.97,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 19.3,
				},
			},
			["grabmoos"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.95,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 53.16,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 24.78,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 89.98,
				},
			},
			["Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.97,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 57.48,
				},
			},
			["tonneau de nectar sucré"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 15.44,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 61.46,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 0.92,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 9.58,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 37.32,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 51.61,
				},
			},
			["swiftthistle"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 63.36,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 55.89,
				},
			},
		},
		[10] = {
			["del vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 74.19,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 47.97,
				},
			},
			["lebenswurz"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.28,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 62.11,
				},
			},
			["Гигантский моллюск"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 28.49,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 89.36,
				},
			},
			["sang-royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.35,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 67.56,
				},
			},
			["marshal haggard's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.64,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 69.58,
				},
			},
			["alliance chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.32,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 39.65,
				},
			},
			["greater sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 82.15000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 90.77,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.86,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 60.64,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.14,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 36.97,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 4.12,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 70.63,
				},
			},
			["锡矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 80.17,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 73.65000000000001,
				},
			},
			[" chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.23,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 66.68000000000001,
				},
			},
			[" Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.99,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 35.59,
				},
			},
			["coffre solide"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.59,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.33,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.15,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 99.59999999999999,
				},
			},
			["Странный денежный ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 17.89,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 33.07,
				},
			},
			["dorépine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.6,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 65.18000000000001,
				},
			},
			["Ящик с различными деталями"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 30.88,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 27.88,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.54,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 59.72,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 34.96,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 24.18,
				},
			},
			["coffre endommagé"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.52,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.79,
				},
			},
		},
		[11] = {
			["tin vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 28.06,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 51.05,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.64,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 48.89,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 79.12000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 40.47,
				},
			},
			["königsblut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.74,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 18.76,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 97.55,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 77.11,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 22.84,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 64.94,
				},
			},
			["Сейф Янтарной мельницы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.71,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 65.23,
				},
			},
			["魔皇草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.89,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 25.19,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 66.13,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 41.14,
				},
			},
			["fass mit süßem nektar"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.4,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 7.85,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.40000000000001,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 4.83,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.11,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 66.09,
				},
			},
			["tattered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.55,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 58.31,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.63,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 26.25,
				},
			},
			["floating debris"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 3.13,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 1.77,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 45.02,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 27.61,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.11,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 65.84,
				},
			},
			["cozzles schließkiste"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 43.34,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 20.32,
				},
			},
			["barrica de agua"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.85,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 53.59,
				},
			},
			["Окованный мифрилом большой сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.94,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 13.17,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 20.82,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 74.55,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 85.18000000000001,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 49.07,
				},
			},
			["Сейф Люция"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.04,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 44.69,
				},
			},
		},
		[12] = {
			["sonnengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.81,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 47.09,
				},
			},
			[" Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 16.23,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 17.98,
				},
			},
			["真银矿床"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 39.89,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 42.28,
				},
			},
			["Ящики Лиги Рудокопов"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.01,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 24.41,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.08,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.43000000000001,
				},
			},
			["  Сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.59,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 91.04000000000001,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 80.18000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 73.65000000000001,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.48,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 42.78,
				},
			},
			["Косяк масляного черноротика"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.58,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 23.09,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.98,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 90.38,
				},
			},
			["caravan chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.37000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 18.23,
				},
			},
			["coffre solide"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.17,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 43.69,
				},
			},
			["ambermill strongbox"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 9.140000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 26.26,
				},
			},
			["Синячник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.7,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 29.76,
				},
			},
			["friedensblume"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.93,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 37.45,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 66.43000000000001,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 80.23,
				},
			},
			["皇血草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 60.87,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 33.06,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 80.18000000000001,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 73.65000000000001,
				},
			},
			["barrel of sweet nectar"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.3,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 44.21,
				},
			},
		},
		[13] = {
			["iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 86.73,
				},
			},
			["Гигантский моллюск"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.2,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 12.99,
				},
			},
			["太阳草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.3,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 44.74,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.98,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 90.38,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.23,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 68.98,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 65.8,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.3,
				},
			},
			["scarlet footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 87.83,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 86.84,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 31.91,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 35.65,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 69.37000000000001,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 78.69,
				},
			},
			["floadelg wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.68,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 34.97,
				},
			},
			["dark iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 17.88,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 34.43,
				},
			},
			["firefin snapper school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 1.12,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 47.08,
				},
			},
			["floating debris"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 54.8,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 43.71,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 62.15,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 66.69,
				},
			},
			["秘银矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 56.72,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 59.34,
				},
			},
			["filon d'argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 52.05,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 51.61,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.41,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 25.53,
				},
			},
			["Могильный мох"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.26,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 56.5,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 49.1,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 29.94,
				},
			},
			["tonneau de jus de melon"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 19.32,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 85.68000000000001,
				},
			},
		},
		[14] = {
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 61.18,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 43.73,
				},
			},
			["schwarzer lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 39.13,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 30.1,
				},
			},
			["Огнецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 73.47,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 96.68000000000001,
				},
			},
			["破损的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.22,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.67,
				},
			},
			["mageroyal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.81,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 63.25,
				},
			},
			["Серебряная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 10.16,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 74.25,
				},
			},
			[" barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.17,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 7.38,
				},
			},
			["nahrungsmittelkiste"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.51,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 23.62,
				},
			},
			["dorépine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 24.82,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 39.33,
				},
			},
			["tombeline"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 43.67,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 25.53,
				},
			},
			["doulourante"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.8,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 30.41,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.34999999999999,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 94.92,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.59,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 36.74,
				},
			},
			["grave moss"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 18.14,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 68.3,
				},
			},
			["储物箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.77,
				},
			},
			[" crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 69.56,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.19,
				},
			},
		},
		[15] = {
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.42,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 75,
				},
			},
			["oily blackmouth school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.06,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 86.99,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 95.11,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 74.69,
				},
			},
			["Плавающий мусор"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 3.13,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 1.77,
				},
			},
			["dreamfoil"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.73,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 96.40000000000001,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 2.16,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 11.18,
				},
			},
			["boîte de felix"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 20.96,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 75.98,
				},
			},
			["filon d'étain"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.35,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 72.37000000000001,
				},
			},
			["school of tastyfish"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 28.01,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 21.65,
				},
			},
			["秘银矿脉"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 30.66,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 39.54,
				},
			},
			["坚固的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 38.04,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 82.26000000000001,
				},
			},
			["cuivre"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.37,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 82.29000000000001,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 42.71,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 28.74,
				},
			},
			["captain's footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 69.56,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 48.51,
				},
			},
		},
		[16] = {
			["ancient chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.5,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 25.94,
				},
			},
			["sauge-argent des montagnes"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.92,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 62.02,
				},
			},
			["terrestrine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.14,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 45.02,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 7.73,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 47.81,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 85.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 74.04000000000001,
				},
			},
			["Обломки в воде"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 57.52,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 69.75,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 39.96,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 19.36,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 87.69,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 23.36,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 92.83,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 19.89,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 89.74,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 31.67,
				},
			},
			["Косяк огнеперого луциана"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 50.79,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 62.43,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 57.52,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 69.75,
				},
			},
			["robuste truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 13.82,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 71.43000000000001,
				},
			},
			["Залежи железа"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.84,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 26.52,
				},
			},
			["karawanentruhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 64.45,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 18.43,
				},
			},
			["Драконьи зубы"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.61,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 10.35,
				},
			},
		},
		[17] = {
			["Снолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.39,
					["count"] = 0,
					["icon"] = 26,
					["y"] = 55.17,
				},
			},
			["Золотая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 83.55,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 46.04,
				},
			},
			["Златошип"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 68.43000000000001,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 7.88,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 73.98,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 6.13,
				},
			},
			["vrai-argent"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 59.22,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 64.59,
				},
			},
			["maguskönigskraut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 73.67,
				},
			},
			["arthas' tears"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.89,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 63.62,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 94.49,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 97.56,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.61,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 18.79,
				},
			},
			["山鼠草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 67.02,
					["count"] = 0,
					["icon"] = 27,
					["y"] = 39.79,
				},
			},
			["chest of containment coffers"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 71.2,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 63.49,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 45.27,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 39.92,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 94.81,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 58.68,
				},
			},
			["barrel of melon juice"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.54,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 76.25,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 15.18,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 17.17,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 64.59,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 95.19,
				},
			},
			["erdwurzel"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.23,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 36.13,
				},
			},
			["Медная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 79.59,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 85.75,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.25,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 95.28,
				},
			},
		},
		[18] = {
			["Призрачная поганка"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 55.42,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 44.45,
				},
			},
			["mage royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 15.52,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 4.26,
				},
			},
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.32,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 73.11,
				},
			},
			["ooze covered mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 32.1,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 74.94,
				},
			},
			["battered chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 31.65,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 46.03,
				},
			},
			[" truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.97,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 63.64,
				},
			},
			["earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.73,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 45.96,
				},
			},
			[" Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.35,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 8.15,
				},
			},
			["goldthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.37,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 13.54,
				},
			},
			["arena treasure chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 30.44,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 47.75,
				},
			},
			["wildvine"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 33.36,
					["count"] = 0,
					["icon"] = 19,
					["y"] = 15.73,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 11.27,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 2.1,
				},
			},
			["Магороза"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 54.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 55.52,
				},
			},
			["liferoot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.14,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 12.21,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.44,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 10.54,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 41.57,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 12.73,
				},
			},
			["Косяк огнеперого луциана"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 90.16,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 97.67,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 42.02,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 11.84,
				},
			},
			["blindkraut"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.78,
					["count"] = 0,
					["icon"] = 21,
					["y"] = 34.11,
				},
			},
			["瘟疫花"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.66,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 36.06,
				},
			},
			["Ящик"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.23,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 65.8,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 84.31,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 37.44,
				},
			},
		},
		[19] = {
			["del vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 21.31,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 56.53,
				},
			},
			["sonnengras"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.54,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 54.07,
				},
			},
			["lebenswurz"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 34.72,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 23.91,
				},
			},
			["del"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.47,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 40.61,
				},
			},
			["真银矿床"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 49.84,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 27.49,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 62.87,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 36.75,
				},
			},
			["ammo crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.09,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 56.87,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 67.36,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 51.5,
				},
			},
			[" kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 44.75,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 33.04,
				},
			},
			["wintersbite"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.83,
					["count"] = 0,
					["icon"] = 16,
					["y"] = 4.04,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.85,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 57.76,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 33.63,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 24.15,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 29.87,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 6.75,
				},
			},
			["kingsblood"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 48.48,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 39.57,
				},
			},
			["firebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 27.6,
					["count"] = 0,
					["icon"] = 17,
					["y"] = 85.34999999999999,
				},
			},
			[" earthroot"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 30.45,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 36.19,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 71.95,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 62.24,
				},
			},
			["mossy footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 74.2,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 58.51,
				},
			},
			["khadgar's whisker"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.57,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 45.13,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 9.51,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 7.53,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 78.55,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 33.89,
				},
			},
			["Сейф Янтарной мельницы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.71,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 65.23,
				},
			},
			["mage royal"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 36.53,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 26.27,
				},
			},
		},
		[20] = {
			[" iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.97,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 58.88,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 53.05,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 54.3,
				},
			},
			["horde supply crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 56.49,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 43.9,
				},
			},
			["ghost mushroom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.02,
					["count"] = 0,
					["icon"] = 22,
					["y"] = 41.99,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 46.14,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 11.89,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 59.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 25.14,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 21.66,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 57.3,
				},
			},
			["坚固的箱子"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 75.51000000000001,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 30.02,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 9.19,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 3.09,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.45,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 54.57,
				},
			},
			["grabmoos"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.95,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 53.16,
				},
			},
			["filon d'étain"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 29.13,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 81.40000000000001,
				},
			},
			["plaguebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 26.05,
					["count"] = 0,
					["icon"] = 28,
					["y"] = 13.38,
				},
			},
			["Плавающие обломки"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 81,
				},
			},
			["Ящик Аберкромби"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33.34,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 76.3,
				},
			},
			["gisement de fer"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38.7,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 62.27,
				},
			},
			["sansam doré"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 69.67,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 59.13,
				},
			},
		},
		[21] = {
			["Ящик с припасами с карьера"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 66.8,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 23.49,
				},
			},
			["Дикий сталецвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 23.12,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 13.91,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.68,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 54.43,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 98.97,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 85.01000000000001,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 71.66,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 86.04000000000001,
				},
			},
			["or"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.43000000000001,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 39.33,
				},
			},
			["excavation supply crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 66.25,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 23.68,
				},
			},
			["icecap"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.47,
					["count"] = 0,
					["icon"] = 29,
					["y"] = 53.22,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 75.42,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 32.86,
				},
			},
			["Мифриловые залежи"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 77.91,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 12.61,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 23.78,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 94.42,
				},
			},
			["perrine's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 51.08,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 67.53,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 30.48,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 7.55,
				},
			},
			[" Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 25.33,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 67.89,
				},
			},
			["giant clam"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.56,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 22.55,
				},
			},
			["sansam doré"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.23,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 62.18,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 62.04,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 90.92,
				},
				[2] = {
					["gtype"] = 2,
					["x"] = 29.71,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 42.5,
				},
			},
			["storage chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 44.19,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 65.78,
				},
			},
		},
		[22] = {
			["eisenvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 35.65,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 53.92,
				},
			},
			["Ящики для оборудования"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 33,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 65.28,
				},
			},
			["Ящик со съестными припасами"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 79.63,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 25.1,
				},
			},
			["gold vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 66.84,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 47.97,
				},
			},
			["copper vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 54.28,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 44.83,
				},
			},
			["wild steelbloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 76.69,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 99.66,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 12.06,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 86.99,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 77.06,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 90.55,
				},
			},
			["Плавающие обломки"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 34.07,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 36.95,
				},
			},
			["Слезы Артаса"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 94.08,
					["count"] = 0,
					["icon"] = 25,
					["y"] = 78.18000000000001,
				},
			},
			["Бледнолист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 74.78,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 90.56999999999999,
				},
			},
			["khadgars schnurrbart"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 57.11,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 54.42,
				},
			},
			["stranglekelp"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.86,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 90.41,
				},
			},
			[" Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 49.41,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 63.14,
				},
			},
			["Удавник"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 61.4,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 90.68000000000001,
				},
			},
			["chest of containment coffers"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 85.34,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 10.12,
				},
			},
			["Корень жизни"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 72.97,
					["count"] = 0,
					["icon"] = 12,
					["y"] = 90.15000000000001,
				},
			},
			["alexston's chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 36.64,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 55.54,
				},
			},
		},
		[23] = {
			["briarthorn"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.78,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 56.01,
				},
			},
			["old treasure chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 65.77,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 74.31,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 47.4,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 49.62,
				},
			},
			["water barrel"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 46.85,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 53.57,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 49.52,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 48.45,
				},
			},
			["sungrass"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.84,
					["count"] = 0,
					["icon"] = 20,
					["y"] = 39.54,
				},
			},
			["食品箱"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 29.46,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 81.08,
				},
			},
			["silver vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 25.39,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 98.84,
				},
			},
			["blood of heroes"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.35,
					["count"] = 0,
					["icon"] = 11,
					["y"] = 54.95,
				},
			},
			["Залежи истинного серебра"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 27.39,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 38.39,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 32.5,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 93.91,
				},
			},
			["dark iron deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 36.7,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 78.04000000000001,
				},
			},
			["lila lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 40.27,
					["count"] = 0,
					["icon"] = 18,
					["y"] = 65.37000000000001,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 87.09,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 71.62000000000001,
				},
			},
			["dented footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 39.07,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 24.43,
				},
			},
			["银矿"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 38.82,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 13.89,
				},
			},
			["greater sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 4.41,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 97.31,
				},
			},
			["small thorium vein"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.12,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 13.12,
				},
			},
			["mithril deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 26.57,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 89.04000000000001,
				},
			},
			["Оловянная жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 48.02,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 33.47,
				},
			},
		},
		[24] = {
			["food crate"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 52.23,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 14.57,
				},
			},
			["fass mit süßem nektar"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.45,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 44.08,
				},
			},
			["captain's footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 25.97,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 47.8,
				},
			},
			["Мироцвет"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 7.33,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 10.08,
				},
			},
			["floating wreckage"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 84.95,
					["count"] = 0,
					["icon"] = 14,
					["y"] = 91.84,
				},
			},
			["地根草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 47.28,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 27.04,
				},
			},
			["greater sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 82.15000000000001,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 90.77,
				},
			},
			["arena treasure chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 30.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 47.85,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 58.41,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 8.4,
				},
			},
			["box of assorted parts"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 41.34,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 66.41,
				},
			},
			["bruiseweed"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 56.58,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 52.48,
				},
				[2] = {
					["gtype"] = 1,
					["x"] = 87.33,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 65.53,
				},
			},
			["sagefish school"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.42,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 39.69,
				},
			},
			["pacifique"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 46.76,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 74.62000000000001,
				},
			},
			["fadeleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 98.36,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 95.14,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 85.98,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 92.76000000000001,
				},
			},
			["duskwood chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 70.41,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 73.93000000000001,
				},
			},
			["Кадгаров ус"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 97,
					["count"] = 0,
					["icon"] = 15,
					["y"] = 91.40000000000001,
				},
			},
			["locked chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 26.02,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 16.98,
				},
			},
			["peacebloom"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 50.91,
					["count"] = 0,
					["icon"] = 1,
					["y"] = 61.33,
				},
			},
			["Добротный сундук"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 35.65,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 0.12,
				},
			},
			[" Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 62.05,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 40.17,
				},
			},
			["mithrilablagerung"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.84,
					["count"] = 0,
					["icon"] = 6,
					["y"] = 67.14,
				},
			},
			["墓地苔"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 28.29,
					["count"] = 0,
					["icon"] = 10,
					["y"] = 57.03,
				},
			},
		},
		[25] = {
			["raíz de tierra"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 66.14,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 70.89,
				},
			},
			["Остротерн"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 3.4,
					["count"] = 0,
					["icon"] = 5,
					["y"] = 83.64,
				},
			},
			["solid chest"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 45.57,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 46.25,
				},
				[2] = {
					["gtype"] = 0,
					["x"] = 13.4,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 41.44,
				},
			},
			["black lotus"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 20.2,
					["count"] = 0,
					["icon"] = 30,
					["y"] = 67.8,
				},
			},
			["Косяк рыбы"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 53.89,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 15.86,
				},
			},
			["Сребролист"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.1,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 57.54,
				},
			},
			["golden sansam"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 70.40000000000001,
					["count"] = 0,
					["icon"] = 24,
					["y"] = 0.19,
				},
			},
			["枯叶草"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 35.11,
					["count"] = 0,
					["icon"] = 13,
					["y"] = 54.79,
				},
			},
			["Земляной корень"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 88.49,
					["count"] = 0,
					["icon"] = 3,
					["y"] = 62.11,
				},
			},
			["truesilver deposit"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 31.4,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 5.81,
				},
			},
			["echtsilbervorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 15.8,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 32.85,
				},
			},
			["battered footlocker"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 16.25,
					["count"] = 0,
					["icon"] = 7,
					["y"] = 35.72,
				},
			},
			["silverleaf"] = {
				[1] = {
					["gtype"] = 1,
					["x"] = 41.43,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 52.07,
				},
			},
			["kleines thoriumvorkommen"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 47.32,
					["count"] = 0,
					["icon"] = 8,
					["y"] = 71.13,
				},
			},
			["robuste truhe"] = {
				[1] = {
					["gtype"] = 0,
					["x"] = 63.47,
					["count"] = 0,
					["icon"] = 2,
					["y"] = 23.63,
				},
			},
			["Богатая ториевая жила"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 71.67,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 17.3,
				},
			},
		},
	},
	[0] = {
		[0] = {
			["富瑟银矿"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 50.65,
					["count"] = 0,
					["icon"] = 9,
					["y"] = 41.87,
				},
			},
			["铁矿石"] = {
				[1] = {
					["gtype"] = 2,
					["x"] = 38.38,
					["count"] = 0,
					["icon"] = 4,
					["y"] = 57.97,
				},
			},
		},
	},
}
Gatherer_SavedSettings_AccountWide = {
	["p2p"] = true,
	["miniIconDist"] = 30,
	["minderTime"] = 5,
	["maxDist"] = 20,
	["interested"] = {
		[1] = {
			["briarthorn"] = true,
			["icecap"] = true,
			["ghost mushroom"] = true,
			["gromsblood"] = true,
			["swiftthistle"] = true,
			["silverleaf"] = true,
			["black lotus"] = true,
			["earthroot"] = true,
			["sungrass"] = true,
			["blindweed"] = true,
			["goldthorn"] = true,
			["mageroyal"] = true,
			["wildvine"] = true,
			["arthas' tears"] = true,
			["wintersbite"] = true,
			["wild steelbloom"] = true,
			["bruiseweed"] = true,
			["kingsblood"] = true,
			["liferoot"] = true,
			["fadeleaf"] = true,
			["dreamfoil"] = true,
			["mountain silversage"] = true,
			["plaguebloom"] = true,
			["purple lotus"] = true,
			["stranglekelp"] = true,
			["khadgar's whisker"] = true,
			["firebloom"] = true,
			["peacebloom"] = true,
			["golden sansam"] = true,
			["grave moss"] = true,
		},
		[2] = {
			["tin"] = true,
			["copper"] = true,
			["iron"] = true,
			["truesilver"] = true,
			["thorium (rich)"] = true,
			["mithril"] = true,
			["dark iron"] = true,
			["gold"] = true,
			["thorium"] = true,
			["silver"] = true,
		},
		[3] = {
		},
		[0] = {
			["windblossom"] = true,
			["whipper root"] = true,
			["crate"] = true,
			["floating wreckage"] = true,
			["blood of heroes"] = true,
			["songflower"] = true,
			["chest"] = true,
			["night dragon"] = true,
			["shellfish trap"] = true,
			["box"] = true,
			["footlocker"] = true,
			["patch of elemental water"] = true,
			["barrel"] = true,
			["school"] = true,
			["bloodpetal"] = true,
			["giant clam"] = true,
			["un'goro soil"] = true,
			["power crystal"] = true,
			["cask"] = true,
		},
	},
	["NoIconOnMinDist"] = 0,
	["filters"] = {
		[1] = "auto",
		[2] = "auto",
		[3] = "auto",
		[0] = "auto",
	},
	["HideOnButton"] = 0,
	["debug"] = false,
	["fadeDist"] = 60,
	["HideIcon"] = 0,
	["alphaUnderMinIcon"] = 80,
	["number"] = 10,
	["filterRecording"] = {
		[1] = false,
		[2] = false,
		[3] = false,
		[0] = false,
	},
	["HideMiniNotes"] = 0,
	["disableWMFreezeWorkaround"] = 1,
	["ShowOnButton"] = 0,
	["mapMinder"] = false,
	["ShowOnClick"] = 0,
	["HideOnClick"] = 0,
	["showWorldMapFilters"] = 0,
	["Radius"] = 80,
	["iconSet"] = "shaded",
	["Position"] = 12,
	["rareOre"] = 0,
	["ShowOnMouse"] = 1,
	["ToggleWorldNotes"] = 0,
	["logInfo"] = "on",
	["useMinimapText"] = "on",
	["useMainmap"] = true,
	["Version"] = "1.0.0",
	["filter"] = "all",
	["fadePerc"] = 80,
	["HideOnMouse"] = 1,
	["IconSize"] = 12,
	["useMinimap"] = true,
}
